[
    {
        "name": "Agricultural Crops Production NC I",
        "core_competencies": [
            {
                "page_content": "TR – Agricultural Crops Production NC I 32 CORE COMPETENCIES UNIT OF COMPETENCY: Support horticultural crop work UNIT CODE: AGR611306 UNIT DESCRIPTOR: This unit covers the skills and knowledge required to support horticultural production under supervision. It requires the ability to prepare materials, tools and equipment for horticultural production work, undertake routine production assistance work, handle materials and equipment, and clean up on completion of work. Supporting horticultural production work requires knowledge of safe work practices relating to basic crop handling techniques including planting, maintaining, picking and packing, loading and unloading, and using associated farm tools and equipment. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1 Prepare materials, tools and equipment for horticultural production work 1.1 The required materials, tools and equipment are identified according to lists provided and/or supervisor’s instructions. 1.2 Checks are conducted on all materials, tools and equipment with insufficient or faulty items reported to the supervisor. 1.3 Techniques used when loading and unloading materials demonstrate correct manual handling and minimize damage to the load and the vehicle. 1.4 Suitable personal protective equipment (PPE) is selected and checked prior to use. 1.5 Work support is provided according to OHS requirements and according to workplace information. 1.6 OHS hazards are identified and reported to the supervisor.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 33 2 Undertake horticultural production work as directed 2.1 Instructions and directions provided by supervisor are followed and clarification sought when necessary. 2.2 Work is undertaken in a safe and environmentally appropriate manner according to enterprise guidelines. 2.3 Interactions with other staff and customers is carried out in a positive and professional manner. 2.4 Enterprise policy and procedures in relation to workplace practices, handling and disposal of materials is observed. 2.5 Problems or difficulties in completing work to required standards or timelines are reported to supervisor. 3 Handle materials and equipment 3.1 Waste material produced during work is stored in a designated area according to supervisor’s instructions. 3.2 Materials, equipment and machinery are handled and transported according to supervisor’s instructions and enterprise guidelines. 3.3 A clean and safe work site is maintained while working. 4 Clean up on completion of work 4.1 Materials are returned to store or disposed of according to supervisor’s instructions. 4.2 Tools and equipment are cleaned, maintained and stored according to manufacturers specifications and supervisors instructions. 4.3 Work outcomes are reported to the supervisor.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 34 RANGE OF VARIABLES VARIABLE RANGE 1. horticultural production 1.1. Crops may include fruit, vegetables, herbs, flowers, foliage, bulbs, tubers, nuts, mushrooms, wild harvest plants and oils. 2. horticultural crop work 2.1 Assistance with all activities associated with horticultural production such as land preparation, seeding/planting, maintaining, loading and unloading, harvesting/picking, sorting, and packing. 2.2 Assisting with routine maintenance or cleaning of sheds and other buildings, fences, fixtures and fitting. 3. instructions 3.1 Instructions may include Standard Operating Procedures (SOPs), enterprise policy and procedures, specifications, work notes, Material Safety Data Sheets (MSDSs), manufacturers instructions, or verbal directions from manager or supervisor. 4. tools and equipment 4.1 Tools and equipment may include knives, secateurs, spades, forks, ladders, hoes, packing equipment, boxes, bins and buckets, hoses and hose fittings. 5. workplace information 5.1 Workplace information may include procedures for disposing of waste materials, work instructions or verbal instructions from the supervisor. 6. OHS hazards 6.1 Hazards may include, solar radiation, dust, noise, air- and soil-borne micro-organisms, chemicals and hazardous substances, sharp hand tools and equipment, manual handling, holes, and slippery and uneven surfaces. 7. Personal protective clothing and equipment 7.1 Personal protective clothing and equipment may include steel capped boots/shoes, overalls, gloves, sun hat, sunscreen lotion, safety goggles, face mask and ear protectors. 8. Waste materials 8.1 Plant debris, litter and broken components, plastic, metal, paper-based materials. These may be recycled, re-used, returned to the manufacturer or disposed of according to enterprise work procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 35 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1. Demonstrated competence in supporting horticultural production work which have been carried out according to instructions and within the required timeliness. 1.2. The skills and knowledge that are required to support horticultural production work must be transferable to different work environments. For example, this could include different tasks, crops and types of orchards/plantations/farms. 2. Underpinning Knowledge and Attitudes Knowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts, and to deal with unplanned events. The knowledge requirements for this competency standard are listed below. 2.1 safe work practices 2.2 planting, picking, packing, loading and transporting techniques appropriate to this level 2.3 use of horticultural tools and equipment. 3. Underpinning Skills To achieve the performance criteria, appropriate literacy and numeracy levels as well as some complementary skills are required. These include the ability to: 3.1 prepare materials, tools and equipment for work 3.2 undertake work as directed 3.3 handle materials and equipment 3.4 clean up on completion of work. 4. Resource Implication The following resources should be provided: 4.1 workplace with nursery facilities 4.2 tools, equipment and materials required for nursery operations 4.3 enterprise procedures. 5. Methods of Assessment Competency should be assessed: 5.1 through direct observation/demonstration 5.2 portfolio 6. Context of Assessment 6.1 Assessment should be in a workplace. 6.2 Demonstration of competency over time and on a number of occasions.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 36 UNIT OF COMPETENCY: SUPPORT NURSERY WORK UNIT CODE: AGR 611307 UNIT DESCRIPTOR: This unit covers the skills and knowledge required to carry out work in wholesale or retail nurseries while under supervision. It requires the ability to prepare materials, tools and equipment for nursery work, undertake nursery work activities, store and stockpile materials, and clean up on completion of work. Supporting nursery work requires knowledge of safe work practices, nursery hygiene and quality control, nursery plant maintenance activities, basic stock control procedures, and propagation techniques. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1 Prepare materials, tools and equipment for nursery work 1.1 The required materials, tools and equipment are identified according to lists provided and/or supervisor’s instructions. 1.2 Checks are conducted on all materials, tools and equipment, with insufficient or faulty items reported to the supervisor. 1.3 Techniques used when loading and unloading materials demonstrate correct manual handling, and minimize damage to the load and the vehicle. 1.4 Suitable personal protective equipment (PPE) is selected and checked prior to use. 1.5 Nursery support is provided according to OHS requirements and workplace information. 1.6 OHS hazards are identified and reported to the supervisor.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 37 2 Undertake nursery work as directed 2.1 Instructions and directions provided by supervisor are followed, and clarification sought when necessary. 2.2 Nursery work is undertaken in a safe and environmentally appropriate manner according to nursery guidelines. 2.3 Interactions with other staff and customers is carried out in a positive and professional manner. 2.4 Nursery policy, procedures and OHS requirements in relation to workplace hygiene practices, handling and disposal of materials is observed. 2.5 Problems or difficulties in completing work to required standards or timelines are reported to supervisor. 3 Store and stockpile materials 3.1 Plant debris and waste material produced during nursery activities are stored according to supervisor’s instructions. 3.2 Plant debris and waste materials are prepared and processed in an appropriate and safe manner according to supervisor’s instructions. 3.3 Surplus materials are stockpiled for removal according to supervisor’s instructions. 3.4 A clean and safe work site is maintained while completing nursery activities. 4 Clean up on completion of nursery work 4.1 Plants and materials are stored according to supervisor’s instructions and OHS requirements. 4.2 Tools and equipment are cleaned, maintained and stored according to manufacturers specifications and supervisors instructions. 4.3 Work outcomes are reported to the supervisor.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 38 RANGE OF VARIABLES VARIABLE RANGE 1. nursery work 1.1 Assisting with the display of nursery products (e.g., plant, goods and supplies) including unpacking, placing where directed, replenishing as required, preparing and placing price tickets, labels and other display materials. 1.2 Provide nursery plant care including watering, weeding, removing dead materials, staking, trimming, and potting on of plants as directed. 1.3 Load and unload nursery stock including preparing stock for dispatch, and checking stock on receipt or at dispatch against documentation. 1.4 Supporting propagation activities including assisting with preparing planting media, collecting propagating materials, and blocking up plants in correct patterns and spacing. 2. instructions 2.1 Instructions may include Standard Operating Procedures (SOPs), company policy and procedures in regard to product merchandising and displays, specifications, work notes, Material Safety Data Sheets (MSDSs), manufacturers instructions, product labels, or verbal directions from manager, supervisor, or senior operator. 3. tools and equipment 3.1 Tools and equipment may include manual or electronic ticketing/labelling equipment, wheelbarrows, trolleys, motorised trolleys, scissors, cleaning equipment, secateurs, knives, media trays, water spray container, dibblers, and rubbish bins. 4. workplace information 4.1 Workplace information may include procedures for disposing of waste materials, work instructions or verbal instructions from the supervisor, OHS legislative requirements and relevant Codes of Practice. 5. OHS hazards 5.1 Hazards may include heavy materials and equipment, slippery or uneven surfaces, moving machinery and vehicles, solar radiation, and potential dangers from handling potting media, fertilisers, watering systems, and spider and insect bites.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 39 \n6. personal protective clothing and equipment \n6.1 Personal protective clothing and equipment may include steel capped boots/shoes, overalls, gloves, sun hat, sunscreen lotion, safety goggles, face mask and ear protectors. \n7. hygiene practices \n7.1 Hygiene practices which may be applied include disinfestation and storage of planting media, disinfestation of contaminated plants and materials, hand washing, footbaths, sanitising/sterilising tools, equipment and benching, access restrictions, and handling practices which minimise cross contamination. \n8. waste \n8.1 Environmental considerations for waste disposal may include prompt removal and/or disinfestation of organic waste, use of mixing site, neutralising pits for disposal of chemicals and cleaning products, recycling seed trays, poly trays, bags, and recycling waste water or disposing using approved discharge system.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 40 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1 Demonstrate competence in supporting nursery work requires evidence that nursery – related work which been carried out according to instructions and within the required timelines. 1.2 The skills and knowledge that are required to support nursery work must be transferable to a different work environment. For example, this could include different work tasks, types of nurseries and supervisors. 2. Underpinning Knowledge and Attitudes Knowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts and to deal with unplanned events. The knowledge requirements for this competency standard are listed below. 2.1 Safe work practices. 2.2 Nursery hygiene and quality control. 2.3 Nursery plant maintenance activities. 2.4 Basic stock control procedures. 2.5 Propagation techniques. 2.6 OHS legislative requirements and Codes of Practice. 3. Underpinning Skills To achieve the performance criteria, appropriate literacy and numeracy levels as well as some complementary skills are required. These include the ability to: 3.1 Prepare materials, tools and equipment for nursery work. 3.2 Undertake nursery work as directed. 3.3 Store and stockpile materials. 3.4 Clean up on completion of nursery work. 4. Resource Implication The following resources should be provided: 4.1 workplace with nursery facilities 4.2 tools, equipment and materials required for nursery operations 4.3 enterprise procedures. 5. Methods of Assessment Competency should be assessed: 5.1 through direct observation / demonstration 5.2 portfolio. 6. Context of Assessment 6.1 Assessment should be in a workplace.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 41 6.2 Demonstration of competency over time and on a number of occasions. UNIT OF COMPETENCY: SUPPORT AGRONOMIC CROP WORK UNIT CODE: AGR611308 UNIT DESCRIPTOR: This unit covers the skills and knowledge required to support agronomic cropping work under supervision. It requires the ability to prepare materials; tools and equipment for cropping work, undertake cropping activities, handle materials and equipment, and clean up on completion of work. Supporting agronomic cropping work requires knowledge of safe work practices, cropping practices and related tools and equipment. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1 Prepare materials, tools and equipment for agronomic crop work 1.1 The required materials, tools and equipment are identified according to lists provided and/or supervisor’s instructions. 1.2 Checks are conducted on all materials, tools and equipment with insufficient or faulty items reported to the supervisor. 1.3 Techniques used when loading and unloading materials demonstrate correct manual handling and minimize damage to the load and the vehicle. 1.4 Suitable personal protective equipment (PPE) is selected and checked prior to use. 1.5 Cropping support is provided according to OHS requirements and according to workplace information. 1.6 OHS hazards are identified and reported to the supervisor.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 42 2 Undertake agronomic crop work as directed 2.1 Instructions and directions provided by supervisor are followed and clarification sought when necessary. 2.2 Cropping work is undertaken in a safe and environmentally appropriate manner according to enterprise guidelines. 2.3 Interactions with other staff and customers are carried out in a positive and professional manner. 2.4 Enterprise policy and procedures in relation to workplace practices, handling and disposal of materials is observed. 2.5 Problems or difficulties in completing work to required standards or timelines are reported to supervisor. 3 Handle materials and equipment 3.1 Waste material produced during cropping work is stored in a designated area according to supervisor’s instructions. 3.2 Materials, equipment and machinery are handled and transported according to supervisor’s instructions and enterprise guidelines. 3.3 A clean and safe work site is maintained while completing cropping activities. 4 Clean up on completion of cropping work 4.1 Materials are returned to store or disposed of according to supervisor’s instructions. 4.2 Tools and equipment are cleaned, maintained and stored according to manufacturers specifications and supervisors instructions. 4.3 Work outcomes are reported to the supervisor.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 43 RANGE OF VARIABLES VARIABLE RANGE \n1. Agronomic crop 1.1 Agronomic crops covered by this unit include coarse grains, grain legumes, coffee, coconuts, cotton, soya beans, peanuts and sugar cane. \n2. Agronomic crop work 2.1 Assistance with all activities associated with cropping such as land preparation, seeding, fertilizing, harvesting, baling, raking, loading and unloading or other relevant duties. 2.2 Removing weeds (rouging) or rocks from crops or fields, and routine maintenance of sheds and other workplaces. \n3. Instructions 3.1 Instructions may include Standard Operating Procedures (SOPs), enterprise policy and procedures, specifications, work notes, Material Safety Data Sheets (MSDSs), manufacturers instructions, or verbal directions from manager or supervisor. \n4. Tools and equipment 4.1 Tools and equipment may include knives, hand tools, rope, sack trucks, fencing tools, augers, and brooms. \n5. Workplace information 5.1 Workplace information may include procedures for disposing of waste materials, work instructions or verbal instructions from the supervisor. \n6. OHS hazards 6.1 Hazards may include, solar radiation, dust, noise, air- and soil-borne microorganisms, chemicals and hazardous substances, sharp hand tools and equipment, manual handling, holes, and slippery and uneven surfaces. \n7. Personal protective clothing and equipment 7.1 Personal protective clothing and equipment may include steel-capped boots/shoes, overalls, gloves, sun hat, sunscreen lotion, safety goggles, face mask and ear protectors. \n8. Waste materials 8.1 Plant debris, litter and broken components, plastic, metal, or paper-based materials. These may be recycled, re-used, returned to the manufacturer or disposed of according to enterprise work procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 44 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1. Demonstrated competence in supporting cropping work which is carried out according to instructions and within the required timelines. 1.2. The skills and knowledge that are required to support cropping work must be transferable to different work environments. For example, this could include different tasks, enterprises, and types of crops. 2. Underpinning Knowledge and Attitudes Knowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts, and to deal with unplanned events. The knowledge requirements for this competency standard are listed below. 2.1 safe work practices 2.2 farm tools and equipment 2.3 repair and maintenance of structures. 3. Underpinning Skills To achieve the performance criteria, appropriate literacy and numeracy levels as well as some complementary skills are required. These include the ability to: 3.1 prepare materials, tools and equipment for cropping work 3.2 undertake work as directed 3.3 handle materials and equipment 3.4 clean up on completion of work. 4. Resource Implication The following resources should be provided: 4.1 workplace with commercial cropping 4.2 tools, equipment and materials required for supporting cropping activities 4.3 enterprise procedures cropping activities 5. Methods of Assessment Competency should be assessed: 5.1 through direct observation / demonstration 5.2 portfolio 6. Context of Assessment 6.1 Assessment should be in a workplace. 6.2 Demonstration of competency over time and on a number of occasions.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 45 UNIT OF COMPETENCY: SUPPORT IRRIGATION WORK UNIT CODE: AGR611309 UNIT DESCRIPTOR This unit covers the skills and knowledge required to support the installation, operation and maintenance of watering and drainage systems under direct supervision. It requires the ability to prepare materials, tools and equipment for irrigation work, undertake irrigation activities, handle materials and equipment, and clean up on completion of work. Supporting irrigation work requires knowledge of safe work practices, irrigation work techniques, irrigation tools and equipment, and repair and maintenance of irrigation components and systems. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1 Prepare materials, tools and equipment for irrigation work 1.1 The required materials, tools and equipment are identified according to lists provided and/or supervisor’s instructions. 1.2 Checks are conducted on all materials, tools and equipment with insufficient or faulty items reported to the supervisor. 1.3 Techniques used when loading and unloading materials demonstrate correct manual handling and minimize damage to the load and the vehicle. 1.4 Suitable personal protective equipment (PPE) is selected and checked prior to use. 1.5 Irrigation support is provided according to OHS requirements and according to workplace information. 1.6 OHS hazards are identified and reported to the supervisor.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 46 2 Undertake irrigation work as directed 2.1 Instructions and directions provided by supervisor are followed, and clarification sought when necessary. 2.2 Irrigation work is undertaken in a safe and environmentally appropriate manner according to enterprise guidelines. 2.3 Interactions with other staff and customers is carried out in a positive and professional manner. 2.4 Enterprise policy and procedures in relation to workplace practices, handling and disposal of materials is observed. 2.5 Problems or difficulties in completing work to required standards or timelines are reported to supervisor. 3 Handle materials and equipment 3.1 Waste material and debris produced during irrigation work is stored in a designated area according to supervisor’s instructions. 3.2 Materials, equipment and machinery are handled and transported according to supervisor’s instructions and enterprise guidelines. 3.3 A clean and safe work site is maintained while undertaking irrigation activities. 4 Clean up on completion of irrigation activities 4.1 Materials are returned to store or disposed of according to supervisor’s instructions. 4.2 Tools and equipment are cleaned, maintained and stored according to manufacturers specifications and supervisor’s instructions. 4.3 Site is made good according to supervisor’s instructions and good environmental practices. 4.4 Work outcomes are reported to the supervisor.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 47 RANGE OF VARIABLES VARIABLE RANGE 1. irrigation work 1.1 Assisting with installation of irrigation and/or drainage pipes and components for gravity fed or pressurised systems, including digging trenches, backfilling of trenches and completing other basic tasks as instructed. 1.2 Assisting with maintenance of irrigation and/or drainage systems including clearing blockages, and completing other basic tasks as instructed. 1.3 Work with a range of materials including plastic and metal pipes and components using hand tools commonly used in irrigation work. 1.4 Associated irrigation activities including assisting in establishing work base, clearing site, erecting barriers and signs, unloading and loading of materials, setting out of works, cleaning up site and disposal of debris and materials. 2. instructions 2.1 Instructions may include Standard Operating Procedures (SOPs), enterprise policy and procedures, specifications, work notes, Material Safety Data Sheets (MSDSs), manufacturers instructions, or verbal directions from manager or supervisor. 3. tools and equipment 3.1 Tools and equipment may include leveling equipment, wheelbarrow, string lines, tape measures, marking gauges, spades, shovels, crowbars, rakes, brooms, sanding blocks, and hacksaws. 4. workplace information 4.1 Workplace information may include procedures for disposing of waste materials, work instructions or verbal instructions from the supervisor. 5. OHS hazards 5.1 Hazards may include, solar radiation, dust, noise, air- and soil-borne micro-organisms, chemicals and hazardous substances, sharp hand tools and equipment, manual handling, holes, and slippery and uneven surfaces. 6. personal protective clothing and equipment 6.1 Personal protective clothing and equipment may include steel-capped boots/shoes, overalls, gloves, sun hat, sunscreen lotion, safety goggles, face mask, and ear protectors.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 48 7. waste materials 7.1 Plant debris, litter and broken components, mulches, compost, plastic, metal, and paper-based materials. These may be recycled, re-used, returned to the manufacturer, or disposed of according to enterprise work procedures. 8. made good 8.1 Paths are swept and cleaned, work area is left in a good state, disturbed areas are repaired, all materials, debris, tools and equipment are removed from site, and other signs of disturbance or damage are corrected.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 49 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1. Demonstrated competence in supporting irrigation work which have been carried out according to instructions and within the required timelines. 1.2. The skills and knowledge that are required to support irrigation work must be transferable to different work environments. For example, this could include different irrigation systems and components, work locations and enterprise policies and procedures. 2. Underpinning Knowledge and Attitudes Knowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts, and to deal with unplanned events. The knowledge requirements for this competency standard are listed below. 2.1 safe work practices 2.2 preparing for irrigation work and cleaning up on completion 2.3 basic construction techniques 2.4 irrigation tools and equipment 2.5 maintenance practices for planted areas 2.6 basic repair and maintenance of irrigation components and systems. 3. Underpinning Skills To achieve the performance criteria, appropriate literacy and numeracy levels as well as some complementary skills are required. These include the ability to: 3.1 prepare materials, tools and equipment for irrigation work 3.2 undertake irrigation work as directed 3.3 handle materials and equipment 3.4 clean up on completion of work.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR – Agricultural Crops Production NC I 50 4. Resource Implication The following resources should be provided: 4.1 workplace with irrigation (any type) and/or drainage system 4.2 tools, equipment and materials used for maintaining and operating irrigation and/or drainage system 4.3 enterprise procedures relating to irrigation and drainage operation and maintenance including maintenance schedules. 5. Methods of Assessment Competency should be assessed: 5.1 through direct observation / demonstration 5.2 portfolio 6. Context of Assessment 6.1 Assessment should be in a workplace. 6.2 Demonstration of competency over time and on a number of occasions.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC I.pdf",
                    "page": 51
                },
                "type": "Document"
            }
        ]
    }
]