[
    {
        "name": "Agricultural Crops Production NC II",
        "core_competencies": [
            {
                "page_content": "TR - Agricultural Crop Production NCI I\nPromulgated December 2013\n35 CORE COMPETENCY\nUNIT OF COMPETENCY: PERFORM NURSERY OPERATIONS\nUNIT CODE: AFF 610 301\nUNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to perform nursery operations for agricultural crops including establishing nursery shed, preparation and handling of planting materials, preparation of growing media, transplanting germinated seedlings and handling of nursery tools and equipment.\nELEMENTS PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range Statement\n1. Prepare nursery tools, farm implements and simple equipment\n1.1 Tools, farm implements and simple equipment are prepared according work requirements.\n1.2 Basic pre-operative checking of tools, farm implements and equipment is performed in accordance with manufacturer’s manual and GAP standard.\n1.3 Tools with wear and corrosions are segregated and treated according to maintenance plan and procedures.\n2. Maintain nursery facilities\n2.1 Nursery sanitation is maintained according to GAP standard.\n2.2 Repair and maintenance of nursery facilities are performed to maximize their efficiency and effectiveness.\n2.3 Preventive measures are applied for inclement weather.\n2.4 Safety measures are practice according to OSHS.\n3. Handle seeds/planting material\n3.1 Planting materials are determined according to kinds and varieties.\n3.2 Quality seeds are selected according to prescribed characteristics.\n3.3 Seed testing is conducted to determine the percentage germination of the seedstock in accordance with the standard procedures\n3.4 Planting materials are treated following standard protocol.\n3.5 Seed scarification is performed for germination purposes based on type of crop.\n4. Prepare growing media\n4.1 Growing media are prepared according to prescribed mixture and crop requirement.\n4.2 Growing media are placed in prescribed containers according to crop requirements.\n4.3 Containers are arranged and labelled according to varieties/species.\n4.4 Seedbed is prepared based on crop species.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 36 ELEMENTS PERFORMANCE CRITERIA Italicized terms are elaborated in the Range Statement 5. Conduct propagation activities 5.1 Nursery shed is set-up according to plant requirement 5.2 Quality seedlings are selected based on prescribed characteristics. 5.3 Propagation materials are selected according to propagation activity. 5.4 Plant propagation techniques are performed based on recommended practices. 5.5 Germinated seedlings are maintained until fully established. 5.6 Pricking and thinning of seedlings are performed based on recommended practices. RANGE OF VARIABLES VARIABLE SCOPE 1. Tools, farm implements and simple equipment Include the following but not limited to: 1.1. Tools: 1.1.1. Digging tools 1.1.2. Propagation tools 1.1.3. Harvesting tools 1.1.4. Measuring tools 1.2. Farm implements and simple equipment: 1.2.1. Water pumps 1.2.2. Hand tractor 1.2.3. Plow 1.2.4. Harrow 1.2.5. Sprayer 2. Planting materials Include the following but not limited to: 2.1. Seeds 2.2. Suckers 2.3. Tissue cultured plantlets 2.4. Cuttings 2.5. Rhizome 2.6. Corm 2.7. Grafted material 2.8. Tuber 2.9. Runner/Stolon 2.10. Bulb 3. Quality seeds Characteristics of quality seeds include the following: 3.1. Damage free 3.2. Viability 3.3. Free from mixture",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 37 4. Seed Testing Seed testing methods include the following but not limited to: 4.1. Rag doll method 4.2. Petri dish 4.3. Seed bed/seedbox 5. Seed scarification Seed scarification include the following: 5.1. Physical 5.2. Chemical 6. Growing media Include but not limited to the following: 6.1. Garden soil 6.2. Peat moss 6.3. Sawdust 6.4. Coco coir 6.5. Rice hull/carbonized rice hull 6.6. Compost 6.7. River sand 6.8. Animal manure 6.9. Wood cuttings 6.10. Fern slabs 6.11. Driftwood 7. Containers Include but not limited to the following: 7.1. Polyethylene bags 7.2. Clay pots 7.3. Plastic containers 7.4. Seed tray 7.5. Seed box 7.6. Coconut husk 7.7. Wired basket 8. Quality seedlings Include but not limited to the following: 8.1. Healthy 8.2. Vigorous growth 8.3. Height 8.4. Age 8.5. Number of leaves 9. Plant propagation techniques Include but not limited to the following: 9.1. Sexual (Seeds) 9.2. Asexual 9.2.1 Grafting (cleft, side, saddle) 9.2.2 Budding 9.2.3 Marcotting/air layering 9.2.4 Inarching/approached grafting 9.2.5 Cuttings 9.2.6 Division",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 38 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1. Selected planting materials. 2. Conducted seed testing 3. Prepared growing medium. 4. Performed plant propagation techniques 2. Required Knowledge and Attitudes 2.1 Safety Practices 2.1.1 Knowledge on HACCP principles 2.1.2 Knowledge on Good Agricultural Practices (GAP) 2.1.3 Knowledge on Occupational Safety and Health Standards (OSHS) 2.2 Mathematics and Measurement 2.2.1 Measurement of humidity and temperature 2.2.2 Measurement of area, volume, and weight 2.2.3 Measurement of fertilizer and pesticides 2.3 Tools & Equipment: Uses and Specification 2.3.1 Use of measuring devices 2.3.2 Use of tools and equipment 2.4 Systems, Processes and Operations 2.4.1 Preparation of calendar of activities 2.4.2 Irrigation methods 2.4.3 Different seed/planting materials 2.4.4 Different growing media 2.4.5 Preparation and mixing of growing media 2.4.6 Transplanting procedure 2.4.7 Propagation techniques 2.4.8 5S and 3Rs 2.5 Pest control procedures 2.5.1 Pest monitoring 2.5.2 Pesticide application methods 2.6 Values 2.6.1 Effective team player 2.6.2 Smooth Interpersonal Relationship (SIR) 2.6.3 Observant of work ethics 3. Required Skills 3.1 Basic mathematical processes of addition, subtraction, division and multiplication 3.2 Skills in plant propagation techniques 3.3 Interpretation of procedural manuals 4. Resource Implications The following resources should be provided: 4.1 Shed/Greenhouse 4.2 Writing instruments 4.3 Nursery tools/implements/equipment 4.4 Nursery supplies 4.5 Logbooks 4.6 Irrigation system and parts",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 39 4.7 References (NSIC catalogue, GAP, OSHS, HACCP manuals, etc.) 5. Methods of Assessment Competency in this unit may be assessed through: 5.1. Direct Observation and questioning 5.2. Demonstration 5.3. Oral interview and written test 5.4. Third party report 6. Context of Assessment 6.1 Competency may be assessed individually in the actual workplace or through accredited institution",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 40 UNIT OF COMPETENCY: PLANT CROPS UNIT CODE: AFF 610 302 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to conduct activities related to land preparation and planting of agricultural crops. This unit also includes proper handling of seeds/seedlings/saplings for planting and transplanting, proper use of tools and equipment, conduct land preparation and field lay-out. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range Statement 1. Prepare land for planting 1.1 Tools, materials and equipment are prepared for land clearing 1.2 The land is cleared according to prescribed methods of land preparation 1.3 Debris are removed and disposed according to waste management standards. 1.4 Soil samples are collected for analysis based on standard procedure 1.5 Land preparation is conducted according to crop requirement. 1.6 Basal fertilizer is applied based on crop requirement 1.7 Safety procedures for fertilizer application is followed according to OSHS 2. Conduct field lay-out 2.1 Tools and materials are prepared for field lay-out. 2.2 Interpret field lay-out plan according to the recommended planting system. 2.3 Field is laid-out according to recommended planting system 3. Dig holes 3.1 Diggings of holes are performed based on crop requirement. 3.2 Topsoil is separated to be used in covering the hole after planting. 3.3 Basal fertilizer application is performed based on the recommended amount. 4. Perform direct seeding 4.1 Seeds are planted according to the recommended rate, distance, and depth 4.2 Replanting is timely done according to recommended practices for a particular crop 4.3 Safety procedures are followed according to Occupational Safety and Health Standards (OSHS) and Good Agricultural Practices (GAP) 5. Transplant seedlings 5.1 Handling of seedlings from the nursery is performed based on prescribed practices. 5.2 Transplanting of seedlings is done based on crop practices 5.3 Re-bagging is done for a particular crop requirement 5.4 Replanting is timely done based on planting protocol. 5.5 Safety procedures are followed according to Occupational Safety and Health Standards (OSHS) and Good Agricultural Practices (GAP)",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 41 RANGE OF VARIABLES VARIABLE SCOPE 1. Tools, materials and equipment Include but not limited to the following: 1.1. Bolo 1.2. Scythe 1.3. Spade or shovel 1.4. Garden hoe 1.5. Rake 1.6. Grasscutter 1.7. Compost 1.8. Hand tractors and attachments 2. Debris Include but not limited to the following: 2.1. Stones 2.2. Sticks 2.3. Unwanted vegetation 2.4. Other garbage 3. Land preparation Include but not limited to the following: 3.1. Plowing 3.2. Harrowing 3.3. Leveling 3.4. Furrowing 4. Crop May include the following: 4.1. Ornamental plants 4.2. Plantation crops 4.3. Fruit crops 4.4. Vegetables 4.5. Root crops 4.6. Forage crops 4.7. Cereals 4.8. Herbs and spices 5. Fertilizer Include the following: 5.1. Organic 5.2. Inorganic 6. Planting system May include but not limited to the following: 6.1 Open Field 6.1.1. Raised bed 6.1.2. Square 6.1.3. Quincunx or diagonal 6.1.4. Hexagonal or triangular 6.1.5. Contour system 6.1.6. Single row 6.1.7. Double row 6.1.8. Broadcast method 6.2 Green house 6.2.1. Raised bed 6.2.2. Potted",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 42 EVIDENCE GUIDE 1. Critical Aspects of Competency 1.1 Carry-out land clearing 1.2 Conducted proper soil sampling/collection 1.3 Performed appropriate land preparation 1.4 Laid out site for planting 1.5 Dug holes 1.6 Sown seeds 1.7 Planted and transplanted seeds/seedlings/saplings 2. Required Knowledge and Attitudes 2.1 Systems of planting 2.2 Handling of fertilizers 2.3 Proper use and maintenance of cutting, digging and tillage tools 2.4 Use of measuring device 2.5 Proper use of tools and equipment 2.6 Occupational Health and Safety Standards 2.7 Good Agriculture Practice Standards by BAFPS 2.8 Waste management standards 2.9 Collection of soil sample 3. Required Skills 3.1. Proper handling of tools and equipment 3.2. Fertilizer application 3.3. Interpret lay-out 3.4. Digging holes 3.5. Operate hand tractors 4. Resource Implications The following resources should be provided: 4.1. Tool room and farm house 4.2. Farm tools/implements/equipment 4.3. Writing device 4.4. Farm supplies 4.5. Logbooks 4.6. References (fertilizer and pesticide manual/catalogue, protocols, field guides, OHS P and GAP manuals) 4.7. Production guide 5. Methods of Assessment Competency in this unit may be assessed through: 5.1. Direct Observation 5.2. Demonstration 5.3. Oral interview and/or written test 5.4. Third party report 6. Context of Assessment 6.1. Competency may be assessed individually in the actual workplace or through accredited institution",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 43 UNIT OF COMPETENCY: CARE AND MAINTAIN CROPS UNIT CODE: AFF 610 303 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to apply pest control, measure, apply fertilizer, water crops, perform pruning and perform physical growth-enhancing practices. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range Statement 1. Apply pest control measure 1.1 Pests incidence is monitored based on prescribed procedure. 1.2 Tools and materials are prepared according to specific pest control measure. 1.3 Appropriate pest control measures are followed based on GAP 1.4 Safety measures are observed and practiced according to Occupational Health and Safety (OHS) procedures. 2. Apply fertilizer 2.1 Tools and materials are prepared according to prescribed user’s manual 2.2 Fertilizers are identified based on kinds. 2.3 Fertilizer rates are applied based on crop requirements. 2.4 Appropriate method of fertilizer application is employed based on crop requirements. 2.5 Precautionary measures are applied to avoid cross contamination based on GAP. 2.6 Safety procedures are followed according to Occupational Safety and Health Standards 3. Water crops 3.1. Soil moisture content is determined based on soil field capacity 3.2. Watering performed following the prescribed method and schedule 3.3. Good Agricultural Practices is observed. 4. Perform pruning 4.1. Pruning method is performed according to crops. 4.2. Tools and materials for pruning are prepared. 4.3. Safety procedures are followed according to Occupational Safety and Health Standards and PNS:PAES 101 5. Perform physical growth-enhancing practices 5.1. Tools and equipment for cultivation are prepared according to PNS:PAES 101. 5.2. Cultivation practices are carried out based on crop requirement. 5.3. Rejuvenating activities are performed according to established cultural practices. 5.4. Growth training techniques are performed for different crops 5.5. Mulching techniques are carried out based on crops. 5.6. Safety procedures are followed according to Occupational Safety and Health Standards.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 44 RANGE OF VARIABLES VARIABLE RANGE 1. Pests Include but not limited to: 1.1. Weeds 1.2. Insects 1.3. Diseases 1.4. Mites 1.5. Rodents 1.6. Other pests 2. Tools and materials Includes but not limited to: 2.1. Knapsack/power sprayers 2.2. Measuring devices 2.3. Insect traps 2.4. Pesticides (bio or synthetic) 2.5. Pruning shears 2.6. Shovel 2.7. Safety gears 2.8. Paper/plastic sleeves 2.9. Fertilizer 2.10. Pail 2.11. Measuring cup 2.12. Hoe 2.13. Shovel 2.14. Carabao pulled implements 2.15. Pruning shear 2.16. Pruning saw 2.17. Bolo 2.18. Paint 3. Pest control measures Include but not limited to: 3.1. Physical 3.2. Mechanical 3.3. Biological 3.4. Cultural 3.5. Chemical (biopesticide, synthetic) 3.6. IPM 3.7. Sanitation 4. Fertilizers Include the following: 4.1. Organic 4.2. Inorganic 5. Method of fertilizer application Include but not limited to the following: 5.1. Basal 5.2. Sidedress 5.3. Topdress 5.4. Localized 5.5. Band 5.6. Foliar/Spray",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 45 VARIABLE RANGE 5.7. Broadcast 6. Watering Include but not limited to: 6.1. Drip 6.2. Furrow 6.3. Sprinkler 7. Rejuvenating activities Include but not limited to the following: 7.1. Grafting 7.2. Ratooning 7.3. De-suckering 8. Growth training technique Include but not limited to the following: 8.1. Hardening 8.2. Pricking 8.3. Thinning",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 46 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1. Performed pruning according to crops 1.2. Controlled weed population 1.3. Monitored pests through recording and reporting of pests incidence. 1.4. Practiced pest control measures 1.5. Applied fertilizer with appropriate method 1.6. Applied proper irrigation/watering of crops 1.7. Carried out cultivation practices based on crop requirement 1.8. Performed rejuvenating activities 1.9. Performed growth training technique for different crops 1.10. Carried out mulching techniques 1.11. Followed Occupational Health and Safety Standards 2. Required Knowledge and Attitudes 2.1. Pruning techniques 2.2. Weeding methods 2.3. Pest control procedures 2.4. Fertilizer application 2.5. Irrigation methods 2.6. Occupational Safety and Health Standards 3. Required Skills 3.1. Basic mathematical processes of addition, subtraction, division and multiplication 3.2. Proper handling of tools and equipment 3.3. Pest monitoring by recording and reporting pests incidence 3.4. Fertilizer and pesticide application 4. Resource Implications The following resources should be provided: 4.1. Farm or plantation area 4.2. Storage shed 4.3. Farm tools/ implements/ equipment 4.4. Farm supplies 4.5. Logbooks 4.6. Irrigation system and parts 4.7. References (fertilizer and pesticide manual/ catalogue, protocols, field guides, etc.) 5. Methods of Assessment Competency in this unit may be assessed through: 5.1. Direct Observation 5.2. Demonstration 5.3. Oral interview and/or written test 5.4. Third party report 6. Context of Assessment 6.1. Competency may be assessed individually in the actual workplace or through accredited institution",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 47 UNIT OF COMPETENCY: CARRY-OUT HARVEST AND POSTHARVEST OPERATIONS UNIT CODE: AFF610 304 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to perform harvest and postharvest operations of major agricultural crops including maintaining quality of produce for distribution. This unit also includes proper use of tools and equipment required to perform the activities. This unit does not include secondary processing. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range Statement 1. Perform pre-harvest operations 1.1 Crop maturity is identified according to parameters affecting physiological growth and physical indicators. 1.2 Records of crop agronomic history is verified and referenced for maturity. 1.3 Obstructions from the field are removed for efficient harvesting 1.4 Harvesting tools and materials, and temporary shed are readied 1.5 Records regarding crops to be harvested are checked 2. Perform harvesting activity 2.1 Appropriate harvesting methods are implemented based on best cultural practices for each crop using suitable tools 2.2 Crops are handled according to the postharvest treatment. 2.3 Crops are harvested based on maturity indices and characteristics affecting harvest quality 2.4 Harvesting is performed while observing GAP principles 3. Perform postharvest operation 3.1 Postharvest operations are employed based on standard are followed. 3.2 Use of postharvest equipment is monitored avoiding damage to crop in line with manufacturer/enterprise procedures. 3.3 Handling and packaging are done according to variety and destination. 3.4 Crops are stored and stacked in cool dry place prior to distribution in line with enterprise procedures 4. Monitor storage pest and diseases 4.1 Pest are identified based on references for storage pest and diseases 4.2 Identified storage pest and diseases are logged and reported to immediate authority.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 48 RANGE OF VARIABLES VARIABLE SCOPE 1. Physiological growth Include the following: 1.1 Days after flower induction 1.2 Days after fruit setting 2. Physical indicators Include the following: 2.1. Change in color 2.2. Change in size 2.3. Change in texture 3. Agronomic history Include the following: 3.1 Nursery source 3.2 Variety of plant 3.3 Planting calendar 3.3.1 Days after planting 3.3.2 Days at flowering 3.3.3 Days at fruit set 4. Obstructions May include but not limited to: 4.1. Weeds 4.2. Dead branches 4.3. Stakes and wedges 5. Harvesting tools and materials May include the following: 5.1. Picking poles 5.2. Scythes 5.3. Scissors 5.4. Shears 5.5. Shovels 5.6. Collecting baskets with liners 5.7. Harvesting crates with liner 5.8. Container with clean water with preservative 5.9. Sacks 5.10. Twines 5.11. Labels and markers 6. Records Include the following: 6.1. Crop history 6.2. Farm calendar 6.3. Farm records 7. Crops May include the following but not limited to: 7.1. Fruitcrop 7.1.1. Mangoes 7.1.2. Papayas 7.1.3. Pineapple 7.1.4. Banana 7.1.5. Citrus 7.2. Plantation crop 7.2.1. Coffee",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 49 7.2.2. Cacao 7.2.3. Abaca 7.2.4. Coconut 7.2.5. Sugarcane 7.3. Forage 7.4. Ornamentals 7.4.1. Rose 7.4.2. Sampaguita 7.4.3. Anthurium 7.4.4. Chrysanthemum 7.5. Cereals 7.5.1. Rice 7.5.2. Corn 7.6. Vegetables 7.6.1. Leafy 7.6.2. Fruit vegetable 7.6.3. Legumes 7.6.4. Bulbs 7.7. Medicinal plants 7.7.1. Sambong 7.7.2. Lagundi 7.7.3. Tsaang-gubat 7.7.4. Yierba-buena 7.7.5. Acapulko 7.7.6. Bayabas 7.7.7. Ampalaya 7.7.8. Pansit-pansitan 7.7.9. Niyog-niyugan 7.7.10. Bawang 7.8. Essential Oil plants 7.8.1. Ilang-ilang 7.8.2. Sampaguita 7.8.3. Citronella 7.8.4. Vanilla 7.9. Culinary Herbs 7.9.1. basil 7.9.2. lemon grass 7.9.3. mint 7.9.4. tarragon 7.9.5. parsley 7.10. Spices 7.10.1. black pepper 7.10.2. chili 7.10.3.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 50 8. Postharvest treatments May include the following: 8.1 Hot water treatment 8.2 Vapor heat treatment 8.3 Chemical treatment 8.4 Best practices in drying 8.5 Pre-cooling treatment 9. Characteristics affecting harvest Include the following: 9.1. Continued occurrence of physiological changes 9.2. High in water content 9.3. Susceptible to attack by pathogens and insects 10. Postharvest operation Include the following: 10.1. Washing 10.2. Cleaning 10.3. Sorting 10.4. Trimming 10.5. Chemical Treatment 10.6. Grading 10.7. Fermenting 10.8. Drying 10.9. Blanching 11. Postharvest equipment Include the following: 11.1. Hot water treatment machine 11.2. Sorter 11.3. Weighing scale 12. Damage Include the following: 12.1. Bruising 12.2. Wounding 12.3. Abrasion 13. Packaging Includes: 13.1. Crates (wooden, plastics and styro) 13.2. Paper wrap 13.3. Carton box 13.4. PEB (Polyethylene bags) 13.5. Styro 13.6. Sacks/bags 14. Storage and stacking 14.1. On-farm storage 14.2. Off-farm storage 15. References 15.1. Pictorial guide 15.2. Posters 15.3. Pamphlets 16. Storage pest and diseases 16.1. Insect pest 16.2. Rodents 16.3. Fungi 16.4. Bacteria",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 51 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1 Prepared field and materials/tools used for harvesting and postharvest 1.2 Identified and applied maturity indices when harvesting 1.3 Harvested and handled crops properly 1.4 Maintained quality of crops during distribution and storage applying consideration for optimum condition 1.5 Monitored storage pest and diseases 2. Required Knowledge and Attitudes 2.1 Safety Practices 2.1.1 Knowledge on HACCP principles 2.1.2 Knowledge on Good Manufacturing Practices 2.2 Mathematics and Measurement 2.2.1 Measurement of humidity and temperature 2.2.2 Measurement of area, volume, and weight 2.2.3 Simple mathematical computation 2.3 Tools & Equipment: Uses and Specification 2.3.1 Use of measuring devices 2.3.2 Operation of machines and equipment 2.4 Systems, Processes and Operations 2.4.1 Principles and practices in harvest and postharvest 2.4.1.1 Different storage pest and diseases 2.4.1.2 Different handling and packaging of produce 2.4.2 Identification of postharvest facilities, 2.5 Values 2.5.1 Effective team player 2.5.2 Smooth Interpersonal Relationship (SIR) 2.5.3 Observant of work ethics 3. Required Skills 3.1 Communicating ideas and info 3.2 Collecting information 3.3 Proper use and maintenance of tools and equipment 3.4 Monitoring skills 3.5 Maintain quality of stored commodities 3.6 Physical analysis of crop for quality standards 4. Resource Implications The following resources should be provided: 4.1 Facilities and equipment appropriate for harvest and postharvest of crops 4.2 Supplies and materials contingent to machines 4.3 Farm house 4.3.1 Packing area 4.3.2 Storage facilities 4.4 Farm tools/ implements/ equipment 4.5 Writing instruments 4.6 Farm supplies 4.7 Logbooks 4.8 References (catalogue, protocols, field guides, GAP, OHSS manuals)",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I\nPromulgated December 2013\n52 5. Method of Assessment\nCompetency in this unit may be assessed through:\n5.1 Direct observation and questioning\n5.2 Demonstration (simulated)\n5.3 Oral interview and written test\n5.4 Third party report\n6. Context of Assessment\n6.1 Competency may be assessed individually in the actual workplace or through TESDA accredited institution\n6.1.1 Private farms\n6.1.2 Farm school",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Agricultural Crops Production NC III",
        "core_competencies": [
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 29 - CORE COMPETENCIES\nUNIT OF COMPETENCY: PREPARE LAND FOR AGRICULTURAL CROP PRODUCTION\nUNIT CODE: AGR611310\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required to prepare equipment, cultivate the site, apply any pre-planting treatments, and care for the vehicles and equipment on completing the activity. Equipment and machinery may be animal-powered. It includes the completion of documentation and logbooks for the operation.\nPreparing land for crop production is likely to be carried out under limited supervision from others with checking only related to overall progress. Preparing land for crop production is usually done within established routines, methods and procedures. Some discretion and judgement is required in the selection of equipment and materials, organization of work and services.\nELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables\n1 Prepare for cultivation\n1.1 Requirements for the work to be undertaken are interpreted from the planting plan and confirmed with the manager.\n1.2 The method and order of cultivation is identified and interpreted from the planting plan.\n1.3 OHS hazards are identified, risks assessed and suitable controls are implemented.\n1.4 Suitable personal protective equipment is selected, used and maintained.\n1.5 The environmental implications of cultivating the site are identified, likely outcomes assessed and, if necessary, responsible action is taken.\n2 Prepare the cultivating equipment\n2.1 The vehicles and equipment required for site cultivation are selected according to the planting plan and organization guidelines.\n2.2 The vehicles and equipment are serviced, adjusted for the conditions and worn parts are replaced to ensure reliability during cultivation.\n2.3 All containers, leftover fluids, waste and debris from the maintenance and servicing work are disposed of safely and appropriately.\n2.4 All maintenance and servicing is documented according to the requirements of the organization’s record-keeping system.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 32
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 30 - ELEMENT PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range of Variables\n3 Cultivate soil\n3.1 Previous crop or land clearance debris is removed, incorporated or burnt according to the organization's guidelines.\n3.2 The cultivation plan is followed and completed for each site.\n3.3 OHS hazards are identified, risks assessed and suitable controls are implemented.\n3.4 Suitable personal protective equipment is selected, used and maintained.\n3.5 Vehicles and equipment are operated in a safe, effective and efficient manner and at speeds to suit the conditions.\n3.6 The quality of cultivation is maximized by continually checking and adjusting the vehicles and equipment as necessary.\n3.7 All time, resource and quality requirements of the planting plan are met.\n4 Prepare site for planting\n4.1 The planting layout and soil profiles are completed as required by the planting plan.\n4.2 Weed and pest control measures are taken as required by the planting plan.\n4.3 Fertilizers, ameliorants, and/or other pre-planting treatments are applied as required by the planting plan\n4.4 The environmental implications of site preparation are identified, likely outcomes assessed and, if necessary, responsible action is taken.\n5 Complete land preparation operations\n5.1 Equipment is cleaned in accordance with manufacturers' specifications, organizational procedures and regulations.\n5.2 Vehicles and equipment are cleaned and stored to minimize damage according to manufacturers' specifications, organizational procedures and regulations.\n5.3 All containers, leftover fluids, waste and debris from the cleaning and maintenance work are disposed of safely and appropriately.\n5.4 All required records and documentation are completed accurately and promptly according to organizational requirements.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 31 - RANGE OF VARIABLES\nVARIABLE RANGE\n1. Planting plan Any crop grown by the organization for production or pasture.\n1.1. Cereals\n1.2. Legumes\n1.3. Pulses\n1.4. Oilseeds\n1.5. pasture seeds\n1.6. cotton\n1.7. sugar cane.\n2. Occupational Health and Safety (OHS) The range of actions are both systemic and at an operational level. These are listed below:\n2.1 Systems should be in place to ensure the safe operation and maintenance of machinery and equipment. Precautions should also be in place to minimize exposure to noise and organic and other dusts, and to external elements, including solar radiation. Systems and procedures for preparing sites for planting, as well as working with and around electricity, should also be in place. Safe systems should be in place for stubble and grass burning, and for storing, handling and transporting hazardous substances.\n2.2 Fixtures should be in place in all storage sheds, including appropriate access ladders, handrails and ladder cages.\n2.3 Personal protective equipment should be selected, used and maintained.\n2.4 Environmental conditions should be controlled e.g., keeping moisture levels as low as possible will reduce the likelihood of fire.\n2.5 Procedures should be in place and used for working with moving vehicles and equipment.\n2.6 Record keeping should ensure that requirements in relation to properly observing and using product labels and MSDS sheets, instruction manuals and written organizational procedures.\n3. Personal protective equipment\n3.1 Boots\n3.2 hat/hard hat\n3.3 overalls, gloves\n3.4 protective eyewear\n3.5 hearing protection\n3.6 respirator or face mask\n3.7 sun protection (sun hat, sunscreen).\n4. Environmental implications\n4.1 Detrimental environmental impacts may result from excessive noise and exhaust emissions, the incorrect use and disposal of maintenance debris (oils, containers, chemical residues), dust, and hazardous substances (fuel). Impacts may also include run-off flows of water and cleaning agents from servicing, maintenance and cleaning activities.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 32 - VARIABLE RANGE\n5. Site conditions\n5.1 It might be the site of a previous year's crop or have been used for grazing or laid fallow for a period prior to cultivation. It may also be land cleared of virgin forest, low-lying land verging on mangroves, sloping high land, existing cleared land, and may have soil or surface water.\n6. Vehicles and equipment\n6.1 Vehicles might include tractors, trucks and four-wheel drive vehicles. Alternatively, animal power may be used to pull or tow equipment.\n6.2 Equipment might be mounted or trailing and may include ploughs, cultivators, scarifiers, fertilizer spreaders, spraying equipment, crop/stick puller, cultivators, buster, disc, lister, ripper, mulcher, tandem or offset discs, or rakes.\n7. Documented information\n7.1 Record-keeping systems used may be either paper-based or digital, and information will be recorded into logbooks or other records.\n8. Previous crop or land clearance debris\n8.1 The planting plan might require that such debris is removed (or sprayed), incorporated (smashing, cultivating, mulching, slashing), burnt or used for grazing for a period.\n9. Equipment is operated safely\n9.1 The speeds used should be appropriate for the equipment, ground and the crop conditions, and all pre- and post-start-up checks should be undertaken.\n10. Soil profile\n10.1 Where laser levelling is required, assistance may be required for contractors in surveying and pegging. Also, soil testing and analysis may be required.\n11. Weed and pest control measures\n11.1 Weeds may be controlled by using an integrated pest management program including the application of herbicides and biological control agents, grazing, slashing, burning, or hay cutting. Weeds may be controlled at various times, in the preceding year, pre-sowing, post-sowing, pre-emergent, at various stages of crop and weed growth, as recommended.\n11.2 Insect pests may be controlled by using an integrated pest management program including cultural means – cultivation, etc., insecticides, biological control agents, or removal of food supply using weed control techniques.\n12. Treatments\n12.1 Use of insecticides, fertilizers, and physical agents should meet legislative, manufacturers, and organization requirements.\n13. Environmental impacts\n13.1 Detrimental effects such as erosion, loss of moisture, debilitating germination rates, elimination of beneficial and indigenous microbes, and polluting water bodies.\n14. Documentation\n14.1 All chemical usage should be recorded as well as any necessary recording of site size, and vehicle and equipment use. Additionally, any assessment of pests and weeds, OHS hazards, or other observations should be recorded appropriately.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 33 - EVIDENCE GUIDE\n\n1. Critical Aspects of Competency\nAssessment requires evidences that the candidate:\n1.1 Prepared safely land for crop production to the requirements of the organization, and to the needs of the crop. The skills and knowledge required to prepare land for crop production must be transferable to a different work environment. For example, this could include different crop types, machinery and equipment, and farm procedures.\n\n2. Underpinning Knowledge and Attitudes\nKnowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts, and to deal with unplanned events. The knowledge requirements for this competency standard are listed below:\n2.1 methods of cultivating a range of soil types\n2.2 environmental issues of cultivating soil for planting, such as drainage and irrigation systems, soil amelioration and waste disposal procedures\n2.3 a range of pre-planting treatments, their purpose and method of application\n2.4 OHS guidelines, procedures, and principles including manual handling.\n\n3. Underpinning Skills\nTo achieve the performance criteria, appropriate literacy and numeracy levels as well as some complementary skills are required. These include the ability to:\n3.1 interpret production/planting plans, produce standards, quality specifications, work procedure documents\n3.2 implement cropping pattern\n3.3 measure materials and site plan specifications\n3.4 operate, adjust and calibrate cultivation equipment safely\n3.5 complete pre- and post-operational checks on tools, vehicles and equipment\n3.6 perform routine safety, service and maintenance procedures on tools, harvester and equipment\n3.7 read and interpret manufacturers specifications, work and maintenance plans, and Material Safety Data Sheets\n3.8 interpret and apply task instructions, communicate with work team and supervisor, and record and report faults, workplace hazards and accidents.\n\n4. Resource Implication\nThe following resources must be provided:\n4.1 workplace with vegetables or fruits that require regulating plant growth, crop yield and/or quality\n4.2 workplace information relating to crop regulation\n4.3 farm procedures relating to crop regulation\n\n5. Methods of Assessment\nCompetency should be assessed:\n5.1 through direct observation / demonstration\n5.2 portfolio assessment.\n\n6. Context of Assessment\n6.1 Assessment should be in a workplace or in a simulated workplace.\n6.2 Demonstration of competency over time and on a number of occasions.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 34 -\nUNIT OF COMPETENCY: IMPLEMENT POST-HARVEST PROGRAM\nUNIT CODE: AGR611311\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required for the process of implementing a post-harvest program for horticultural crops including grading, treating, packing and storing harvested produce. Implementing a post-harvest program is likely to be carried out under limited supervision from others with checking only related to overall progress. The work requires the application of extensive horticultural knowledge and a broad range of horticultural skills. The post-harvest program usually follows established routines, methods and procedures where some discretion and judgment is required.\nELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables\n1 Prepare for implementation of post-harvest operations\n1.1 Post-harvest operations to be performed are identified according to farm work procedures, the marketing plan and industry guidelines and confirmed with the supervisor.\n1.2 Materials, tools, equipment and machinery are selected according to farm work procedures.\n1.3 Pre-operational and safety checks are carried out on tools, equipment and machinery according to manufacturers specifications and farm work procedures.\n1.4 OHS hazards are identified, risks assessed, controls implemented and reported to the supervisor.\n1.5 Suitable safety and personal protective equipment (PPE) are selected, used and maintained.\n2 Coordinate post-harvest work\n2.1 Farm work team is identified and tasks are co-ordinated in a sequential, timely and effective manner in consultation with the supervisor.\n2.2 Post-harvest operations are undertaken according to OHS requirements and with due consideration of the environmental implications.\n2.3 A clean, safe and hygienic work area is maintained throughout and on completion of work.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 35 - ELEMENT PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range of Variables\n3 Implement post-harvest treatments\n3.1 Harvested produce is graded and labelled according to the marketing plan and farm work procedures.\n3.2 Produce that does not meet specifications and farm standards is identified and disposed of according to farm environmental procedures.\n3.3 Post-harvest treatments are selected according to harvested produce requirements, the farm integrated pest management strategy and the marketing plan.\n3.4 Timing, rate, application method, environmental requirements and handling techniques conform to the requirements of the harvested produce, farm work procedures and industry best practice.\n3.5 Post-harvest practices are economical, methodical, meet established work schedules and with minimum damage to produce.\n3.6 Tools, equipment and machinery are cleaned and maintained according to farm work procedures.\n4 Implement hazardous waste disposal guidelines\n4.1 Waste disposal requirements of the farm are reviewed and operational tasks determined.\n4.2 Collection and disposal of waste are monitored according to farm environmental procedures.\n4.3 Conditions likely to impact on business viability are reported promptly to the supervisor.\n5 Implement packaging requirements of produce\n5.1 Packaging requirements specified in the marketing plan and farm work procedures are reviewed and operational tasks determined.\n5.2 Packaging of produce conform to the requirements of the harvested produce, the marketing plan and industry best practice.\n5.3 Packaging materials are selected based on environmentally sound principles.\n5.4 Packaging processes are recorded according to farm work procedures.\n6 Implement storage requirements of produce\n6.1 Storage requirements specified in the marketing plan and farm work procedures are reviewed and operational tasks determined.\n6.2 Storage and handling of produce conform to the requirements of the harvested produce, the marketing plan and industry best practice.\n6.3 Storage processes and facilities are monitored and remedial action taken where necessary.\n6.4 Storage processes and conditions are recorded according to farm work procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 36 - RANGE OF VARIABLES\nVARIABLE RANGE\n1. Post-harvest operations\n1.1. Post-harvest operations may include handling and transport of harvested produce from the field to processing or storage facilities, grading, applying treatments, and packing, labeling and storing harvested produce, handling and transport from storage facility to market.\n2. Marketing plan\n2.1. The marketing plan will address client specifications that may include quality of plant produce (and various grades) such as variety, shape, size, weight, length, color, maturity, moisture content, ripeness, texture, skin condition, and blemishes which are subject to seasonal and market forces. Client preferences may also specify packaging materials, containers, filling techniques, labeling and storage requirements from field to client such as the cold chain concept.\n3. Farm work procedures\n3.1. Work procedures will be based on sound horticultural principles and practices and may include supervisors oral or written instructions, post-harvest program or production schedule, marketing plan, farm standard operating procedures (SOPs), specifications, routine maintenance schedules, work notes; industry best practice guidelines on quality, food safety and hygiene; product labels and Material Safety Data Sheets (MSDS), manufacturers service specifications and operators manuals, waste disposal, recycling and re-use guidelines, and OHS procedures.\n4. Materials, tools, equipment and machinery\n4.1. Materials may include preservatives, chemicals, gases, cleaning agents, packaging materials and containers, labels, adhesives and proformas.\n4.2. Tools, equipment and machinery may include tractors, trailers, light trucks, forklifts, snips, knives, gloves, containers, grading machinery, washers, brushes, dryers, chemical applicators, gassing chambers, labeling devices, packing tools, scales, pallets, hand trolleys and lifting aids, cold storage rooms and dedicated storage facilities. Machinery and equipment may be animal-powered, modified atmosphere equipments, sealing machine, reefer vans/trucks.\n5. OHS hazards\n5.1. Hazards may include a wet working environment including electricity, solar radiation, dust, pollen, soil-borne micro-organisms, noise, chemicals and hazardous substances, confined spaces, sharp hand tools and equipment, manual handling, slippery or uneven surfaces, and moving equipment, machinery and vehicles.\n6. Safety equipment\n6.1. Safety equipment may include signage and barriers, and operational safety exits from cold storage rooms and gassing chambers.\n7. Personal protective equipment\n7.1. PPE may include hat, boots, overalls, gloves, apron, waterproof clothing, spray clothing, goggles, respirator or face mask, face guard, self-contained breathing apparatus, hearing protection, sunscreen lotion and hard hat.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 37 - VARIABLE RANGE\n8. OHS requirements\n8.1. OHS requirements may include identifying hazards, assessing and reporting risks, cleaning, maintaining and storing tools, equipment and machinery; appropriate use of PPE, safe operation of tools, equipment and machinery, ensuring operational safety exits from cold storage rooms and gassing chambers, confined spaces policy and procedures, safe handling, use and storage of chemicals and hazardous substances, correct manual handling, basic first aid, personal hygiene and reporting problems to supervisors.\n9. Environmental implications\n9.1. Detrimental environmental impacts may arise where post-harvest activities produce excess noise, dust or water run-off, disposal of unwanted or waste plant material that produces odour and attracts pests, and risks infecting healthy crops, or on- and off-site ground water or soils that are contaminated from solids, debris, nutrients, chemicals and water run-off, use of CFCs for cooling and propellant and improper disposal of cleansing and toxic agents.\n10. Clean, safe and hygienic work area\n10.1. Tasks may include disabling unused tools, equipment and machinery and storing neatly out of the way of post-harvest activities, safely storing materials including chemicals on-site, using signage and safety barriers during and removing after post-harvest activities are completed, cleaning, fumigating or sterilising post-harvest equipment and storage facilities, and swiftly and efficiently removing and processing debris and waste from the work area.\n11. Farm environmental procedures\n11.1. Farm environmental procedures may include procedures for the disposal of out-of-standard produce, waste material such as chemicals and hazardous substances used in post-harvest treatments, their containers, plant debris, litter, processing and cleaning water run-off, and broken components and packaging.\n11.2. Waste may be removed to designated areas for recycling, reuse, return to the manufacturer or disposal.\n12. Post-harvest treatments\n12.1. Post-harvest treatments may include removal of dirt and foreign material, stripping excess leaves and/or trimming, brushing, washing/hydration, drying, applying preservatives, applying fungicides and insecticides by spraying or dipping, waxing and polishing, ripening or de-greening with ethylene gas, observing quarantine requirements and storing in a controlled environment.\n13. Minimize damage to produce\n13.1. Field handling practices may include observing the fill level of containers, lifting rather than dragging containers to avoid contact with dirt, correctly stacking containers on transport to reduce the risk of bruising, squashing or damaging the produce, and smoothly transporting the harvested produce to the post-harvest processing or storage facility.\n13.2. Harvested crops may need to be stored in the shade, in water-filled or covered containers in the field. In the shed storage may occur in a temperature-controlled environment such as a",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 38 - VARIABLE RANGE cold storage room. These may include forced air cold storage rooms for table grapes, hydro cold storage rooms for stone fruit and vacuum cold storage rooms for mushrooms. 13.3. Produce damage may be minimized by wearing gloves, maintaining sharp tools, placing rather than dropping produce into containers, cutting fingernails, observing fill heights, arrangement of produce and packing instructions for containers, and correctly stacking containers on transport. 14. Packaging requirements 14.1. Packaging requirements for specific produce and clients may include specifications for packaging materials and containers, filling techniques and arrangement of produce within the container, and for labeling. 15. Storage requirements 15.1. Storage requirements for specific produce and clients may include specifications for storage facilities, environmental conditions such as temperature, humidity and light, length of storage, position in the storage facility and cleaning processes to ensure a level of hygiene that protects the quality and health status of the stored produce.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 39 - EVIDENCE GUIDE\n\n1. Critical Aspects of Competency\nAssessment requires evidences that the candidate:\n1.1. Coordinated post-harvest operations\n1.2. implemented post-harvest treatments\n1.3. disposed hazardous wastes according to guidelines\nThe skills and knowledge required to implement a post-harvest program must be transferable to a different work environment. For example, this could include different crops, harvesting methods and farms.\n\n2. Underpinning Knowledge and Attitudes\nKnowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts, and to deal with unplanned events. The knowledge requirements for this competency standard are listed below:\n2.1. the attributes of produce in relation to the desired quality of produce to be presented to the client\n2.2. Integrated Pest Management principles and farm policy\n2.3. the importance of maintaining the quality of produce including handling and cooling requirements\n2.4. the relationship between the quality attributes of produce and packing techniques and packaging\n2.5. cool chain principles and practices\n2.6. characteristics and procedures for the use of cold storage rooms\n2.7. the correct storage temperatures for a range of produce\n2.8. humidity levels and their effect on the quality of produce\n2.9. hygiene issues in the handling and storage of plant produce\n2.10. environmental effects of post-harvest treatments and hazardous waste disposal methodologies, application and purpose\n2.11. farm confined spaces policy and safety procedures.\n\n3. Underpinning Skills\nTo achieve the performance criteria, appropriate literacy and numeracy levels as well as some complementary skills are required. These include the ability to:\n3.1. communicate orally and in writing with team members and supervisors\n3.2. interpret and confirm chemical labels, MSDS, work instructions and farm work procedures\n3.3. record information about work activities on proformas\n3.4. participate in teams and contribute to team objectives\n3.5. count and calculate quantities, treatment application rates and storage requirements\n3.6. correctly dispose of chemical substances, their containers and other waste materials to minimize environmental impact\n3.7. implement farm OHS policy and procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 40 - \n4. Resource Implication\nThe following resources must be provided:\n4.1. workplace with vegetables or fruits that require regulating plant growth, crop yield and/or quality\n4.2. workplace information relating to crop regulation\n4.3. farm procedures relating to crop regulation\n5. Methods of Assessment\nCompetency should be assessed:\n5.1. through direct observation / demonstration\n5.2. portfolio assessment\n6. Context of Assessment\n6.1. Assessment should be in a workplace or in a simulated workplace.\n6.2. Demonstration of competency over time and on a number of occasions.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 41 -\nUNIT OF COMPETENCY: IMPLEMENT PLANT NUTRITION PROGRAM\nUNIT CODE: AGR611312\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required to implement a plant nutrition program in the horticultural or agricultural industry. Implementing a plant nutrition program is likely to be under limited supervision from others, with checking only related to overall progress. The work is usually done within a program, routines, methods and procedures where some discretion and judgement is required in the selection of equipment and materials, organization of work, services, actions, and the achievement of outcomes within time and budgetary constraints. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables\n1 Prepare for implementation of the plant nutrition program\n1.1 Goals and target site for implementation of the plant nutrition program including soils, plant species and varieties are identified according to farm work procedures.\n1.2 Area and adjacent lands are analysed for soil composition/nutrients.\n1.3 Materials for soil and plant treatments available to the farm are identified and the storage site or supplier details located.\n1.4 Services are located using site plans and in consultation with the supervisor.\n1.5 OHS hazards are identified, risks assessed, controls implemented and reported to the supervisor.\n1.6 Suitable personal protective equipment (PPE) is selected, used and maintained.\n2 Monitor soil pH\n2.1 Soil pH in the implementation site is monitored in relation to plant nutrition and according to farm work procedures.\n2.2 Products useful in changing soil pH are identified, compared, selected and sourced according to farm work procedures.\n2.3 Product application methods are assessed according to product type, soils, farm work procedures, and in due consideration of the environmental implications.\n3 Determine nutritional problems in plants\n3.1 Common nutrient deficiency and toxicity problems in plants are identified using visual inspection.\n3.2 The supervisor and/or nutritional specialist are consulted, as required, to determine causes of nutritional or toxicity problems.\n3.3 Soil ameliorants to improve soil fertility are identified, compared, selected and sourced according to farm work procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 42 - ELEMENT PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range of Variables\n4 Prepare to use fertilizers\n4.1 The fertilizer to be used is selected according to fertilizer type, soils, farm work procedures, in consultation with the supervisor and/or nutritional specialist and in due consideration of the environmental implications.\n4.2 Fertilizer application methods are assessed according to fertilizer type, soils, farm work procedures, and in due consideration of the environmental implications.\n4.3 Fertilizers are applied according to the plant growing cycle and the farm fertilizer calendar.\n4.4 Fertilizers are handled and stored according to farm work procedures and to minimize detrimental environmental impact.\n5 Prepare application equipment\n5.1 Tools, equipment and machinery are selected according to farm work procedures.\n5.2 Pre-operational and safety checks are carried out on tools, equipment and machinery according to manufacturers specifications and farm work procedures.\n5.3 Tools, equipment and machinery are calibrated and adjusted according to manufacturer’s guidelines and farm work procedures.\n6 Apply specific products at appropriate rates\n6.1 Specific products are selected based on their analysis to meet plant needs according to farm work procedures.\n6.2 Product application rates are calculated to optimize plant benefit and minimize environmental impact according to manufacturer’s specifications and farm work procedures.\n6.3 Specific products are applied at the correct rate, timing and method according to the product type and analysis, manufacturers specifications, farm work procedures, and in due consideration of the environmental implications.\n6.4 Product applications are recorded according to farm work procedures.\n6.5 Target plant response to the plant nutrition program, as well as any non-target effects such as environmental impact or pest responses are monitored, documented and reported to the supervisor according to farm work procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 43 - RANGE OF VARIABLES\nVARIABLE RANGE\n1. Soils\n1.1. Soils may include field soil sites and specialist growing media.\n2. Farm work procedures\n2.1. Work procedures may include supervisors oral or written instructions, plant nutrition program, farm standard operating procedures (SOP), specifications, routine maintenance schedules, work notes; product labels and Material Safety Data Sheets (MSDS); manufacturers service specifications and operators manuals; waste disposal, recycling and re-use guidelines; and OHS procedures.\n3. Materials\n3.1. Materials may include those to modify soil pH, soil ameliorants to improve soil fertility, and fertilizers to meet the nutritional requirements of plants.\n4. Services\n4.1. Services may include water supply, gas, power (electricity), telecommunications, irrigation, and drainage.\n5. OHS hazards\n5.1. Hazards may include disturbance or interruption of services, solar radiation, dust, noise, soil-, air- and water-borne micro-organisms, chemicals and hazardous substances, sharp hand tools and equipment, manual handling, moving vehicles, machinery and machinery parts, flying objects and uneven surfaces.\n6. Personal protective equipment\n6.1. PPE may include hat, boots, overalls, gloves, goggles, respirator or face mask, face guard, spray clothing, hearing protection, sunscreen lotion and hard hat.\n7. Products useful in changing soil pH\n7.1. Products may include lime such as ground limestone, dolomite, and a range of fertilizers.\n8. Application methods\n8.1. Application methods may include banding, broadcasting, ripping, spraying and fertigation.\n9. Environmental implications\n9.1. Over-spraying or run-off into the external environment may result in nutrient overload or excess water to native plants, natural waterways, watertables and ecosystems, water erosion, water logging and salinisation.\n9.2. Responsible fertilisation and watering practices may, however, help to reverse previous environmental degradation by allowing natural recovery and regeneration of native ecosystems.\n10. Soil ameliorants\n10.1. Soil ameliorants may include cover crops, animal manures, gypsum and lime.\n11. Fertilizers\n11.1. Fertilizers may include solids, liquids or gases, which are artificial, organic, applied directly to the soil or to the plant via foliar sprays.\n12. Fertilizer application methods\n12.1. Fertilizer application methods may include banding, broadcasting, ripping, spraying and fertigation.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 44 - VARIABLE RANGE 13. Tools, equipment and machinery 13.1. Monitoring equipment may include a pH test kit, electronic pH testing device, hand held salinity or EC meter, tape measure, sample bags, plastic overlays, aerial photographs, charts and tables of soil characteristics and plant soil parameters, as well as charts and illustrations of the symptoms of plant nutrient deficiencies and toxicities. 13.2. Application equipment and machinery may include backpack spray equipment, tractors and trailed or 3 point linkage spreaders, seeders, rippers and spray equipment, pumps and pump fittings, and irrigation systems set up for fertigation.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 45 - EVIDENCE GUIDE\n\n1. Critical Aspects of Competency\nAssessment requires evidences that the candidate:\n1.1. Assessed the nutritional health of plants grown by the farm\n1.2. Accessed and applied appropriate products to plants and soils to meet the goals and objectives of the plant nutrition program. The skills and knowledge required to implement a plant nutrition program must be transferable to a different work environment. For example, this could include different plant species, nutrition programs and farm situations.\n\n2. Underpinning Knowledge and Attitudes\nKnowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts, and to deal with unplanned events. The knowledge requirements for this competency standard are listed below:\n2.1. the relationship between soil characteristics and the availability of nutrients, including macro and micro elements, to plants\n2.2. nutrient cycling and its practical relevance to the specific plants and soils used in the farm.\n2.3. methods of nutrient uptake by plants\n2.4. nutrients required by plants grown within the farm and the effects of nutrient deficiency and toxicity on individual plant species and varieties, including visual symptoms\n2.5. soil ameliorants commonly required to treat the soil problems experienced by the farm\n2.6. the main simple and compound fertilizer products available to the farm including analysis, solubility, salt index, application rates and costs\n2.7. the environmental implications for the external environment of soil ameliorant and fertilizer use, which may include over-spraying, run-off, nutrient overload, erosion, toxicity, noise and dust.\n\n3. Underpinning Skills\nTo achieve the performance criteria, appropriate literacy and numeracy levels as well as some complementary skills are required. These include the ability to:\n3.1. communicate with work team members, supervisors, contractors and suppliers, interpret manufacturers and plant nutrition program specifications, utilize proforma reporting, analysis and work procedure documents, and understand labels and symbols\n3.2. estimate treatment and product requirements, material sizes and quantities, interpret specifications, and calculate areas, ratios, proportions and application rates\n3.3. co-ordinate own activities with the requirements and schedules of the work group and contractors to sequentially and effectively implement the plant nutrition program in a timely and cost-effective manner",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 46 - \n4. Resource Implications\nThe following resources must be provided:\n4.1. workplace with commercial cropping or horticulture\n4.2. farm production plan\n4.3. workplace production data and records\n5. Methods of Assessment\nCompetency should be assessed:\n5.1. through direct observation / demonstration\n5.2. portfolio assessment\n6. Context of Assessment\n6.1. Assessment should be in a workplace or in a simulated workplace.\n6.2. Demonstration of competency over time.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 47 -\nUNIT OF COMPETENCY: CONTROL WEEDS\nUNIT CODE: AGR611313\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required to control weeds, taking into consideration Integrated Pest Management (IPM) options. Implementation is likely to be under limited supervision from others with checking only related to overall progress. Responsibility for and limited organization of the work of others may be involved. Implementation requires the application of knowledge in areas such as weed recognition, biology and control, and the lifecycles of weed predators and hosts.\nELEMENT PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range of Variables\n1. Assess weed infestation\n1.1 Scope, density and size of the infestation is assessed.\n1.2 Weeds and beneficial organisms are identified and reported or recorded in field notes.\n1.3 Levels of weed infestations tolerated by the client, market or environment are identified from the integrated pest management (IPM) strategy.\n1.4 Infestation levels, above which plant health or growth objectives are compromised are identified.\n1.5 Professional advice is obtained as required according to enterprise guidelines.\n2. Plan the implementation of control measures\n2.1 Control measures suitable for the infestation are selected from IPM strategy.\n2.2 Tools, equipment and implements are selected for each work activity according to enterprise work procedures.\n2.3 OHS hazards are identified, risks assessed, controls implemented and reported to the supervisor.\n2.4 Suitable safety equipment and personal protective equipment (PPE) are selected, used, maintained and stored.\n2.5 Control measures selected need to be in full consideration of environmental implications\n2.6 Control of harmful weeds with the use of cover crops\n3. Implement control measures\n3.1 Enterprise work team, contractors and IPM product suppliers are coordinated in a sequential, timely and effective manner in consultation with the supervisor.\n3.2 Control measures are implemented according to the IPM principles (e.g. water management for rice).\n3.3 Implementation of IPM activities is undertaken according to OHS requirements.\n3.4 A clean and safe work area is maintained throughout and on completion of each work activity.\n3.5 Land is prepared to ensure weed elimination.\n3.6 Records are maintained as required by legislation and enterprise guidelines.\n4. Monitor control methods\n4.1 Control methods are monitored to identify side effects to other plants, animals or external environment.\n4.2 Effectiveness of control methods are assessed in reference to specified industry and enterprise standards.\n4.3 Adjustments to IPM control methods are implemented where necessary to meet enterprise specifications.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 48 - RANGE OF VARIABLES\nVARIABLE RANGE\n1. Weeds\n1.1. These may include weeds which present a potential risk for the enterprise, industry or environment.\n2. Beneficial organisms\n2.1. These may include volunteer or cultivated plants that out-compete the weed, insects and other non-vertebrates, and microorganisms that attack the weed.\n3. Control measures\n3.1. These may include targeted chemical application, the application of non-chemical controls including organically or naturally ingredient-based sprays, controlled release of predatory organisms, or the application of cultural control methods including removal and disposal of weeds.\n4. Tools, equipment and implements\n4.1. Standard horticultural tools such as gardening implements, mechanised and manually operated spray applicators and cultivators, tractors and trailed equipment may be required. Monitoring equipment for the implementation of an IPM program may include insect traps, soil, fertilizer and plant tissue test kits and sampling equipment.\n5. OHS hazards\n5.1. Hazards may include chemicals and hazardous substances, manual handling, operating machinery tools and equipment, noise, dust, solar radiation, falls and tripping.\n6. Personal protective equipment\n6.1. PPE may include hat, boots, overalls, gloves, goggles, respirator or face mask, hearing protection, sunscreen lotion.\n7. Environmental implications\n7.1. Beneficial environmental impacts may occur where reduced and informed targeting of chemicals, fertilizers and water to the site and recycling within the system, result in minimal escape of contaminants to the external environment. Beneficial impacts may also result from improved production, healthier ecosystems, more efficient water and nutrient utilization and reduced weed numbers.\n7.2. Detrimental environmental impacts may arise where IPM activities produce excess noise, dust or water, or the systems do not function effectively because of inadequate implementation techniques.\n8. IPM principles\n8.1. Standards may include those established by registered industry associations, clients or markets of the enterprise, land management agencies or quality assurance program.\n9. OHS requirements\n9.1. OHS requirements may include identifying hazards, assessing risks and implementing controls, cleaning, maintaining and storing tools, equipment and machinery, appropriate use, maintenance and storage of PPE including sun protection, safe operation of tools, equipment and machinery, safe handling, use and storage of chemicals, organically based materials and hazardous substances, correct manual handling, basic first aid, safety procedures for protection of others, personal hygiene, and reporting problems to supervisors.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 49 - VARIABLE RANGE 10. Clean and safe work area 10.1. Tasks may include disabling unused tools, equipment and machinery and storing neatly out of the way of IPM activities, correct storage of personal protective equipment, safely storing materials on site, and swiftly and efficiently removing and processing debris and waste from the work area. 11. Records 11.1. Records may include types of weeds and beneficial organisms present, numbers of weeds and beneficials present, treatments applied, date of application, application rates, success of treatments, economic thresholds.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 50 - EVIDENCE GUIDE\n\n1. Critical Aspects of Competency\nAssessment requires evidences that the candidate:\n1.1. planned, implemented and monitored weed control successfully according to enterprise guidelines and industry best practice. The skills and knowledge required to control weeds must be transferable to a different work environment. For example, this could include different weed species, enterprise situations and control methods.\n\n2. Underpinning Knowledge and Attitudes\nKnowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts and to deal with unplanned events. The knowledge requirements for this competency standard are listed below.\n2.1. Weed recognition and IPM concepts\n2.2. Economic, aesthetic or environmental thresholds for a range of weeds\n2.3. Chemical, biological and cultural control methods and treatments available to the enterprise within the parameters of an IPM program\n2.4. Range and use of tools, equipment and machinery available to the enterprise for implementing the control measures\n2.5. Range of site monitoring and analysis techniques that may be used to implement an IPM program\n2.6. Association of IPM methods with site limitations, environmental implications, end market and horticultural objectives for the site\n2.7. OHS issues and legislative requirements associated with hazardous substances, regulations and Codes of Practice\n2.8. OHS responsibilities of employers and employees\n2.9. Correct wearing/fit of personal protective equipment\n\n3. Underpinning Skills\nTo achieve the performance criteria, appropriate literacy and numeracy levels as well as some complementary skills are required. These include the ability to:\n3.1. recognize of a range of weeds and beneficial organisms within a particular enterprise\n3.2. communicate with work team members, supervisors, contractors and consultants\n3.3. utilize proforma reporting, analysis and work procedure documents\n3.4. understand IPM symbols and information\n3.5. interpret and apply IPM program spatial and logistical specifications\n3.6. correct fitting, cleaning and storage of personal protective equipment\n3.7. interpret and apply test results and calculate the quantities and applications rates of control materials",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 51 - \n3.8. coordinate work group, contractors and own activities to sequentially and effectively complete IPM activities in a timely and cost-effective manner \n4. Resource Implications \nThe following resources must be provided: \n4.1. workplace with a range of weeds \n4.2. tools, equipment and materials for controlling weeds \n4.3. enterprise procedures, work plans relevant to weed control \n5. Methods of Assessment \nCompetency should be assessed: \n5.1. through direct observation / demonstration \n5.2. portfolio assessment \n6. Context of Assessment \n6.1. Assessment should be in a workplace or in a simulated workplace \n6.2. Demonstration of competency over time and on a number of occasions",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 52 -\nUNIT OF COMPETENCY: PREPARE AND APPLY CHEMICALS\nUNIT CODE: AGR611314\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required to prepare and apply chemicals for the control of weeds, pests and diseases. It requires knowledge of the chemicals related to the workplace, the hazards and risks involved in their use, and the specific safety procedures prescribed for working unsupervised within organizational guidelines. It requires the ability to handle and apply chemicals ensuring minimum risk to self, others and environment and accurately record their use.\nELEMENT PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range of Variables\n1. Determine the need for chemical use\n1.1 Nature and level of the pest, weed infestation or disease is identified.\n1.2 Need for action is assessed as per established procedures.\n1.3 Requirement for chemical use as an option within an integrated pest management strategy is assessed.\n1.4 Hazard and risk analysis of different chemical options is undertaken.\n1.5 Requirement for chemical application including coverage by appropriate insurance is identified and confirmed.\n2. Prepare appropriate chemical\n2.1 Chemical label and Material Safety Data Sheets (MSDS) are read and understood.\n2.2 Labels are checked to ensure chemicals meet user requirements and specifications.\n2.3 Chemicals are prepared from those registered for the intended purpose, and to suit the organization’s chemical use strategy.\n2.4 Legislation and regulations concerning chemical use are identified and followed.\n2.5 Occupational Health and Safety (OHS) hazards and risks and risk control requirements associated with use of the chemical are identified.\n3. Prepare to use chemicals according to the label and MSDS\n3.1 Personal protective equipment is selected and checked for use according to the product label and MSDS.\n3.2 Requirements for pre and post-operative checks on equipment are followed.\n3.3 Damage, wear or malfunctions of any equipment is identified and reported or repaired.\n3.4 Requirements for the selection, preparation and adjustment of application equipment and tools for the appropriate chemicals are followed.\n3.5 Mixing rates are defined and calculated.\n3.6 Directions, standards and legislative requirements for mixing chemicals are followed.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 53 - ELEMENT PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range of Variables\n4. Apply chemicals\n4.1 Meteorological conditions and forecasts are assessed prior to and during application.\n4.2 Hazards of particular chemicals are identified.\n4.3 Risks to others and the environment are assessed and controlled.\n4.4 Application equipment calibration procedures are followed.\n4.5 Procedures and precautions for the use of the chemicals are interpreted from labels and accreditation requirements.\n4.6 Requirements for chemical handling and application are determined from directions, standards and legislative requirements.\n4.7 Chemicals are applied safely and effectively according to directions.\n4.8 Chemical spills or accident procedures are followed.\n4.9 First aid equipment is made available on site.\n5. Clean up following chemical application\n5.1 Tools or equipment required to clean up chemicals are selected.\n5.2 Requirements for cleaning equipment and sites are defined and followed according to directions and standards.\n5.3 Requirements for disposing of unused chemicals, empty containers or spilled material are defined from directions and standards.\n5.4 Procedures for reporting chemical spills are followed.\n6. Record application details\n6.1 Application of chemicals is recorded according to organization procedures, label directions and legislation.\n6.2 Details of the specific chemical concerned are recorded correctly in the chemical inventory according to regulations.\n6.3 Inventory of personal protective equipment and application equipment is recorded.\n6.4 Procedures and requirements for reporting application details to senior management or client are followed.\n6.5 Records of injury or poisoning associated with application of chemical are made and provided to the appropriate person.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 54 - RANGE OF VARIABLES\nVARIABLE RANGE\n1. Chemicals\n1.1. Chemicals may include insecticides, fungicides, herbicides, bactericides, algaecides, bio-agents, nematacides, rodenticides, antimicrobial agents, anthelmintics, hormone growth promotants or a range of veterinary chemicals used to treat animals for disease.\n2. Legislation and regulations\n2.1. Legislation may include Pesticides Acts, Occupational Health and Safety Acts and associated Hazardous Substances Regulations/Codes of Practice, Dangerous Goods Acts, Poisons Act or Protection of the Environment Acts.\n3. OHS hazards and risks\n3.1. OHS hazards include exposure of the operators and others in the workplace to the absorption of chemicals through the skin and by inhalation and ingestion. Risks may include acute poisoning, chronic or long-term health effects, and lack of appropriate insurance coverage.\n4. OHS risk control requirements\n4.1. OHS risk control measures may include safe application techniques, use and maintenance of personal protective equipment, safe wash down procedures, safe procedures for container rinsing and management.\n5. Personal protective equipment\n5.1. Personal protective equipment may include boots, chemical resistant gloves, aprons, face shields, respirators or hats and protective clothing.\n6. Pre- and post-operational checks\n6.1. Checks may be made to weather conditions (e.g., wind), nozzles, hoses, regulators/gauges, respirator cartridges, drench and protective clothing and equipment.\n7. Application equipment\n7.1. Include knapsacks or hand held pneumatic sprayers, drench guns, spot on applicators, CDA and air assisted units, self-propelled sprayers, controllers or power operated equipment like boomsprays, pressure wands, jetting race, shower/plunge dips, hand jetting or air blast sprayer.\n8. Directions and standards\n8.1. May include the instructions on the chemicals label, in an operator’s manual, on a MSDS, in an industry standard, or from Codes of Practice and advisory material explaining legislation relevant to chemical use.\n9. Hazards\n9.1. Hazards will be listed on labels and the MSDS for the chemical concerned and may include flammability, toxicity, health hazards, damage to non-target organisms, uneven surfaces, trip points, solar radiation, manual handling, faulty equipment, environmental damage or residues in foods.\n10. Risks\n10.1. Risks that may be assessed include spillage, contact of chemical with skin or eyes, accidental ingestion, incorrect concentrations in mixtures, faulty or inappropriate storage containers, incorrectly calibrated equipment, spray drift, contamination of waterways, incorrect disposal of unused chemicals or faulty equipment\n11. Meteorological conditions\n11.1. Rain, wind, temperature, relative humidity, inversion or stable air conditions.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 55 - VARIABLE RANGE \n12. Tools and equipment \n12.1. Include washing soda, chlorine, containers for disposal of chemicals, non-flammable absorbent materials and shovels, booms, sausages and sandbags. \n13. Organizational procedures \n13.1. Written journal or computer record may be used for recording. \n14. Appropriate person \n14.1. Include relevant authorities, supervisor, manager, business owner or colleague.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 56 - EVIDENCE GUIDE\n1. Critical Aspects of Competency\nAssessment requires evidences that the candidate:\n1.1. Prepared the correct chemical for the problem unsupervised\n1.2. Applied the chemical according to safe work practice and legislation and ensure minimal effects on the environment and others\nThe skills and knowledge required to prepare and apply chemicals must be transferable to a different work environment. For example, this could include different chemicals, application methods and workplaces.\n2. Underpinning Knowledge and Attitudes\nKnowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts and to deal with unplanned events. The knowledge requirements for this competency standard are listed below.\n2.1. Chemical free options for pest control.\n2.2. Use, maintenance and storage of equipment to prepare and apply chemicals.\n2.3. OHS issues, legislative requirements and Codes of Practice relevant to chemical use and hazardous substances.\n2.4. Use, maintenance and storage of personal protective equipment, including how, when and why it should be used.\n2.5. Licensing requirements (e.g licensed Pesticide Applicator, licensed Fumigator) and relevant government authorities.\n2.6. Modes of chemical absorption and paths of entry associated with risks to bystanders/public and applicators.\n2.7. Environmental effects of chemicals.\n2.8. Drift management.\n2.9. Calibration and adjustments.\n2.10. Integrated Pest Management and Integrated Resistance Management principles.\n2.11. Cost effective use of chemicals.\n2.12. Hazard identification, assessment and control, and emergency response.\n2.13. Correct wearing/fit of personal protective equipment.\n2.14. Read and follow the label instructions.\n3. Underpinning Skills\nTo achieve the performance criteria, appropriate literacy and numeracy levels as well as some complementary skills are required. These include the ability to:\n3.1. communicate orally and in writing.\n3.2. read and interpret labels.\n3.3. measure quantities, application rates and calibrate equipment.\n3.4. report on and record activities.\n3.5. use safe and environmentally responsible work practices.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 57 - \n4. Resource Implications\nThe following resources must be provided:\n4.1. workplace\n4.2. workplace equipment and storage facilities for chemical mixing and application\n4.3. enterprise procedures relating to chemical use.\n5. Methods of Assessment\nCompetency should be assessed:\n5.1. through direct observation / demonstration\n5.2. portfolio assessment\n6. Context of Assessment\n6.1. Assessment should be in a workplace or in a simulated workplace.\n6.2. Demonstration of competency over time and on a number of occasions.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 58 -\nUNIT OF COMPETENCY: ESTABLISH AGRONOMIC CROPS\nUNIT CODE: AGR611320\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required for establishing agronomic crops. It includes preparing machinery and equipment, ploughing/cultivating, seeding, applying any pre-planting treatments, maintaining machinery and equipment, relevant record keeping, and it requires the application of skills and knowledge to use specialised equipment to carry out seeding and fertilizer operations appropriate to soil and weather conditions. Equipment and machinery may be animal-powered. In addition, it requires an awareness of licensing requirements, safe workplace and positive environmental practices associated with seeding operations including sustainable land management. The work functions in this standard involve the application of some judgement and discretion and are likely to be carried out under minimal supervision within farm guidelines. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables\n1. Prepare machinery and equipment for use\n1.1 Machinery and equipment is selected and confirmed against the work plan and prepared to manufacturers specifications.\n1.2 Equipment is securely attached and calibrated for operation to manufacturers specifications.\n1.3 Existing and potential OHS hazards in the workplace are identified, risks assessed and controlled in line with farm requirements.\n2. Prepare for agronomic crop establishment\n2.1 Soil and weather conditions are monitored for optimal seeding conditions.\n2.2 Soil conservation and sustainable land management practices and procedures are recognized and confirmed in accordance with farm requirements and environmental concerns.\n2.3 Seeding, fertilizer, and pest and weed control requirements are confirmed against the work plan and prepared to manufacturers specifications using safe handling procedures.\n2.4 Contingency plans are prepared for unusual seasonal conditions and pest/disease outbreaks.\n3. Sow the crop\n3.1 Suitable personal protective clothing and equipment is selected, used and maintained in accordance with OHS requirements.\n3.2 Seeding and fertilizer applications are carried out in line with the work plan.\n3.3 Pest and weed control treatment is coordinated with seeding and fertilizer applications as required.\n3.4 Environmental implications associated with sowing operations are identified, assessed and controlled in line with farm requirements.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 61
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 59 - ELEMENT PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range of Variables\n4. Complete seeding operations\n4.1 Seeding, machinery and equipment operation records are maintained in accordance with farm requirements.\n4.2 Machinery and equipment damage, malfunctions or irregular performance are reported in line with farm requirements.\n4.3 Machinery and equipment is cleaned, secured and stored in line with manufacturer’s specifications and farm requirements.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 62
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 60 - RANGE OF VARIABLES\nVARIABLE RANGE\n1. Machinery and equipment\n1.1. Tractors, seed drills, air seeders, plough, harrows, cultivators, scarifiers, trucks, augers and bins. Equipment and machinery may be animal-powered.\n1.2. Manual sowing is likely to be used in a number of situations and there would be basic equipment associated with this method of crop establishment.\n2. Work plan\n2.1. Location, crop type (cereals, legumes, cotton,) and seeding method, soil condition (structure, moisture), seeding practices (sowing time, sowing rate, optimal depth of sowing, seed dressing, tilth to match seed size), fertilizer type and application, pest and weed control type and application, machinery, equipment, resources and materials requirements, supervisors instructions, timeframe for work completion, crop layout and crop design and reporting requirements.\n3. Preparation of machinery and equipment\n3.1. Preparation may include safe transporting, inspection, pre-start and safety checks, routine servicing and maintenance, calibration, checking and monitoring machinery settings.\n4. OHS\nSystems and procedures for:\n4.1. the safe operation and maintenance of machinery and equipment including hydraulics and guarding of exposed moving parts.\n4.2. identify hazards, assessing and reporting risks.\n4.3. emergency operating procedures.\n4.4. safe lifting, carrying and handling techniques.\n4.5. manual handling systems and procedures, handling and storage of hazardous substances and grain, and the appropriate use of personal protective clothing and equipment.\n4.6. Safe systems and procedures for outdoor work including protection from solar radiation, protection of people in the workplace, protection from hazardous noise, mechanical vibration, organic and other dusts, and protection from fire risk.\n5. OHS hazards\n5.1. Exposure to loud noise and fumes, solar radiation, dust, ergonomic hazards associated with posture and vibration, hazardous substances, the presence of bystanders, slippery or uneven terrain, potholes, stumps, ditches, gullies, embankments, obstacles (rocks, logs, fences, debris), adverse weather conditions, mechanical malfunctions and exposed moving parts, and other machinery including hydraulics.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 63
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 61 - VARIABLE RANGE\n6. Farm requirements\n6.1. Standard operating procedures (SOPs), industry standards, production schedules, Material Safety Data Sheets (MSDS), work notes, product labels, manufacturers specifications, operators manuals, farm policies and procedures (including waste disposal, recycling and re-use guidelines), OHS procedures, supervisors oral or written instructions, and work plans.\n7. Agronomic crops\n7.1. Agronomic crops covered by this unit include coarse grains, grain legumes, coffee, coconuts, cotton, soya beans, peanuts and sugar cane.\n8. Optimal seeding conditions\n8.1. This may be based on the history of seasonal weather providing a reasonable risk for dry seeding, and soil moisture conditions appropriate for grains crop germination.\n9. Personal protective clothing and equipment\n9.1. Boots, hat/hard hat, overalls, gloves, protective eyewear, hearing protection, respirator or face mask, and sun protection (sun hat, sunscreen).\n10. Environmental implications\n10.1. Positive environmental impacts may result from the conduct of sustainable land use practices including stubble retention, minimum tillage, and contour sowing to reduce erosion risks. It may also include the use of non-chemical alternatives for pesticides and cleaning agents, effective water re-use systems, and the reduction of noise and exhaust emissions.\n10.2. Negative environmental impacts may result from high activity vehicle traffic and over-cultivation practices causing erosion, increased water run-off speeds, soil compaction, soil disturbance and loss, soil degradation, dust, contamination of soil and water through the use of fertilizer and chemicals, spray drift, incorrect use and disposal of chemicals and residues, oils and containers, greases, and detergents used in cleaning and maintenance procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 64
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 62 - EVIDENCE GUIDE\n\n1. Critical Aspects of Competency Assessment requires evidences that the candidate:\n1.1. selected and utilized various features and controls of a range of specialised application equipment to seed and fertilise a grains crop\n1.2. prepared and serviced machinery and equipment\n1.3. assessed soil and weather conditions and determined appropriate seeding methods\n1.4. prepared seeds for planting, seed to plan ensuring optimum range of depth and density\n1.5. recognized and controlled hazards\n1.6. evaluated seeding operations and maintain records.\n\nThe skills and knowledge required to establish agronomic crops must be transferable to a different work environment. For example this may include different crops, planting techniques, machinery and farms.\n\n2. Underpinning Knowledge and Attitudes\nKnowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts, and to deal with unplanned events. The knowledge requirements for this competency standard are listed below:\n2.1. crop types, preparation of seeds, seeding methods and application techniques\n2.2. fertilizer types, rates of application and crop nutrient requirements\n2.3. types of herbicides, insecticides and other pesticides, and alternative pest control methods (non-chemical)\n2.4. effects of weather conditions (normal and adverse) on seeding and fertilising applications\n2.5. operating principles and operating methods for machinery and equipment\n2.6. principles of weight distribution with regard to load shifting and vehicle movement\n2.7. sustainable land management and soil conservation techniques\n2.8. positive environmental practices, negative environmental impacts and minimisation measures associated with seeding operations\n2.9. relevant provincial/municipal legislation, regulations and codes of practice with regard to workplace OHS and the use and control of hazardous substances\n2.10. relevant provincial/municipal legislation and regulations with regard to licensing requirements and the use and control of machinery and equipment\n2.11. personal protective clothing and equipment and when and how it should be used\n2.12. procedures for cleaning, securing and storing machinery, equipment and materials",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 65
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 63 - 2.13. farm policies with regard to seeding operations, and recording and reporting routines.\n3. Underpinning Skills\nTo achieve the performance criteria, some complementary skills are required. These include the ability to:\n3.1. apply fertilizer, herbicides, insecticides, other pesticides and hazardous substances safely\n3.2. identify types of weeds and insects harmful to crops\n3.3. identify beneficial insects\n3.4. perform pre-operational and safety checks, servicing and maintenance on machinery and equipment\n3.5. calibrate, operate machinery and attach/detach equipment\n3.6. demonstrate emergency operating procedures in normal and adverse conditions\n3.7. recognize and report machinery damage, faults or malfunctions and perform minor repairs\n3.8. demonstrate safe, environmentally responsible and sustainable land management practices\n3.9. monitor and minimize impacts to the environment associated with sowing operations\n3.10. read and interpret manufacturers specifications, work and maintenance plans, and MSDS\n3.11. clean, secure and store machinery and equipment\n3.12. interpret and apply task instructions, communicate with work team and supervisor, and record and report equipment faults, workplace hazards and accidents\n3.13. assess and calculate the application of fertilizer/pesticide requirements and application rates, calibrate equipment and calculate volumes, consumption and servicing requirements.\n4. Resource Implications\nThe following resources must be provided:\n4.1. workplace where agronomic crops are to be established\n4.2. workplace information relating to crop establishment\n4.3. farm procedures relating to crop establishment\n5. Methods of Assessment\nCompetency should be assessed:\n5.1. through direct observation / demonstration\n5.2. portfolio assessment\n6. Context of Assessment\n6.1. Assessment should be in a workplace or a simulated workplace.\n6.2. Demonstration of competency over time and on a number of occasions.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 66
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 64 -\nUNIT OF COMPETENCY: UNDERTAKE AGRONOMIC CROP MAINTENANCE ACTIVITIES\nUNIT CODE: AGR611321\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required for maintaining agronomic crops. It involves the process of assessing crop condition to identify abnormalities caused by pests, weeds, soil nutrient deficiencies and soil conditions, applying pests, disease and plant disorders and weed control measures to maximize crop production and providing crop fertilizer requirements. Monitoring agronomic crops is likely to be carried out under limited supervision from others with checking only related to overall progress. It is usually done within established routines, methods and procedures where some discretion and judgment is required in the selection of equipment and materials, organization of work, services, actions and the achievement of outcomes within time and budgetary constraints. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Assess agronomic crop condition, growth and requirements 1.1 Crops are monitored to assess their needs and observations are recorded and reported. 1.2 Pest and disease control alternatives are identified in line with species and level of infestation present and taking into account consultant advice if obtained. 1.3 Economic threshold data is identified in line with action targets. 1.4 Sites for regular measurement of soil moisture are established in consultation with survey advice. 1.5 Soil probe is used to measure moisture levels and soil water percentage calculated. 1.6 Water requirements are calculated in line with standing crop and forecast weather conditions. 2. Apply fertilizer and amendments 2.1 OHS hazards are identified, risks assessed and suitable controls are implemented. 2.2 Suitable personal protective equipment is selected, used and maintained. 2.3 Specialist sprays are selected and applied to organization standard and taking into account consultant advice if obtained. 2.4 Specialist sprays are applied according to industry standards for growth stages. 2.5 Chipping or spot spraying is carried out as an integral part of weed control programs. 2.6 Crop growth stages and keys are assessed, recorded and reported. 2.7 Water is applied according to the identified need and the requirements of the organization. 2.8 All applications are undertaken in the full consideration of adverse environmental impacts.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 67
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 65 - ELEMENT PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range of Variables\n3. Monitor crop condition, growth and requirements\n3.1 Crop maturity is monitored and the need for further applications is determined in consultation with the manager.\n3.2 The health of the crop is continually monitored and corrections to growing plan are made as and when required.\n3.3 The timing of harvest is determined in consultation with contractors and property manager.\n4 Complete cleaning and hygiene operations\n4.1 Equipment is cleaned in accordance with manufacturers specifications, organizational procedures and regulations.\n4.2 All containers, leftover fluids, waste and debris from the maintenance and servicing work are disposed of safely and appropriately.\n4.3 All required records and documentation are completed accurately and promptly in accordance with organizational requirements.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 68
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 66 - RANGE OF VARIABLES\nVARIABLE RANGE\n1. Agronomic crops\n1.1. Agronomic crops covered by this unit include coarse grains, grain legumes, coffee, coconuts, cotton, soya beans, peanuts and sugar cane.\n2. Recorded\n2.1. All chemical usage should be recorded as well as any necessary recording of vehicle and equipment use in logbooks. Additionally, any assessment of pests and weeds, protein levels, quality and yield should be recorded appropriately. Record keeping systems used may be either paper-based or digital, and information will be recorded into logbooks or other records.\n3. Alternatives\n3.1. Alternatives to such chemical methods may include altering management methods, considering the way that water is supplied to the crop, and using mechanical methods.\n4. Fertilizers\n4.1. Fertilizers and other amendments used will be dependent on nutrient levels, trace elements, acidity, alkalinity, texture and other physical characteristics of the soil, and the growth stage of the crop.\n5. OHS\nThe range of actions are both systemic and at an operational level. These are listed below.\n5.1. Systems should be in place to ensure the safe operation and maintenance of machinery and equipment. Precautions should also be in place to minimize exposure to noise and organic and other dusts. Systems and procedures for harvesting and handling crops, as well as working with and around electricity, should also be in place. Health and safety representatives and OHS committees in the larger agronomic organizations will contribute to the maintenance of safe conditions.\n5.2. Fixtures should be in place in all silos and storage sheds, including appropriate access ladders, handrails and ladder cages.\n5.3. Personal protective equipment should be selected, used and maintained.\n5.4. Environmental conditions should be controlled e.g., keeping moisture levels as low as possible will reduce the likelihood of fire.\n5.5. Procedures should be in place and used for working on harvesters, working within confined spaces, moving vehicles, and working at height. Special information, induction or training related to the activities contained within this unit.\n5.6. Record keeping should ensure those requirements in relation to properly observing and using product labels and MSDS sheets, instruction manuals and written organizational procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 69
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 67 -\nVARIABLE RANGE \n6. Personal protective equipment \n6.1. Boots, hat/hard hat, overalls, gloves, protective eyewear, hearing protection, respirator or facemask, and sun protection (sun hat, sun screen). \n7. Specialist sprays \n7.1. The specialist sprays may include fertilizers, soil ameliorants, defoliants and insecticides. \n8. Sprays applied to the crop \n8.1. Chemicals used for invertebrate, disease and weed control will depend on the growth stage of the crop. \n9. Needs of crops to be monitored \n9.1. They will be monitored using an evaporation pan, rain gauge or other methods. \n10. Environmental implications \n10.1. Detrimental environmental impacts may result from excessive noise and exhaust emissions, the incorrect use and disposal of maintenance debris (oils, containers, chemical residues), and hazardous substances (fuel). Impacts may also include run-off flows of water and cleaning agents from servicing, maintenance and cleaning activities. \n11. Equipment \n11.1. 2WD, 4WD and crawlers, appropriate mechanical loader e.g., front-end loader, hydraulic crane, block and tackle, sprayer equipment, fertilizer applicator or spreader, chipping hoe, cultivation equipment, and irrigation equipment.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 70
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 68 - EVIDENCE GUIDE\n\n1. Critical Aspects of Competency\nAssessment requires evidences that the candidate:\n1.1. applied fertilisers and other chemicals in a sound manner at the right time in the growth cycle for the crop in order that undesirable results and run-off do not occur. The skills and knowledge required to maintain agronomic crops must be transferable to a different work environment for example, over the entire growth cycle of the crop.\n\n2. Underpinning Knowledge and Attitudes\nKnowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts, and to deal with unplanned events. The knowledge requirements for this competency standard are listed below:\n2.1. appropriate legislative requirements, manufacturers instructions and organization procedures/instructions\n2.2. potential hazards associated with the operation of basic tools and equipment\n2.3. general machine maintenance procedures\n2.4. machinery operating principles and operating methods\n2.5. recognition of healthy crop condition\n2.6. recognition of any potential pests\n2.7. environmental impacts associated with the operation of machinery and equipment in a harvesting context\n2.8. knowledge in basic agronomy and horticulture\n2.9. knowledge in basic plant pathology\n2.10. organization recording and reporting procedures\n2.11. organization moisture and hygiene requirements for agronomic crops and equipment that comes into contact with the crop\n2.12. types and uses of herbicides, insecticides and other pesticides and alternative pest control methods (non-chemical).\n\n3. Underpinning Skills\nTo achieve the performance criteria, appropriate literacy and numeracy levels as well as some complementary skills are required. These include the ability to:\n3.1. detect differences and variations in crop health\n3.2. to report/communicate such differences to the supervisor/farm owner\n3.3. observe and report on health and growth of the crop\n3.4. read and interpret manufacturers specifications, work and maintenance plans, and Material Safety Data Sheets.\n\n4. Resource Implications\nThe following resources must be provided:\n4.1. workplace with agronomic crop maintenance\n4.2. workplace information relating to crop maintenance\n4.3. enterprise procedures relating to crop maintenance\n\n5. Methods of Assessment\nCompetency should be assessed:\n5.1. through direct observation / demonstration\n5.2. portfolio assessment\n\n6. Context of Assessment\n6.1. Assessment should be in a workplace or in a simulated workplace.\n6.2. Demonstration of competency over time and on a number of occasions.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 71
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 69 -\nUNIT OF COMPETENCY: UNDERTAKE AGRONOMIC CROP HARVESTING ACTIVITIES\nUNIT CODE: AGR611322\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required for the process of harvesting agronomic crops. It includes preparing machinery and equipment, supplies and materials needed, harvesting, cleaning and maintaining machinery and equipment and completing workplace records. Harvesting may also be carried out using manually or animal-powered tools and equipment. Harvesting is likely to be carried out under limited supervision. Overall progress may be checked periodically and will usually follow set routines, methods and procedures.\nELEMENT PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range of Variables\n1. Prepare to harvest agronomic crops\n1.1 Requirements for the work to be undertaken, method and order of harvesting is interpreted from the harvest strategy and confirmed with the supervisor.\n1.2 OHS hazards are identified, risks assessed and suitable controls are implemented.\n1.3 Suitable personal protective equipment is selected, used and maintained.\n1.4 The environmental implications of harvesting the crop are identified, likely outcomes assessed and, if necessary, responsible action is taken.\n1.5 Windrowing/swathing is completed to the standard required by the harvest strategy.\n1.6 Crop is sampled for moisture content against the classification standards.\n1.7 The hygiene standards for the crop and the site are identified from the harvest strategy and/or the crop storage plan.\n2. Prepare the harvesting equipment\n2.1 Harvesting machinery and other equipment are cleaned of pests and other contaminants to maintain crop and site hygiene standards, as required by the harvest strategy.\n2.2 All machinery and equipment are serviced, assessed for reliability, adjusted for harvesting conditions and appropriate parts are replaced to ensure reliability during the harvest.\n2.3 All containers, leftover fluids, waste and debris from the maintenance and servicing work are disposed of safely and appropriately.\n2.4 All maintenance and servicing is documented according to the requirements of the organization's record-keeping system.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 72
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 70 - ELEMENT PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range of Variables\n3. Harvest crops\n3.1 The harvest strategy is followed and completed for each site.\n3.2 OHS hazards are identified, risks assessed and suitable controls are implemented.\n3.3 Suitable personal protective equipment is selected, used and maintained.\n3.4 The environmental implications of harvesting are identified, likely outcomes assessed and, if necessary, responsible action is taken.\n3.5 Harvesting machinery and ancillary equipment is operated in a safe manner and at speeds to suit crop conditions.\n3.6 The quality of the crop is maximized by maintaining the hygiene of all surfaces that come into contact with the crop.\n3.7 The quality of the crop is maximized by continually checking and, where necessary, adjusting the harvester and ancillary equipment, including their height and other settings.\n4. Complete harvesting operations\n4.1 Equipment is cleaned in accordance with manufacturer’s specifications, organizational procedures and regulations.\n4.2 Attachments and other ancillary equipment are cleaned and stored to minimize damage and to maximize hygiene according to manufacturer’s specifications, organizational procedures and regulations.\n4.3 Insecticides are applied as required by the organization and the harvest strategy.\n4.4 All containers, leftover fluids, waste and debris from the maintenance and servicing work are disposed of safely and appropriately.\n4.5 All required records and documentation are completed accurately and promptly in accordance with organizational requirements.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 73
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 71 - RANGE OF VARIABLES\nVARIABLE RANGE\n1. Agronomic crops\n1.1. Agronomic crops covered by this unit include coarse grains, grain legumes, coffee, coconuts, cotton, soya beans, peanuts and sugar cane.\n2. OHS\nThe range of actions are both systemic and at an operational level. These are listed below.\n2.1. Systems should be in place to ensure the safe operation and maintenance of machinery and equipment. Precautions should also be in place to minimize exposure to noise and organic and other dusts. Systems and procedures for harvesting and handling the crop, as well as working with and around electricity should also be in place.\n2.2. Fixtures should be in place in all silos and storage sheds, including appropriate access ladders, handrails and ladder cages.\n2.3. Personal protective equipment should be selected, used and maintained.\n2.4. Environmental conditions should be controlled e.g., keeping moisture levels as low as possible will reduce the likelihood of fire.\n2.5. Procedures should be in place and used for working on harvesters, working with grain mass movement and stability, working within confined working spaces, moving vehicles, and working at height.\n2.6. Record keeping practices should ensure that requirements are met in relation to properly observing and using product labels and MSDS sheets, instruction manuals and written organizational procedures.\n3. Personal protective equipment\n3.1. Boots, hat/hard hat, overalls, gloves, protective eyewear, hearing protection, respirator or facemask, and sun protection (sun hat, sun screen).\n4. Environmental implications\n4.1. Detrimental environmental impacts may result from excessive noise and exhaust emissions, the incorrect use and disposal of maintenance debris (oils, containers, chemical residues), and hazardous substances (fuel). Impacts may also include run-off flows of water and cleaning agents from servicing, maintenance and cleaning activities.\n5. Classification standards\n5.1. These are the standards for the measurement of moisture in the crop and are produced and available from receival authorities.\n6. Equipment\n6.1. A range of equipment from grain augers and field and chaser bins to towing vehicles, tarpaulins, fire control equipment, conveyors, communication equipment, and crop treatment equipment.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 74
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 72 - VARIABLE RANGE \n7. Cleaned in preparation for and subsequent to the harvest \n7.1. All surfaces of harvesters, and any equipment that comes into contact with the crop should be cleaned, using one of the following methods: compressed air, water wash, vacuum and water, and/or brush. \n8. Documented information \n8.1. Record keeping systems used may be either paper-based or digital, and information will be recorded into logbooks or other records. \n9. Operated safely equipment \n9.1. The speeds used should be appropriate for the equipment, ground and the crop conditions. All pre- and post-startup checks should be undertaken. The machine is positioned and adjusted during use according to the height of the crop and according to weather conditions. \n10. Fire prevention measures \n10.1. These will be outlined in the harvest strategy. The measures planned for and taken will address fire risks and hazards and will meet legislative requirements. \n11. Actions required for documentation \n11.1. All chemical usage should be recorded as well as any necessary recording of vehicle and equipment use in logbooks, for example. Additionally, any assessment of pests and weeds, grain protein levels, quality and yield should be recorded appropriately.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 75
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 73 - EVIDENCE GUIDE\n\n1. Critical Aspects of Competency Assessment requires evidences that the candidate:\n1.1. harvested crops safely and efficiently while continually maintaining the highest degree of hygiene and quality possible. The skills and knowledge required to harvest the grain crop must be transferable to a different work environment. For example, the way in which the harvesting operations will occur will vary depending on the moisture levels of the crop, the crop type, and the equipment available.\n\n2. Underpinning Knowledge\nKnowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts, and to deal with unplanned events. The knowledge requirements for this competency standard are listed below:\n2.1. appropriate legislative requirements, manufacturers instructions and organization procedures/instructions\n2.2. pre-operational and safety checks, servicing and maintenance procedures for tools and equipment\n2.3. potential hazards associated with the operation of basic tools and equipment\n2.4. general machine maintenance procedures\n2.5. machinery operating principles and operating methods\n2.6. environmental impacts associated with the operation of machinery and equipment in a harvesting context\n2.7. organization recording and reporting procedures\n2.8. pests and signs of pest infestation in the crop\n2.9. organization moisture and hygiene requirements for the crop and equipment that comes into contact with the crop\n2.10. operational procedures and standards for harvesting and ancillary equipment.\n2.11. knowledge of crop maturity\n2.12. knowledge of post-harvest handling and packaging.\n\n3. Underpinning Skills\nTo achieve the performance criteria, appropriate literacy and numeracy levels as well as some complementary skills are required. These include the ability to:\n3.1. use communication systems\n3.2. handle and manoeuvre harvesting equipment\n3.3. complete pre- and post-operational checks on tools, harvester and equipment\n3.4. perform routine safety, service and maintenance procedures on tools, harvester and equipment\n3.5. read and interpret manufacturers specifications, work and maintenance plans, and Material Safety Data Sheets\n3.6. interpret and apply task instructions, communicate with work team and supervisor, and record and report faults, workplace hazards and accidents.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 76
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 74 - \n4. Resource Implications\nThe following resources must be provided:\n4.1. workplace with agronomic crops coming into harvest time\n4.2. workplace information relating to crop harvesting\n4.3. enterprise procedures relating to crop harvesting\n5. Methods of Assessment\nCompetency should be assessed:\n5.1. through direct observation / demonstration\n5.2. portfolio assessment\n6. Context of Assessment\n6.1. Assessment should be in a workplace or in a simulated workplace.\n6.2. Demonstration of competency over time and on a number of occasions.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 77
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 75 -\nUNIT OF COMPETENCY: SAVE, PREPARE AND STORE AGRICULTURAL SEED\nUNIT CODE: AGR611323\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required for selecting grain and other seed from agricultural crops for use as seed, to calculate the quantity required, to grade and test it, and subsequently to store the seed for use in the following season. Seed stocks are selected and stored to ensure maximum quality and yield when used.\nELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables\n1 Select seed from agricultural crops\n1.1 The quantity of seed required to sow the following season’s crop is calculated.\n1.2 The area of crop needed to produce the required quantity of seed for the following season’s crop is calculated.\n1.3 A portion of the crop to be used as seed is selected, based on the calculated requirements and its health, vigour, and grain size.\n1.4 The soil type and elevation/climatic conditions in the selected portion of the crop are noted for potential input to management decision-making.\n1.5 Measures are taken to preserve seed and plant health, vigour and uniformity within the selected area.\n1.6 The application of any chemicals to the crop is undertaken in full consideration of detrimental environmental impacts.\n1.7 All work carried out is done using the appropriate personal protective equipment and is within OHS guidelines.\n2 Evaluate and grade seed\n2.1 After harvest, the grain variety saved is assessed for its suitability for the location, the soil, and the organization’s current marketing requirements.\n2.2 Information regarding new varieties or trial results and progress is sourced for input to management decision-making.\n2.3 The seed is graded to the required size either on or off-site.\n2.4 Fungicidal and insecticidal dressings are applied to the seed where appropriate and according to the organization's production and marketing requirements.\n2.5 Test samples are taken, prepared and forwarded to the analyzing body, according to the guidelines of that body.\n2.6 Records of observations, information gathered, and results of tests and grading are kept, updated, and maintained according to the requirements of the organization and the industry.\n2.7 The records kept are forwarded to the appropriate person for analysis and decision-making.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 78
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 76 - ELEMENT PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range of Variables\n3 Store seed\n3.1 The storage facilities to be used are selected and hygienically prepared.\n3.2 Seed is transferred to the storage facility according to the organization's OHS and hygiene guidelines.\n3.3 Seed is stored under conditions that maintain its quality and germination capacity.\n3.4 Periodical checks of seed in long-term storage are conducted for quality factors and viability according to enterprise requirements.\n3.5 Seed samples for laboratory testing are taken as required.\n3.6 Test samples are taken, prepared and forwarded for analysis according to prescribed guidelines.\n3.7 Clear and accurate records of seed storage, tests and inspections are created, maintained and kept as described in the seed storage program.\n3.8 The condition of storage facilities is monitored using the schedule and methods outlined in the seed storage program.\n3.9 Where it is required, appropriate corrective action is taken to maintain seed quality.\n3.10 Activities around the seed storage facilities are undertaken according to the OHS guidelines detailed in the grain storage program.\n4 Collect and deliver seed\n4.1 Delivery or supply terms are established and applied when collecting or delivering seed.\n4.2 Seed sold or purchased conforms to local State and Federal legislation and regulations.\n4.3 Regulations relating to the interstate movement of seeds are observed.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 79
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 77 - RANGE OF VARIABLES\nVARIABLE RANGE\n1. Seeds\n1.1. They may be from both horticultural and agronomic crops.\n2. Agricultural crops\n2.1. Agricultural crops covered by this unit include both horticultural and agronomic crops.\n2.2. Agronomic crops covered by this unit include coarse grains, grain legumes, coffee, coconuts, cotton, soya beans, peanuts and sugar cane.\n2.3. Crops may include fruit, vegetables, herbs, flowers, foliage, bulbs, tubers, nuts, mushrooms, wild harvest plants and oils.\n3. Measures may be taken to improve seed\n3.1. Measures taken can include removing pests and weeds, as well as enhancing the nutrients of the area. Specifically, this may include roguing of off-types and undesirable weeds, grading out weed seeds and small grains and other impurities, enhancing the nutrient levels with pre-harvest applications, and careful harvesting to prevent cracked and damaged grain.\n4. Detrimental environmental impacts\n4.1. Persistent application of chemicals to a particular area of soil over time can lead to a change in the soil performance, and any inappropriate disposal of containers or chemicals can contaminate soils, crops and water.\n5. Personal protective equipment\n5.1. Boots, hat/hard hat, overalls, gloves, protective eyewear, hearing protection, respirator or face mask, and sun protection (sun hat, sunscreen).\n6. OHS\n6.1. They include safe systems and procedures for storage, handling and transportation of hazardous substances, chemicals selected taking into account toxicity levels and environmental effects, systems and procedures for the safe operation and maintenance of machinery and equipment, including hydraulics and guarding of exposed moving parts, safe manual handling systems and procedures, safe systems and procedures for outdoor work, including protection from solar radiation, selection, use and maintenance of relevant personal protective clothing and equipment, and fire risk.\n7. Current marketing\n7.1. They can be found in the plan itself, and through discussion with management.\n8. Information regarding new varieties or trial results\n8.1. This information would generally be sourced informally through discussion with operators in other techno-demo farms & research institutes, seed companies and organizations or through media outlets. Information may also be sourced through recommendations or directly through suppliers.\n9. Seed to be tested\n9.1. It might be tested for purity, germination, vigour, seed weight, and disease identification.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 80
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 78 - VARIABLE RANGE\n10. Records\n10.1. Information from each season will be useful in building a history for the organization, and for input into subsequent years decision-making. Record keeping is essential. Records of each step along the way should be kept: results of calculations, location of the area used for seed growing, varieties used, soil types used for growing seed, seed improvement methods used, water availability and time of harvest.\n10.2. Once harvested, records need to be kept of type, condition, and length of time in storage. Also of where it is to be sown, and the origin of the seed.\n11. Appropriate person for analysis and decision-making\n11.1. This is the person who will make decisions on the production and operations planning for sowing.\n12. Seed history\n12.1. Yields of parent crop, trueness to type, age, storage treatments, source and type of parent crop and pathogens in parent crop.\n13. Seed quality\n13.1. Test weights per thousand grains or similar assessment, even sized grain, and nutrient enhanced grain.\n14. Seed storage controls\n14.1. Moisture and humidity, temperature, pesticide concentrations, and gas tightness.\n15. Seed selection, storage, purchase and treatment procedures\n15.1. Maintain high germination rate, minimize disease transmission on farm and between farms, and ensure pest-free status of certified seed and should be free from impurities.\n16. Conditions that maintain a high germination percentage\n16.1. Low moisture levels, appropriate temperatures, and freedom from pests.\n17. Seed saved has the following known features\n17.1. Trueness to type, pest status, and insect-free determine seed to be saved.\n18. OHS guidelines\n18.1. They might be to alert others in the organization, including workers and family members, of planned presence of transport, putting in place systems and procedures for\n18.2. the safe operation and maintenance of machinery and equipment, including hydraulics and guarding of exposed moving parts\n18.3. the protection from organic and other dusts\n18.4. the safe systems and procedures for handling and storage of grain and seed\n18.5. the protection against electrical hazards, especially overhead power lines\n18.6. storage, handling and transportation of hazardous substances (pesticides)\n18.7. the selection, use and maintenance of relevant personal protective clothing and equipment\n18.8. lifting and carrying.\n18.9. Safe systems and procedures should also be in place for working in confined spaces, at height and on the grain mass.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 81
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 79 - EVIDENCE GUIDE\n\n1. Critical Aspects of Competency\nAssessment requires evidences that the candidate:\n1.1. saved, prepared, grown and stored seed in a hygienic environment to ensure a successful crop the following year\nThe skills and knowledge required to save, prepare and store seed must be transferable to a different work environment. For example, across the range of grains grown, and in a range of different geographic environments.\n\n2. Underpinning Knowledge and Attitudes\nKnowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts, and to deal with unplanned events. The knowledge requirements for this competency standard are listed below:\n2.1. identification of varieties\n2.2. seed treatment and cleaning measures\n2.3. sources of purchased seed\n2.4. inoculation treatments and seed dressings used within the organization\n2.5. records and documentation required for tracking and handling of seed\n2.6. storage techniques and requirements for seed and grain\n2.7. environmental controls and codes of practice applicable to the enterprise\n2.8. relevant legislation and regulations relating to OHS, contractor engagement, chemical use and application, vehicle and plant use, and to the use, handling and sale of seed\n2.9. sound management practices and processes to minimize noise, odours, and debris from sowing operations.\n\n3. Underpinning Skills\nTo achieve the performance criteria, appropriate literacy and numeracy levels as well as some complementary skills are required. These include the ability to:\n3.1. select appropriate seed tests\n3.2. apply pre and post-harvest treatments for seed\n3.3. identify varieties from growth patterns\n3.4. identify weed seeds and contaminants\n3.5. identify pests in stored grain and initiate control measures\n3.6. calculate volumes, capacities, areas, ratios for seed, storages, and chemicals\n3.7. keep, update and maintain records relating to test results, provenance, varieties, pest control measures, and other relevant information about the seed\n3.8. observe, identify and react appropriately to environmental implications and OHS hazards.\n\n4. Resource Implications\nThe following resources must be provided:\n4.1. workplace with saves, prepares and stores grain.\n4.2. workplace information relating to grain storage\n4.3. enterprise procedures relating to grain storage\n\n5. Methods of Assessment\nCompetency should be assessed:\n5.1. through direct observation / demonstration\n5.2. portfolio assessment\n\n6. Context of Assessment\n6.1. Assessment should be in a workplace or in a simulated workplace.\n6.2. Demonstration of competency over time and on a number of occasions at least three (3) different types of crops.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 82
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 80 -\nUNIT OF COMPETENCY: IMPLEMENT VERTEBRATE PEST CONTROL PROGRAM\nUNIT CODE: AGR611324\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required to plan and implement a strategy for the control of vertebrate pests in a rural environment. It requires the application of knowledge and skills to assess the severity of pest infestation and determine methods and applications for the effective control of vertebrate pests without harm to other species or the environment. Competency requires an awareness of legislative requirements with regard to animal welfare, biosecurity, safety and environmental protection. The work in this standard is likely to be carried out under routine supervision within farm guidelines.\nELEMENT PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range of Variables\n1. Assess requirements for pest control\n1.1 Vertebrate pest control requirements are assessed and clarified according to farm objectives.\n1.2 Inspections are carried out to ascertain type and severity of pest infestations.\n1.3 Control agents and methods of application to prevent, control or manage vertebrate pests are determined.\n1.4 Control program is developed for implementation according to farm requirements.\n2. Prepare to implement control program\n2.1 Suitable personal protective equipment is selected, used and maintained according to OHS requirements.\n2.2 Equipment and materials required to support the implementation of control program are arranged.\n2.3 Relevant licenses and permits are obtained according to legislative requirements.\n2.4 Safe working practices are observed and followed according to OHS and farm requirements.\n3. Control vertebrate pests\n3.1 Control program is implemented according to OHS, legislative and farm requirements.\n3.2 Safeguards are employed to ensure that targeted pests are controlled and all other species remain unharmed.\n3.3 Integrated health management is considered and implemented as required.\n3.4 Environmental impacts are assessed and controlled according to legislative and farm requirements.\n4. Complete control program\n4.1 Carcasses and control agents are disposed of according to environmental and industry Codes of Practice.\n4.2 Control program and outcomes are reviewed and evaluated for future best practice and planning management.\n4.3 Equipment and work areas are cleaned and returned to operating order according to OHS and farm requirements.\n4.4 Relevant information is documented and maintained to industry standards and farm requirements.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 83
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 81 - RANGE OF VARIABLES\nVARIABLE RANGE\n1. Vertebrate pests\n1.1. Vertebrate pests are those animal species listed in specific regions by governments or municipalities as pest animals and may include animal species such as wild birds, rats and mice, feral cats, feral pigs, foxes. Vertebrate pests to be controlled may also be identified in biosecurity codes of practice.\n2. Control agents\n2.1. Agents may include herbicides, fungicides, insecticides, mechanical means including shooting, trapping or electric devices, vaccines, antibiotics, medicines, poisons, baits, vector release, biologically active agents and growth regulators.\n3. Application methods\n3.1. Methods may include by air or ground, by injection, drench, spray or fumigation.\n3.2. It may also include integrated pest management which includes one or more methods in combination:\n3.3. cultivation or mechanical means\n3.4. biological control\n3.5. species selection\n3.6. chemical application.\n4. Control program\n4.1. Information may include the identity of vertebrate pest and severity of infestation, allocated equipment and materials, type of control agent to be used and method of application, timeframe for completion, health and safety measures, procedures for the disposal of carcasses and other waste, and reporting requirements.\n5. Farm requirements\n5.1. SOP, industry standards, farm quality manual, product labels, manufacturers specifications, MSDS, operators manuals, farm policies and procedures (including waste disposal, recycling and re-use) and reporting requirements.\n6. Personal protective equipment\n6.1. This may include boots, hat/hard hat, overalls, gloves, protective eyewear, hearing protection, respirator or face mask, and sun protection.\n7. OHS\nSafe systems and procedures for:\n7.1. safe manual handling\n7.2. outdoor work including protection from solar radiation\n7.3. the handling and storage of firearms\n7.4. the handling of explosives\n7.5. the handling of hazardous substances including vaccines, poisons and baits\n7.6. the use of personal protective equipment.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 84
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 82 - VARIABLE RANGE 8. Legislative requirements\nThis may include relevant Philippine Acts and provincial/municipal regulations with regard to:\n8.1. pest control\n8.2. use, control and storage of chemicals\n8.3. atmospheric contamination\n8.4. labeling of hazardous substances\n8.5. MSDS information guidance\n8.6. transportation of dangerous goods.\n9. Safe working practices\n9.1. This may include identifying hazards, mixing and applying chemicals, appropriate signage, manual handling and the use of personal protective equipment.\n10. Integrated health management\n10.1. Considerations may include hygiene, husbandry, quarantine, chemical and biological controls.\n11. Environmental impacts\n11.1. Negative environmental impacts may result from the unsafe use and disposal of chemicals and any consequent residual chemicals.\n12. Relevant information\n12.1. This may include details of control agents used and methods of application, location and severity of infestation, carcass numbers and disposal procedures, implementation problems and solutions, any incidents, and evaluated outcomes in terms of meeting farm objectives.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 85
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crops Production NC III\nPromulgated April 2006 - 83 - EVIDENCE GUIDE\n\n1. Critical Aspects of Competency\nAssessment requires evidences that the candidate:\n1.1. Used control agents safely and applied appropriate methods to control vertebrate pests\n1.2. used and handled hazardous substances safely\n1.3. carried out inspections to assess infestations, identify species and nature of vertebrate pest\n1.4. determined control methods with due care and humane treatment\n1.5. disposed carcasses according to established industry standards.\nThe skills and knowledge required must be transferable to another environment. For example, this could include different pests, control treatments, farms and workplaces.\n\n2. Underpinning Knowledge\nKnowledge and understanding are essential to apply this standard in the workplace, to transfer the skills to other contexts and to deal with unplanned events. The knowledge requirements for this competency standard are listed below:\n2.1. legislative and industry requirements for the disposal of vertebrate pests and control agents\n2.2. types of vertebrate pests\n2.3. control methods and techniques\n2.4. safety signage\n2.5. sustainable livestock management\n2.6. relevant environmental guidelines including protection of native vegetation with particular attention to potential soil degradation and destruction of flora and fauna\n2.7. relevant provisions of OHS legislation and regulations.\n\n3. Underpinning Skills\nTo achieve the performance criteria, appropriate literacy and numeracy levels as well as some complementary skills are required. These include the ability to:\n3.1. use a first aid kit\n3.2. select and use agricultural chemicals safely\n3.3. communicate effectively in verbal and written form with farm personnel and suppliers\n3.4. read and interpret chemical labels, MSDS and safety signage or decals\n3.5. calculate vertebrate pest numbers and estimate resources and materials appropriate to implement control program.\n\n4. Resource Implications\nThe following resources must be provided:\n4.1. workplace with vertebrate pest problem\n4.2. tools, equipment and materials used controlling vertebrate pests\n4.3. farm procedures relating to vertebrate pest control including the use of chemicals\n\n5. Methods of Assessment\nCompetency should be assessed:\n5.1. through direct observation / demonstration\n5.2. portfolio assessment\n\n6. Context of Assessment\n6.1. Assessment should be in a workplace or in a simulated workplace.\n6.2. Demonstration of competency over time",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC III.pdf",
                    "page": 86
                },
                "type": "Document"
            }
        ]
    }
]