[
    {
        "name": "Agricultural Crops Production NC II",
        "core_competencies": [
            {
                "page_content": "TR - Agricultural Crop Production NCI I\nPromulgated December 2013\n35 CORE COMPETENCY\nUNIT OF COMPETENCY: PERFORM NURSERY OPERATIONS\nUNIT CODE: AFF 610 301\nUNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to perform nursery operations for agricultural crops including establishing nursery shed, preparation and handling of planting materials, preparation of growing media, transplanting germinated seedlings and handling of nursery tools and equipment.\nELEMENTS PERFORMANCE CRITERIA\nItalicized terms are elaborated in the Range Statement\n1. Prepare nursery tools, farm implements and simple equipment\n1.1 Tools, farm implements and simple equipment are prepared according work requirements.\n1.2 Basic pre-operative checking of tools, farm implements and equipment is performed in accordance with manufacturer’s manual and GAP standard.\n1.3 Tools with wear and corrosions are segregated and treated according to maintenance plan and procedures.\n2. Maintain nursery facilities\n2.1 Nursery sanitation is maintained according to GAP standard.\n2.2 Repair and maintenance of nursery facilities are performed to maximize their efficiency and effectiveness.\n2.3 Preventive measures are applied for inclement weather.\n2.4 Safety measures are practice according to OSHS.\n3. Handle seeds/planting material\n3.1 Planting materials are determined according to kinds and varieties.\n3.2 Quality seeds are selected according to prescribed characteristics.\n3.3 Seed testing is conducted to determine the percentage germination of the seedstock in accordance with the standard procedures\n3.4 Planting materials are treated following standard protocol.\n3.5 Seed scarification is performed for germination purposes based on type of crop.\n4. Prepare growing media\n4.1 Growing media are prepared according to prescribed mixture and crop requirement.\n4.2 Growing media are placed in prescribed containers according to crop requirements.\n4.3 Containers are arranged and labelled according to varieties/species.\n4.4 Seedbed is prepared based on crop species.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 36 ELEMENTS PERFORMANCE CRITERIA Italicized terms are elaborated in the Range Statement 5. Conduct propagation activities 5.1 Nursery shed is set-up according to plant requirement 5.2 Quality seedlings are selected based on prescribed characteristics. 5.3 Propagation materials are selected according to propagation activity. 5.4 Plant propagation techniques are performed based on recommended practices. 5.5 Germinated seedlings are maintained until fully established. 5.6 Pricking and thinning of seedlings are performed based on recommended practices. RANGE OF VARIABLES VARIABLE SCOPE 1. Tools, farm implements and simple equipment Include the following but not limited to: 1.1. Tools: 1.1.1. Digging tools 1.1.2. Propagation tools 1.1.3. Harvesting tools 1.1.4. Measuring tools 1.2. Farm implements and simple equipment: 1.2.1. Water pumps 1.2.2. Hand tractor 1.2.3. Plow 1.2.4. Harrow 1.2.5. Sprayer 2. Planting materials Include the following but not limited to: 2.1. Seeds 2.2. Suckers 2.3. Tissue cultured plantlets 2.4. Cuttings 2.5. Rhizome 2.6. Corm 2.7. Grafted material 2.8. Tuber 2.9. Runner/Stolon 2.10. Bulb 3. Quality seeds Characteristics of quality seeds include the following: 3.1. Damage free 3.2. Viability 3.3. Free from mixture",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 37 4. Seed Testing Seed testing methods include the following but not limited to: 4.1. Rag doll method 4.2. Petri dish 4.3. Seed bed/seedbox 5. Seed scarification Seed scarification include the following: 5.1. Physical 5.2. Chemical 6. Growing media Include but not limited to the following: 6.1. Garden soil 6.2. Peat moss 6.3. Sawdust 6.4. Coco coir 6.5. Rice hull/carbonized rice hull 6.6. Compost 6.7. River sand 6.8. Animal manure 6.9. Wood cuttings 6.10. Fern slabs 6.11. Driftwood 7. Containers Include but not limited to the following: 7.1. Polyethylene bags 7.2. Clay pots 7.3. Plastic containers 7.4. Seed tray 7.5. Seed box 7.6. Coconut husk 7.7. Wired basket 8. Quality seedlings Include but not limited to the following: 8.1. Healthy 8.2. Vigorous growth 8.3. Height 8.4. Age 8.5. Number of leaves 9. Plant propagation techniques Include but not limited to the following: 9.1. Sexual (Seeds) 9.2. Asexual 9.2.1 Grafting (cleft, side, saddle) 9.2.2 Budding 9.2.3 Marcotting/air layering 9.2.4 Inarching/approached grafting 9.2.5 Cuttings 9.2.6 Division",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 38 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1. Selected planting materials. 2. Conducted seed testing 3. Prepared growing medium. 4. Performed plant propagation techniques 2. Required Knowledge and Attitudes 2.1 Safety Practices 2.1.1 Knowledge on HACCP principles 2.1.2 Knowledge on Good Agricultural Practices (GAP) 2.1.3 Knowledge on Occupational Safety and Health Standards (OSHS) 2.2 Mathematics and Measurement 2.2.1 Measurement of humidity and temperature 2.2.2 Measurement of area, volume, and weight 2.2.3 Measurement of fertilizer and pesticides 2.3 Tools & Equipment: Uses and Specification 2.3.1 Use of measuring devices 2.3.2 Use of tools and equipment 2.4 Systems, Processes and Operations 2.4.1 Preparation of calendar of activities 2.4.2 Irrigation methods 2.4.3 Different seed/planting materials 2.4.4 Different growing media 2.4.5 Preparation and mixing of growing media 2.4.6 Transplanting procedure 2.4.7 Propagation techniques 2.4.8 5S and 3Rs 2.5 Pest control procedures 2.5.1 Pest monitoring 2.5.2 Pesticide application methods 2.6 Values 2.6.1 Effective team player 2.6.2 Smooth Interpersonal Relationship (SIR) 2.6.3 Observant of work ethics 3. Required Skills 3.1 Basic mathematical processes of addition, subtraction, division and multiplication 3.2 Skills in plant propagation techniques 3.3 Interpretation of procedural manuals 4. Resource Implications The following resources should be provided: 4.1 Shed/Greenhouse 4.2 Writing instruments 4.3 Nursery tools/implements/equipment 4.4 Nursery supplies 4.5 Logbooks 4.6 Irrigation system and parts",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 39 4.7 References (NSIC catalogue, GAP, OSHS, HACCP manuals, etc.) 5. Methods of Assessment Competency in this unit may be assessed through: 5.1. Direct Observation and questioning 5.2. Demonstration 5.3. Oral interview and written test 5.4. Third party report 6. Context of Assessment 6.1 Competency may be assessed individually in the actual workplace or through accredited institution",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 40 UNIT OF COMPETENCY: PLANT CROPS UNIT CODE: AFF 610 302 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to conduct activities related to land preparation and planting of agricultural crops. This unit also includes proper handling of seeds/seedlings/saplings for planting and transplanting, proper use of tools and equipment, conduct land preparation and field lay-out. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range Statement 1. Prepare land for planting 1.1 Tools, materials and equipment are prepared for land clearing 1.2 The land is cleared according to prescribed methods of land preparation 1.3 Debris are removed and disposed according to waste management standards. 1.4 Soil samples are collected for analysis based on standard procedure 1.5 Land preparation is conducted according to crop requirement. 1.6 Basal fertilizer is applied based on crop requirement 1.7 Safety procedures for fertilizer application is followed according to OSHS 2. Conduct field lay-out 2.1 Tools and materials are prepared for field lay-out. 2.2 Interpret field lay-out plan according to the recommended planting system. 2.3 Field is laid-out according to recommended planting system 3. Dig holes 3.1 Diggings of holes are performed based on crop requirement. 3.2 Topsoil is separated to be used in covering the hole after planting. 3.3 Basal fertilizer application is performed based on the recommended amount. 4. Perform direct seeding 4.1 Seeds are planted according to the recommended rate, distance, and depth 4.2 Replanting is timely done according to recommended practices for a particular crop 4.3 Safety procedures are followed according to Occupational Safety and Health Standards (OSHS) and Good Agricultural Practices (GAP) 5. Transplant seedlings 5.1 Handling of seedlings from the nursery is performed based on prescribed practices. 5.2 Transplanting of seedlings is done based on crop practices 5.3 Re-bagging is done for a particular crop requirement 5.4 Replanting is timely done based on planting protocol. 5.5 Safety procedures are followed according to Occupational Safety and Health Standards (OSHS) and Good Agricultural Practices (GAP)",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 41 RANGE OF VARIABLES VARIABLE SCOPE 1. Tools, materials and equipment Include but not limited to the following: 1.1. Bolo 1.2. Scythe 1.3. Spade or shovel 1.4. Garden hoe 1.5. Rake 1.6. Grasscutter 1.7. Compost 1.8. Hand tractors and attachments 2. Debris Include but not limited to the following: 2.1. Stones 2.2. Sticks 2.3. Unwanted vegetation 2.4. Other garbage 3. Land preparation Include but not limited to the following: 3.1. Plowing 3.2. Harrowing 3.3. Leveling 3.4. Furrowing 4. Crop May include the following: 4.1. Ornamental plants 4.2. Plantation crops 4.3. Fruit crops 4.4. Vegetables 4.5. Root crops 4.6. Forage crops 4.7. Cereals 4.8. Herbs and spices 5. Fertilizer Include the following: 5.1. Organic 5.2. Inorganic 6. Planting system May include but not limited to the following: 6.1 Open Field 6.1.1. Raised bed 6.1.2. Square 6.1.3. Quincunx or diagonal 6.1.4. Hexagonal or triangular 6.1.5. Contour system 6.1.6. Single row 6.1.7. Double row 6.1.8. Broadcast method 6.2 Green house 6.2.1. Raised bed 6.2.2. Potted",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 42 EVIDENCE GUIDE 1. Critical Aspects of Competency 1.1 Carry-out land clearing 1.2 Conducted proper soil sampling/collection 1.3 Performed appropriate land preparation 1.4 Laid out site for planting 1.5 Dug holes 1.6 Sown seeds 1.7 Planted and transplanted seeds/seedlings/saplings 2. Required Knowledge and Attitudes 2.1 Systems of planting 2.2 Handling of fertilizers 2.3 Proper use and maintenance of cutting, digging and tillage tools 2.4 Use of measuring device 2.5 Proper use of tools and equipment 2.6 Occupational Health and Safety Standards 2.7 Good Agriculture Practice Standards by BAFPS 2.8 Waste management standards 2.9 Collection of soil sample 3. Required Skills 3.1. Proper handling of tools and equipment 3.2. Fertilizer application 3.3. Interpret lay-out 3.4. Digging holes 3.5. Operate hand tractors 4. Resource Implications The following resources should be provided: 4.1. Tool room and farm house 4.2. Farm tools/implements/equipment 4.3. Writing device 4.4. Farm supplies 4.5. Logbooks 4.6. References (fertilizer and pesticide manual/catalogue, protocols, field guides, OHS P and GAP manuals) 4.7. Production guide 5. Methods of Assessment Competency in this unit may be assessed through: 5.1. Direct Observation 5.2. Demonstration 5.3. Oral interview and/or written test 5.4. Third party report 6. Context of Assessment 6.1. Competency may be assessed individually in the actual workplace or through accredited institution",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 43 UNIT OF COMPETENCY: CARE AND MAINTAIN CROPS UNIT CODE: AFF 610 303 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to apply pest control, measure, apply fertilizer, water crops, perform pruning and perform physical growth-enhancing practices. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range Statement 1. Apply pest control measure 1.1 Pests incidence is monitored based on prescribed procedure. 1.2 Tools and materials are prepared according to specific pest control measure. 1.3 Appropriate pest control measures are followed based on GAP 1.4 Safety measures are observed and practiced according to Occupational Health and Safety (OHS) procedures. 2. Apply fertilizer 2.1 Tools and materials are prepared according to prescribed user’s manual 2.2 Fertilizers are identified based on kinds. 2.3 Fertilizer rates are applied based on crop requirements. 2.4 Appropriate method of fertilizer application is employed based on crop requirements. 2.5 Precautionary measures are applied to avoid cross contamination based on GAP. 2.6 Safety procedures are followed according to Occupational Safety and Health Standards 3. Water crops 3.1. Soil moisture content is determined based on soil field capacity 3.2. Watering performed following the prescribed method and schedule 3.3. Good Agricultural Practices is observed. 4. Perform pruning 4.1. Pruning method is performed according to crops. 4.2. Tools and materials for pruning are prepared. 4.3. Safety procedures are followed according to Occupational Safety and Health Standards and PNS:PAES 101 5. Perform physical growth-enhancing practices 5.1. Tools and equipment for cultivation are prepared according to PNS:PAES 101. 5.2. Cultivation practices are carried out based on crop requirement. 5.3. Rejuvenating activities are performed according to established cultural practices. 5.4. Growth training techniques are performed for different crops 5.5. Mulching techniques are carried out based on crops. 5.6. Safety procedures are followed according to Occupational Safety and Health Standards.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 44 RANGE OF VARIABLES VARIABLE RANGE 1. Pests Include but not limited to: 1.1. Weeds 1.2. Insects 1.3. Diseases 1.4. Mites 1.5. Rodents 1.6. Other pests 2. Tools and materials Includes but not limited to: 2.1. Knapsack/power sprayers 2.2. Measuring devices 2.3. Insect traps 2.4. Pesticides (bio or synthetic) 2.5. Pruning shears 2.6. Shovel 2.7. Safety gears 2.8. Paper/plastic sleeves 2.9. Fertilizer 2.10. Pail 2.11. Measuring cup 2.12. Hoe 2.13. Shovel 2.14. Carabao pulled implements 2.15. Pruning shear 2.16. Pruning saw 2.17. Bolo 2.18. Paint 3. Pest control measures Include but not limited to: 3.1. Physical 3.2. Mechanical 3.3. Biological 3.4. Cultural 3.5. Chemical (biopesticide, synthetic) 3.6. IPM 3.7. Sanitation 4. Fertilizers Include the following: 4.1. Organic 4.2. Inorganic 5. Method of fertilizer application Include but not limited to the following: 5.1. Basal 5.2. Sidedress 5.3. Topdress 5.4. Localized 5.5. Band 5.6. Foliar/Spray",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 45 VARIABLE RANGE 5.7. Broadcast 6. Watering Include but not limited to: 6.1. Drip 6.2. Furrow 6.3. Sprinkler 7. Rejuvenating activities Include but not limited to the following: 7.1. Grafting 7.2. Ratooning 7.3. De-suckering 8. Growth training technique Include but not limited to the following: 8.1. Hardening 8.2. Pricking 8.3. Thinning",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 46 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1. Performed pruning according to crops 1.2. Controlled weed population 1.3. Monitored pests through recording and reporting of pests incidence. 1.4. Practiced pest control measures 1.5. Applied fertilizer with appropriate method 1.6. Applied proper irrigation/watering of crops 1.7. Carried out cultivation practices based on crop requirement 1.8. Performed rejuvenating activities 1.9. Performed growth training technique for different crops 1.10. Carried out mulching techniques 1.11. Followed Occupational Health and Safety Standards 2. Required Knowledge and Attitudes 2.1. Pruning techniques 2.2. Weeding methods 2.3. Pest control procedures 2.4. Fertilizer application 2.5. Irrigation methods 2.6. Occupational Safety and Health Standards 3. Required Skills 3.1. Basic mathematical processes of addition, subtraction, division and multiplication 3.2. Proper handling of tools and equipment 3.3. Pest monitoring by recording and reporting pests incidence 3.4. Fertilizer and pesticide application 4. Resource Implications The following resources should be provided: 4.1. Farm or plantation area 4.2. Storage shed 4.3. Farm tools/ implements/ equipment 4.4. Farm supplies 4.5. Logbooks 4.6. Irrigation system and parts 4.7. References (fertilizer and pesticide manual/ catalogue, protocols, field guides, etc.) 5. Methods of Assessment Competency in this unit may be assessed through: 5.1. Direct Observation 5.2. Demonstration 5.3. Oral interview and/or written test 5.4. Third party report 6. Context of Assessment 6.1. Competency may be assessed individually in the actual workplace or through accredited institution",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 47 UNIT OF COMPETENCY: CARRY-OUT HARVEST AND POSTHARVEST OPERATIONS UNIT CODE: AFF610 304 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to perform harvest and postharvest operations of major agricultural crops including maintaining quality of produce for distribution. This unit also includes proper use of tools and equipment required to perform the activities. This unit does not include secondary processing. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range Statement 1. Perform pre-harvest operations 1.1 Crop maturity is identified according to parameters affecting physiological growth and physical indicators. 1.2 Records of crop agronomic history is verified and referenced for maturity. 1.3 Obstructions from the field are removed for efficient harvesting 1.4 Harvesting tools and materials, and temporary shed are readied 1.5 Records regarding crops to be harvested are checked 2. Perform harvesting activity 2.1 Appropriate harvesting methods are implemented based on best cultural practices for each crop using suitable tools 2.2 Crops are handled according to the postharvest treatment. 2.3 Crops are harvested based on maturity indices and characteristics affecting harvest quality 2.4 Harvesting is performed while observing GAP principles 3. Perform postharvest operation 3.1 Postharvest operations are employed based on standard are followed. 3.2 Use of postharvest equipment is monitored avoiding damage to crop in line with manufacturer/enterprise procedures. 3.3 Handling and packaging are done according to variety and destination. 3.4 Crops are stored and stacked in cool dry place prior to distribution in line with enterprise procedures 4. Monitor storage pest and diseases 4.1 Pest are identified based on references for storage pest and diseases 4.2 Identified storage pest and diseases are logged and reported to immediate authority.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 48 RANGE OF VARIABLES VARIABLE SCOPE 1. Physiological growth Include the following: 1.1 Days after flower induction 1.2 Days after fruit setting 2. Physical indicators Include the following: 2.1. Change in color 2.2. Change in size 2.3. Change in texture 3. Agronomic history Include the following: 3.1 Nursery source 3.2 Variety of plant 3.3 Planting calendar 3.3.1 Days after planting 3.3.2 Days at flowering 3.3.3 Days at fruit set 4. Obstructions May include but not limited to: 4.1. Weeds 4.2. Dead branches 4.3. Stakes and wedges 5. Harvesting tools and materials May include the following: 5.1. Picking poles 5.2. Scythes 5.3. Scissors 5.4. Shears 5.5. Shovels 5.6. Collecting baskets with liners 5.7. Harvesting crates with liner 5.8. Container with clean water with preservative 5.9. Sacks 5.10. Twines 5.11. Labels and markers 6. Records Include the following: 6.1. Crop history 6.2. Farm calendar 6.3. Farm records 7. Crops May include the following but not limited to: 7.1. Fruitcrop 7.1.1. Mangoes 7.1.2. Papayas 7.1.3. Pineapple 7.1.4. Banana 7.1.5. Citrus 7.2. Plantation crop 7.2.1. Coffee",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 49 7.2.2. Cacao 7.2.3. Abaca 7.2.4. Coconut 7.2.5. Sugarcane 7.3. Forage 7.4. Ornamentals 7.4.1. Rose 7.4.2. Sampaguita 7.4.3. Anthurium 7.4.4. Chrysanthemum 7.5. Cereals 7.5.1. Rice 7.5.2. Corn 7.6. Vegetables 7.6.1. Leafy 7.6.2. Fruit vegetable 7.6.3. Legumes 7.6.4. Bulbs 7.7. Medicinal plants 7.7.1. Sambong 7.7.2. Lagundi 7.7.3. Tsaang-gubat 7.7.4. Yierba-buena 7.7.5. Acapulko 7.7.6. Bayabas 7.7.7. Ampalaya 7.7.8. Pansit-pansitan 7.7.9. Niyog-niyugan 7.7.10. Bawang 7.8. Essential Oil plants 7.8.1. Ilang-ilang 7.8.2. Sampaguita 7.8.3. Citronella 7.8.4. Vanilla 7.9. Culinary Herbs 7.9.1. basil 7.9.2. lemon grass 7.9.3. mint 7.9.4. tarragon 7.9.5. parsley 7.10. Spices 7.10.1. black pepper 7.10.2. chili 7.10.3.",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 50 8. Postharvest treatments May include the following: 8.1 Hot water treatment 8.2 Vapor heat treatment 8.3 Chemical treatment 8.4 Best practices in drying 8.5 Pre-cooling treatment 9. Characteristics affecting harvest Include the following: 9.1. Continued occurrence of physiological changes 9.2. High in water content 9.3. Susceptible to attack by pathogens and insects 10. Postharvest operation Include the following: 10.1. Washing 10.2. Cleaning 10.3. Sorting 10.4. Trimming 10.5. Chemical Treatment 10.6. Grading 10.7. Fermenting 10.8. Drying 10.9. Blanching 11. Postharvest equipment Include the following: 11.1. Hot water treatment machine 11.2. Sorter 11.3. Weighing scale 12. Damage Include the following: 12.1. Bruising 12.2. Wounding 12.3. Abrasion 13. Packaging Includes: 13.1. Crates (wooden, plastics and styro) 13.2. Paper wrap 13.3. Carton box 13.4. PEB (Polyethylene bags) 13.5. Styro 13.6. Sacks/bags 14. Storage and stacking 14.1. On-farm storage 14.2. Off-farm storage 15. References 15.1. Pictorial guide 15.2. Posters 15.3. Pamphlets 16. Storage pest and diseases 16.1. Insect pest 16.2. Rodents 16.3. Fungi 16.4. Bacteria",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I Promulgated December 2013 51 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1 Prepared field and materials/tools used for harvesting and postharvest 1.2 Identified and applied maturity indices when harvesting 1.3 Harvested and handled crops properly 1.4 Maintained quality of crops during distribution and storage applying consideration for optimum condition 1.5 Monitored storage pest and diseases 2. Required Knowledge and Attitudes 2.1 Safety Practices 2.1.1 Knowledge on HACCP principles 2.1.2 Knowledge on Good Manufacturing Practices 2.2 Mathematics and Measurement 2.2.1 Measurement of humidity and temperature 2.2.2 Measurement of area, volume, and weight 2.2.3 Simple mathematical computation 2.3 Tools & Equipment: Uses and Specification 2.3.1 Use of measuring devices 2.3.2 Operation of machines and equipment 2.4 Systems, Processes and Operations 2.4.1 Principles and practices in harvest and postharvest 2.4.1.1 Different storage pest and diseases 2.4.1.2 Different handling and packaging of produce 2.4.2 Identification of postharvest facilities, 2.5 Values 2.5.1 Effective team player 2.5.2 Smooth Interpersonal Relationship (SIR) 2.5.3 Observant of work ethics 3. Required Skills 3.1 Communicating ideas and info 3.2 Collecting information 3.3 Proper use and maintenance of tools and equipment 3.4 Monitoring skills 3.5 Maintain quality of stored commodities 3.6 Physical analysis of crop for quality standards 4. Resource Implications The following resources should be provided: 4.1 Facilities and equipment appropriate for harvest and postharvest of crops 4.2 Supplies and materials contingent to machines 4.3 Farm house 4.3.1 Packing area 4.3.2 Storage facilities 4.4 Farm tools/ implements/ equipment 4.5 Writing instruments 4.6 Farm supplies 4.7 Logbooks 4.8 References (catalogue, protocols, field guides, GAP, OHSS manuals)",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Agricultural Crop Production NCI I\nPromulgated December 2013\n52 5. Method of Assessment\nCompetency in this unit may be assessed through:\n5.1 Direct observation and questioning\n5.2 Demonstration (simulated)\n5.3 Oral interview and written test\n5.4 Third party report\n6. Context of Assessment\n6.1 Competency may be assessed individually in the actual workplace or through TESDA accredited institution\n6.1.1 Private farms\n6.1.2 Farm school",
                "metadata": {
                    "source": "datasets\\raw\\Agricultural Crops Production NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            }
        ]
    }
]