[
    {
        "name": "Animal Production (Ruminants) NC II",
        "core_competencies": [
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 31 CORE COMPETENCIES UNIT OF COMPETENCY: MAINTAIN HOUSING, FARM IMPLEMENTS AND SURROUNDING AREAS UNIT CODE: AFF621901 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to manage farm structures and environment. It comprises activities such as preparing for maintenance activities, maintaining of farm and its structures, applying bio-security measures and perform work to completion. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare for farm maintenance activities 1.1. Farm and surrounding area are checked for problems according enterprise and DENR standards. 1.2. Equipment, tools and materials for maintenance activities are prepared according to Occupational Safety and Health Standards (OSHS). 1.3. Condition of facilities is recorded and reported to appropriate authority based on enterprise requirements. 2. Maintain farm and housing facilities 2.1. Farm is maintained based on enterprise standards. 2.2. Pest and vermin are controlled according to industry procedures and environmental regulations (Environmental Management Standards). 2.3. Animal housing and facilities are maintained according to BAI. 2.4. Farm supplies and tools for maintenance are made available according to farm requirements. 2.5. Fence is repaired according to work requirements. 2.6. Safety measures are applied according to Occupational Safety and Health Standards (OSHS) 3. Apply bio-security measures 3.1. Bio-security threats and hazards are identified with reference to Bureau of Animal Industry - Department of Agriculture (BAI-DA) animal health standards. 3.2. Bio-security measures are applied according to Bureau of Animal Industry - Department of Agriculture (BAI-DA) standards and OSHS 3.3. Relevant records are collected and maintained according to enterprise standards. 4. Perform work to completion 4.1. Tools and materials are maintained and stored according to established enterprise practices and following 5S principle.",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 32
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 32 4.2. Farm wastes are disposed according to DENR regulations and 3Rs principle. 4.3. Report on work outputs and updates are prepared and submitted to concerned person or authority according to industry practices.",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 33 RANGE OF VARIABLES VARIABLE SCOPE 1. Problems 1.1 Pests and vermin 1.2 Corrosion 1.3 Damages caused by elements 1.4 Faulty and defective facilities 1.5 Deteriorated farm structures 2. Equipment, tools and materials 2.1. Equipment 2.1.1. Grass cutter 2.1.2. Sprayer 2.1.3. Emergency lights 2.1.4. Weighing scale 2.2. Tools 2.2.1. Pliers, 2.2.2. Hammer 2.2.3. Bolo and scythe 2.2.4. Shovel, 2.2.5. Hayfork, 2.2.6. Wheelbarrow 2.2.7. Saw 2.2.8. Plumbing tools 2.3. Supplies 2.3.1. Lime 2.3.2. Detergents 2.3.3. Disinfectants 2.3.4. Hygiene supplies 2.3.5. Fertilizers 2.3.6. Fuels/lubricants 2.3.7. Brooms 2.3.8. Dustpan 2.3.9. Pail 2.3.10. Fire extinguisher 2.3.11. Garden hose 2.3.12. Nails 3. Facilities 3.1. House 3.2. Feeder 3.3. Waterer 3.4. Feedlot pens 3.5. Maternity pen 3.6. Kidding/lambing pen 3.7. Calf hutches 3.8. Stud pen for bulls 3.9. Milking barn/parlor with appropriate ventilation 3.10. Storage room for feeds and supplies 3.11. Laborers quarter 3.12. Silo, hay barn 3.13. Manure barn",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 34 3.14. Machinery shed 3.15. Farm office 3.16. Water and power supplies 3.17. Working corral with chute 3.18. Disposal area of dead carcasses 4. Bio - security threats and hazards 4.1. Disease outbreak 4.2. Vaccination failures 4.3. Unavailability of veterinary supplies 4.4. Astray animals (dogs, cats, birds) 4.5. New animal acquisition 4.6. Diseases acquired through importation 4.7. Zoonotic diseases 4.8. Inefficient waste disposal 4.9. Inaccurate diagnosis 4.10. Visitors of farms 4.11. Vehicles coming from outside 4.12. Zoning clearance (not near to community houses) 4.13. Ineffective use of disinfectants 5. Bio - security measures 5.1. Prevention of disease through Animal Health program 5.2. Provisions of foot dips and tire baths 5.3. Prevention of disease transmission through good animal husbandry practices 6. Farm wastes 6.1. Animal manure 6.2. Feed refuse or food leftovers 6.3. Spoiled feeds (Forage and feed supplements) 6.4. Empty veterinary bottles, syringes, needles and sharp objects 6.5. Disposable gloves and masks 6.6. Expired biologics 6.7. Spoiled milk 6.8. Spent bedding materials 6.9. Empty sacks 6.10. Dead animals 6.11. Placenta",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 35 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1. Prepared for farm maintenance activities 1.2. Maintained farm and housing facilities 1.3. Applied bio-security measures 1.4. Performed work to completion 2. Required Knowledge and Attitudes 2.1. Knowledge, Theory, Practices and Systems Operations 2.1.1. Knowledge on first aid 2.1.2. Different types and uses of equipment, tools and materials for maintenance 2.1.3. Categories of farm wastes 2.1.4. Bio-security threats and hazards 2.1.5. Different facilities 2.1.6. Different pest and vermin 2.1.7. Bio-security procedures 2.1.8. Maintenance of housing and implements 2.1.9. Procedures on periodic pest and vermin control 2.2. Communication 2.2.1. Maintenance of relevant records of farm 2.2.2. Reporting of work outputs and condition of farm and facilities 2.2.3. Reporting of problems identified in farm operations 2.3. Mathematics and Mensuration 2.3.1. Computation for space requirements 2.3.2. Inventory of supplies and materials 2.3.3. Amount of farm wastes 2.4. Safety Practices 2.4.1. Implementation of safety standard in handling chemicals and biologics as prescribed by manufacturers 2.4.2. Wearing of appropriate Personal Protective Equipment (PPE’s) 2.4.3. Disposal of hazardous wastes and dead carcasses 2.4.4. Elimination of sharp and pointed objects 2.5. Codes and Regulations 2.5.1. Municipal and cities/provincials ordinances 2.5.2. Clean Air Act 2.5.3. Animal Welfare Act RA 8485 2.5.4. Ecological Solid Waste Management Act (RA9003) 2.5.5. Hazardous Materials (RA 6969) 2.5.6. Liquid Wastes Act 2.6. Materials, Tools & Equipment: Uses, Specifications and Maintenance",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 36 2.7.1. Tools and Equipment 2.6.1.1. Can understand and follow instructional manuals 2.6.1.2. Safe keeping of equipments every after use 2.7.2. Materials 2.6.2.1. Where to source good quality supplies, materials and equipment needed in the operation of the farm 2.7.3. Maintenance 2.6.3.1. Regular upkeep of equipments and facilities 2.6.3.2. Preventive maintenance skills 2.7. Values 2.7.1. Patience 2.7.2. Punctuality 2.7.3. Perseverance 2.7.4. Honesty 2.7.5. Hardworking 3. Required Skills 3.1. Basic first aid 3.2. Basic skills in using maintenance tools and equipment 3.3. Calculations 3.4. Effective communication skills 4. Resource Implications 4.1. Farm site/pasture area with appropriate facilities 4.2. Tools 4.2.1. Weighing scale – for weighing farm wastes 4.2.2. Grass cutter 4.2.3. Sprayer 4.2.4. Emergency lights 4.2.5. Weighing scale 4.2.6. Pliers, 4.2.7. Hammer 4.2.8. Bolo and scythe 4.2.9. Shovel, 4.2.10. Hayfork, 4.2.11. Wheel barrow 4.2.12. Saw 4.2.13. Plumbing tools 4.2.14. Fire extinguisher 4.2.15. Garden hose 4.3. Materials 4.3.1. Lime 4.3.2. Detergents 4.3.3. Disinfectants 4.3.4. Hygiene supplies 4.3.5. Fertilizers 4.3.6. Fuels/lubricants 4.3.7. Brooms 4.3.8. Dustpan 4.3.9. Pail 4.3.10. Nails 4.4. All workers involved in different activities must be fully oriented and cautioned on the different specific work",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 37 activities of the farm 4.5. Technical supervisors should have skills and ability in the successful implementation of work program activities 5. Method of Assessment Competency in this unit may be assessed through: 5.1. Observation and questioning 5.2. Written examination 5.3. Third Party Report 5.4. Portfolio 5.5. Demonstration 6. Context of Assessment 6.1. Competency may be assessed individually in the actual workplace or in accredited farms or institution",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 38 UNIT OF COMPETENCY: PROVIDE FORAGE UNIT CODE: AFF621902 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to provide forage which include functions during forage area preparation, planting and maintenance activities of forage area, production of silage and completion of work. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range Statement 1. Prepare area for forage plantation 1.1 Tools, materials and equipment are prepared according to work requirements and plan. 1.2 Forage area is cleared from unwanted vegetations and debris according to site plan. 1.3 Land is prepared according to site plan and production requirements. 1.4 Fence is set-up in the perimeter following site plan. 1.5 Safety measures are practiced according to Occupational Health and Safety (OHS) procedures. 2. Plant forage species 2.1. Forage species to be planted are determined according to types of ruminants and availability of forage species. 2.2. Forage planting materials are sourced-out and collected from recommended sources and other farmers. 2.3. Forage species are planted according to plan and production requirements. 2.4. Task is performed according to OSHS. 3. Maintain forage plants 3.1. Pest control measures are employed according to Good Agricultural Practices (GAP) 3.2. Fertilizers are applied according to plant requirements 3.3. Plants are watered according to plant requirements. 3.4. Other maintenance practices are done following GAP and plant requirements. 3.5. Tasks are performed following GAP and OSHS procedures. 4. Produce silage 4.1. Excess forages and other materials for silage are gathered following established farm procedures. 4.2. Silos are used according to supply of silage materials. 4.3. Ensiling is done following standard procedures. 4.4. Commercial silage additives are mixed according to enterprise requirements. 4.5. Forage silage is stored following established storage requirements and condition. 4.6. Forage silage are inspected for quality check and",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 39 improvement. 5. Perform work to completion 5.1. Tools and equipment are cleaned, maintained and stored according to established standard practices 5.2. Maintenance of clean and safe area is undertaken throughout and on completion of work. 5.3. Records of silage production are compiled for reference and reporting purposes following enterprise procedures and 5S principles. 5.4. Work output is reported to concerned person or authority according to industry practices.",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 40 RANGE OF VARIABLES VARIABLE RANGE 1. Tools, materials and equipment 1.1. Equipment 1.1.1. Grass cutters 1.1.2. Generator 1.1.3. Water pump with hose 1.1.4. Tractors (optional) 1.1.5. Draft animals 1.2. Tools 1.2.1. Plow and harrow 1.2.2. “Bolo” and scythe 1.2.3. Shovel 1.2.4. Hoe 1.2.5. Water sprinklers 1.2.6. Planter 1.2.7. Wheelbarrow 1.2.8. Hole digger 1.3. Materials 1.3.1. Planting materials 1.3.2. Fertilizer (Organic and inorganic) 1.3.3. Pesticides 1.3.4. Root inoculants 1.3.5. Herbicides 1.3.6. Fencing materials 2. Unwanted vegetations and debris 2.1. Poisonous and destructive plants 2.2. Inedible vegetation 2.3. Tree stumps 2.4. Broken bottles, glass, plastics and other non-biodegradable wastes 2.5. Garbage 2.6. Soil contaminants (chemicals, metals, stones, construction debris) 2.7. Termite hills 2.8. Weeds 3. Forage species 3.1. Napier 3.2. Guinea Grass 3.3. Paragrass 3.4. Centrosema 3.5. Calopogonium 3.6. Stylosanthes 3.7. Acacia 3.8. Malunggay 3.9. Stargrass 3.10. Humidicola 3.11. Kakawate 3.12. “Mani-manian” (Arachis pintoi) 3.13. Renzonii 3.14. Flemingia",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 41 3.15. Pigeon Pea 3.16. Tricantera or “Madre de agua” 3.17. Mullberry 3.18. Indigofera 3.19. Ipil-ipil 3.20. Katuray 3.21. Forage corn 3.22. Sweet Sorghum 3.23. Cassava leaves 3.24. Soybeans 4. Pest control measures 4.1. Organic pesticides 4.2. Chemical pesticides 4.3. Biological control 4.4. Selection of pest resistant forages 5. Fertilizers 5.1. Organic fertilizers 5.2. In-organic fertilizers 6. Other maintenance practices 6.1. Correct cutting intervals 6.2. Replacement of plant mortalities 6.3. Weeding 7. Excess forages and other materials for silage 7.1. Grasses 7.1.1. Native grasses 7.1.2. Improved grasses 7.2. Legumes 7.2.1. Vines 7.2.2. Shrubs 7.2.3. Fodder trees 7.3. Conserved forages 7.3.1. Silages (corn & grasses) 7.3.2. Hay (grasses or legumes) 7.3.3. Urea-treated rice straw (UTRS) 7.4. Farm by-products 7.4.1. Rice straw 7.4.2. Sugar cane tops 7.4.3. Sweet potato vines 7.4.4. Corn stover 7.5. Industrial by-products 7.5.1. Spent grain 7.5.2. Molasses 7.5.3. Pineapple pulps 7.5.4. 3Banana peelings 7.5.5. Rice/corn bran 7.5.6. Cassava (leaves or meal) 7.5.7. copra meal 7.6. Alternative feed resources 7.6.1. Tree leaves and shrubs 7.6.2. Banana stalks 7.6.3. Peanut/soya hay 7.6.4. Gumamela 7.6.5. Chicken manure",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 42 7.6.6. Milk replacer 8. Ensiling 8.1. Pre-seal 8.2. Active fermentation 8.3. Stable phase 8.4. Feed-out 9. Commercial silage additives 9.1. Bacterial inoculants 9.2. Enzymes 9.3. Nonprotein nitrogen (NPN) sources 9.4. Acids 9.5. Sugar sources 9.6. Feed fortifier (grains, bran, molasses) 10. Improvement 10.1. Includes the following for improvement of quality of silage: 10.2. Adding the following: 10.2.1. molasses 10.2.2. grains 10.3. Silage is compacted 10.4. Cover to ensure anaerobic condition 11. Records of silage production 11.1. Date of production of silage 11.2. Date of harvest of silage 11.3. Quantity starting materials for silage 11.4. Silage recovered (yield) 11.5. Species of forages ensiled 11.6. Feed sources and contact details",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 43 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1 Prepared area for forage plantation 1.2 Planted forage species and alternative sources of forages 1.3 Applied accepted cultural practices in forage production 1.4 Produced silage 1.5 Performed work to completion 2. Required Knowledge and Attitudes 2.1. Knowledge, Theory, Practices and Systems Operations 2.1.1 Types of soil and terrain 2.1.2 Types of forage species 2.1.3 Cropping season and patterns 2.1.4 Good Agricultural Practices 2.1.5 Land preparation procedures 2.1.1 Different forage and materials for silage 2.1.2 Volume of protein produce 2.1.3 Irrigation practices 2.1.4 Silaging practices 2.1.5 Cut and carry system of feeding 2.1.6 Harvesting of silage 2.1.7 Disposal procedures of spoiled silages 2.1.8 Record keeping 2.2 Communication 2.2.1 Preparation of report 2.2.2 Following verbal and written instructions 2.3 Safety Practices 2.3.1 Wearing of PPE’s 2.3.2 Handling of chemicals 2.3.3 Disposal of wastes (empty bottles, etc.) 2.3.4 GAP 2.3.5 First aid 2.4 Mathematics and Mensuration 2.4.1 Seeding rate 2.4.2 Yield rate 2.4.3 Planting distance 2.4.4 Dosage of chemicals/fertilizers 2.4.5 Cost of forages per animal 2.4.6 Volume of forage needed for the whole herd 2.4.7 Productivity per area planted to forage 2.4.8 Computation for mixture of silage components 2.4.9 Computation of nutrient requirements 2.4.10 Inventory of supplies and materials 2.5 Safety Practices 2.5.1. Implementation of safety standard in handling chemicals as prescribed by manufacturers 2.5.2. Wearing of appropriate Personal Protective Equipment (PPEs) 2.5.3. Disposal of hazardous wastes 2.5.4. Elimination of sharp and pointed objects",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 44 2.5.5. Practice of safety precautions in harvesting forages 2.5.6. Disposal of spoiled silages 2.5.7. Feeds checked for aflatoxins 2.5.8. Practice Occupational Safety and Health Standards (OSHS) 2.6 Codes and Regulations 2.6.1. Compliance to OSHS 2.6.2. Municipal and cities/provincials ordinances 2.7 Materials, Tools, Equipment: Uses, Specifications and Maintenance 2.7.1. Tools and Equipment 2.7.1.1. Can understand and follow instructional manuals 2.7.1.2. Safe keeping of equipments every after use 2.7.2. Materials 2.7.2.1. Where to source good quality supplies, materials and equipment needed in the operation involving forage provisions. 2.7.3. Maintenance 2.7.3.1. Regular upkeep of equipments and facilities 2.7.3.2. Preventive maintenance skills 2.8 Values 2.8.1 Resourcefulness 2.8.2 Hardworking 2.8.3 Diligence 2.6.3. Patience 2.6.4. Perseverance 2.6.5. Honesty 3. Required Skills 3.1 Occupational health and safety practices 3.2 Tractor operation or plowing 3.3 Handling draft animals 3.4 Skills in using farming tools and equipment 3.5 Calculations 3.6 Effective communication skills 4. Resource Implications 4.1. Farm with forage area and facilities 4.2. Silage production area 4.3. Supplies and materials appropriate to the activity 4.4. Tools and equipment appropriate to the activity 4.5. Feed resources 4.6. Different silage 4.7. All workers involved in different activities must be fully oriented and cautioned on the different specific work activities of the farm 4.8. Technical supervisors should have skills and ability in the successful implementation of work program activities 5. Method of Assessment Competency in this unit must be assessed through: 5.1 Observation and questioning 5.2 Written examination 5.3 Third Party Report",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 45 5.4 Portfolio 5.5 Demonstration 6. Context of Assessment 6.1. Competency may be assessed individually in the actual workplace or in accredited farms or institution",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 46 UNIT OF COMPETENCY: PERFORM BREEDING OF RUMINANTS UNIT CODE: AFF621903 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to perform breeding of ruminants. It comprises of preparing animal stocks, breeding of ruminants, carrying-out monitoring activities, feeding the animals, applying basic health care and performing post-breeding activities. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range Statement 1. Prepare animal stocks 1.1. Breeds of animals suitable for meat, dairy and mixed-type/dual purpose are obtained based on breed standards and adoptability on the farm environment following instructions from authority. 1.2. Animals are placed in suitable house and facilities following Good Animal Husbandry Practices (GAHP) and Animal Welfare Act. 1.3. Animals are well fed and maintained regularly following Animal Welfare Act. 2. Breed ruminants 2.1. Prepare tools, materials and equipment for breeding operations following breeding schedule and requirements. 2.2. Breeding program for ruminants is followed according to the business objective 2.3. Reproductive phenomena of ruminants are observed, recorded and reported following enterprise protocols. 2.4. Ruminants are bred naturally according to designed mating plan. 2.5. Where necessary, small ruminants are inseminated artificially according to instructions of supervisor. 2.6. Tasks are performed following Animal Welfare Acts. 2.7. Safety measures are practiced according to OSHS procedures. 3. Carry-out monitoring activities 3.1. Breeding performance of ruminants are observed recorded and reported following enterprise protocols. 3.2. Unproductive animals are treated and disposed according to the set standard 3.3. Breeding and reproduction data are regularly gathered and kept for evaluation according to enterprise protocols. 4. Feed animals 4.1. Basal rations for ruminants at various physiological stage are provided based on industry standard. 4.2. Feed supplements like concentrates, minerals and",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 47 vitamins are offered according to animal dietary requirements 4.3. Grazing management for ruminants are identified and practiced 4.4. Grazing capacity of the pasture is determined based on pasture land condition. 5. Apply basic health care 5.1. Sick animals are reported to appropriate authority. 5.2. Assistance is provided during implementation of medication program in accordance with enterprise standards and instructions of authority. 5.3. Safety practices are observed according to OSHS. 6. Perform post-breeding activities 6.1. Tools, materials and equipment are cleaned and stored following procedural manual and 5S principles. 6.2. Proper disposal of wastes are practiced according to DENR regulations. 6.3. Records are updated and kept following enterprise protocol. 6.4. Work outputs are reported to the authority following enterprise protocol.",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 48 RANGE OF VARIABLES VARIABLE SCOPE 1. Breeds of animals 1.1 Large Ruminants 1.1.1. Cattle Beef Dairy Native Strain Brahman Hindu - Brazil Simbrah Crosses Holstein Friesian Jersey Sahiwal Red Sindhi Crosses 1.1.2. Buffaloes Beef Dairy Native Carabaos American Murrah Cambodian buffalo Thai buffaloes Crosses Indian Murrah Bulgarian Murrah Nili Ravi Brazilian buffalo Crosses 1.2 Draft animals 1.2.1. Native carabaos and cattles 1.2.2. Cross breeds 1.3 Small Ruminants 1.3.1. Goat Meat - type Dairy type Mixed type Boer Kiko Kalahari Anglo - Nubian Anglo - Nubian Saanen Toggenburg Alpine Oberhasli Anglo Nubian 1.3.2. Sheep Meat - type Dorper (blackhead and whitehead) Katahdin Merino St. Croix Black belly Damara Dorset",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 49 2. Tools, materials and equipment 2.1. AI kit 2.2. Frozen semen 2.3. Breeder 3. Breeding program 3.1. Pure-breeding 3.2. Backcrossing 3.3. Crossbreeding, buckline and doeline 3.4. Rotational crossbreeding 3.5. Upgrading 4. Reproductive phenomena 4.1. Reproductive data Stage Cattle Buffalo Sheep Goat Ave. estrus cycle, d 20-23 18-71 21 21 Ave. estrus duration, d 23 18-36 24-42 24-42 Ave. gestation, d 270 310 145 150 Age of first estrus, yr 0.8-1 1.2 0.3 0.3 Calving interval, yr 1 1.2 8 mos 8 mos Post partum estrus, d 45 35-60 7-10 7-10 4.2. Signs of estrus 4.3. Signs of pregnancy 4.4. Signs of approaching parturition 5. Breeding performance 5.1. Breeding services 5.2. Pregnancy rate 5.3. Calf drop 5.4. Kidding/lambing/calving rate 5.5. Mortality rate 5.6. Male-female ratio 6. Unproductive animals 6.1. Hard-to-breed animals 6.2. Long calving to breeding interval 6.3. Physically deformed animals 6.4. Sick animals 6.5. Animals with reproductive disorders 6.6. Animals with low-milk production 6.7. Old aged animals 6.8. Vicious animals 6.9. Stunted animals 6.10. Malnourished animal 6.11. Too-fat animals 7. Feed supplements 7.1. Concentrate feeds 7.2. Mineral supplements 7.2.1. Urea Molasses Mineral Block (UMMB) 7.2.2. Medicated Urea Molasses Mineral Block (MUMMB) 7.2.3. Fermented Plant Juices (FPJ) 7.2.4. Lime 7.2.5. Dicalcium phosphate 7.2.6. Oyster shell 7.2.7. Salt",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 50 7.2.8. Bone meal 7.2.9. Minerals and vitamins 7.2.10. Probiotics 8. Grazing management 8.1. Continuous grazing 8.2. Rapid Rotational grazing (RRG) 9. Records 9.1 Animal identification 9.2 Pedigree (Dam and Sire) 9.3 Inventory 9.4 Breeding and reproduction records 9.5 Health records 9.6 Mortality and disposal records 9.7 Calving/kidding/lambing records",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 51 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1. Prepared animal stocks 1.2. Bred ruminants 1.3. Carried-out monitoring activities 1.4. Provided ration and implement feeding practices 1.5. Applied basic health care 1.6. Performed post-breeding activities 2. Required Knowledge and Attitudes 2.1. Knowledge, Theory, Practices and Systems Operations 2.1.1. Different animal breeds of ruminants 2.1.2. Selection of stocks 2.1.3. Tools, materials and equipment in breeding activities 2.1.4. Reproductive phenomena 2.1.5. Breeding program 2.1.6. Breeding mode and procedures of ruminants 2.1.7. Artificial insemination procedures for small ruminants 2.1.8. Natural mating 2.1.9. Monitoring of breeding ruminants 2.1.10. Care and management of breeders and general herd 2.1.11. Feed supplements 2.1.12. Aflatoxins in feeds 2.1.13. GAHP 2.1.14. Animal Welfare Act relating to breeding 2.1.15. OSHS in animal breeding 2.2. Communication 2.2.1. Preparation of selection criteria and breeding objectives, care and management of general herd, use of A.I. for improved reproduction, forage/feed production and conservation; financial viability of the enterprise. 2.2.2. Updating and keeping of data and records 2.2.3. Following verbal and written instructions 2.3. Mathematics and Mensuration 2.3.1. Computation of feed requirements at different physiological stages, reproductive parameters, feed conversion efficiency, dose requirements for A.I. and biologicals and income over costs of operation 2.4. Safety Practices 2.4.1. Implementation of safety standard in handling animals and biologicals as prescribed by manufacturers and endorsed by veterinarians 2.4.2. Wearing of PPE’s and proper disposal of hazardous wastes 2.4.3. Practice OSHS",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 52 2.4.4. Feeds check for aflatoxins 2.5. Codes and Regulations 2.5.1. Compliance to animal movement and quarantine protocol and herd health program as formulated through Executive and Administrative Orders issued by BAI, PCC, PAHC and NMIC of the Dept. of Agriculture, DENR. 2.5.2. Animal Welfare Act 2.5.3. Good Animal Husbandry Practices 2.5.4. OSHS 2.6. Materials, Tools & Equipment: Uses, Specifications and Maintenance 2.6.1. Tools and Equipment 2.6.1.1. Can understand and follow instructional manuals 2.6.1.2. Safe keeping of equipment every after use 2.6.2. Materials 2.6.2.1. Where to source good quality supplies, materials and equipment needed in the breeding operation 2.6.3. Maintenance 2.6.3.1. Regular upkeep of equipment and facilities 2.6.3.2. Preventive maintenance skills 2.7. Values 2.7.1. Patience during breeding activities 2.7.2. Perseverance in rearing the general herd 2.7.3. Honesty during business transactions such as sales of live animals and products 3. Required Skills 3.1. Practice OSHS and first aid 3.2. Skills in using tools and equipment 3.3. Calculations 3.4. Communicate effectively 4. Resource Implications 4.1. Farm and forage area 4.2. Different breeds of ruminants 4.3. Infrastructures - houses, seed, corrals, sheds 4.4. A.I. kit and paraphernalia 4.5. Feeds, concentrates and additives 4.6. Weighing scale (1000 kg. cap.) – for monitoring of animals weight 4.7. Drenching gun/syringe – deworming purposes 4.8. Pressurized pump – for cleaning of areas 4.9. All workers involved in different activities must be fully oriented and cautioned on the different specific work activities of the farm 4.10. Technical supervisors should have skills and ability in the",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 53 successful implementation of work program activities 5. Method of Assessment Competency in this unit may be assessed through: 5.1. Observation and questioning 5.2. Third Party Report 5.3. Portfolio 5.4. Demonstration 6. Context of Assessment 6.1. Competency maybe assessed individually in the actual workplace or in accredited farms or institution",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 54 UNIT OF COMPETENCY: RAISE DAIRY ANIMALS UNIT CODE: AFF6 21904 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to manage dairy animals. It comprises of functions such as handling dairy animals, rearing calves and kids, rearing dairy-breeder animals and completing the operations of raising dairy animals. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range Statement 1. Handle dairy animals 1.1. Pregnant animals are separated from the general herd and are kept in maternity pen. 1.2. Assistance during calving/kidding is provided according to GAHP. 1.3. Lactating ruminants are fed according to standards. 1.4. Lactating ruminants are maintained following production objective. 1.5. Milk is collected and checked for quality based on the standard procedures. 1.6. Collected milk are pasteurized and packaged following standard hygienic procedures (HACCP). 2. Rear calves and kids 2.1. Newly born calf/kid is reared according to developed rearing system. 2.2. Tools and materials are prepared according to work requirements. 2.3. Routine feeding is carried-out at prescribed feeding intervals. 2.4. Small and less vigorous calves and kids are identified and separated from others for specialized feeding. 2.5. Calves and kids are separated as required for routine husbandry or animal health procedures. 2.6. Progress and development of calves/kids is monitored regularly through weighing and/or visual appraisal. 2.7. Welfare and health abnormalities are reported to the appropriate authority 3. Rear dairy-breeder animals 3.1. Dairy-breeder-animals-to-be are placed in appropriate housing according to establish farm procedures and GAHP 3.2. Animals are fed according to prescribed feeding intervals. 3.3. Welfare and health abnormalities are reported to the appropriate authority",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 55 3.4. Monitoring of animals is done regularly through weighing and/or visual appraisal. 3.5. Adult Breeder for dairy - type animals are selected for breeding purposes according to breeds standard. 3.6. Male animals not intended for breeding are sold for meat. 4. Complete the operations 4.1. Animal and financial records derived from dairy operations are kept and updated according to industry standard. 4.2. Tools and materials are maintained and stored according to manufacturer’s specification and enterprise protocol. 4.3. Area is cleaned-up according to enterprise protocol 4.4. Wastes are disposed following environmental regulations and enterprise procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 56 RANGE OF VARIABLES VARIABLE SCOPE 1. Rearing system 1.1. Feeding of colostrums 1.2. Natural suckling 1.3. Artificial rearing (raw milk or milk replacer) 1.4. Combination of natural and artificial 2. Quality 2.1. Taste 2.2. Odor 2.3. Visual 3. Dairy-breeder-animals-to-be 3.1. Yearlings/growers 3.2. Young female a. Heifer b. Doelings 3.3. Young male a. Buckling b. Junior bull 3.4. Adult male a. Bucks b. Bull 4. Records 4.1. Production records 4.2. Breeding and reproduction records 4.3. Inventory and consumption records 4.4. Daily milk production records 4.5. Financial and sales records 4.6. Health records 4.7. Mortality and disposal records",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 57 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1 Handled dairy animals 1.2 Reared calves and kids 1.3 Reared dairy-breeder-animals-to-be 1.4 Completed the operations 2. Required Knowledge and Attitudes 2.1 Knowledge, Theory, Practices and Systems Operations 2.1.1 Calving/kidding 2.1.2 Rearing calves and kids 2.1.3 Rearing young ruminants 2.1.4 Rearing adult male animals for breeding 2.1.5 Implementation of medication program 2.1.6 Proper disposal of hazardous wastes 2.1.7 Procedures in milk collection 2.1.8 Quality check of milk 2.2 Communication 2.2.1 Updating and keeping of records and data relating to breeding activities 2.2.2 Preparation of inventory reports and production records 2.2.3 Report preparation on progress of the animals 2.2.4 Following verbal and written instructions 2.3 Mathematics and Mensuration 2.3.1 Estimation harvest time.. 2.3.2 Computation of harvest recovery 2.3.3 Feed conversion efficiency 2.3.4 Space requirements at various stages of growth 2.3.5 Provision of right amount of drugs, vaccines and other biologicals 2.3.6 Profitability of the operation 2.4 Safety Practices 2.4.1 Wear PPE 2.4.2 Practice OSHS 2.4.3 5S implementation 2.4.4 Knowledge in handling biologicals and disinfectants base on manufacturers specifications or VET recommendations 2.4.5 Proper disposal of hazardous wastes 2.5 Codes and Regulations 2.5.1 Appropriate legal regulatory body that supervises the animal industry such as BAI and Phil. Animal Health Center (PAHC), DENR 2.5.2 Occupational Safety and Health Standards. 2.5.3 Animal Welfare Act 2.5.4 GAHP 2.6 Materials, Tools & Equipment: Uses, Specifications and Maintenance",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 58 2.6.1. Tools and Equipment 2.6.1.1. Can understand and follow instructional manuals 2.6.1.2. Safe keeping of equipment every after use 2.6.2. Materials 2.6.2.1. Where to source good quality supplies, materials and equipment needed in the rearing dairy type animals 2.6.3. Maintenance 2.6.3.1. Regular upkeep of equipment and facilities 2.6.3.2. Preventive maintenance skills 2.7 Values 2.7.1. Diligence 2.7.2. Time consciousness 2.7.3. Honesty in records of sales 2.7.4. Confidence in selecting dairy type animals 2.7.5. Personal integrity in doing routine management practices 2.7.6. Perseverance in rearing dairy-type animals 2.7.7. Ability to work with others harmoniously 3. Required Skills 3.1 Work safety 3.2 Simple carpentry and masonry skills 3.3 Calculations 3.4 Planning skills 3.5 Communicate effectively 4. Resource Implications 4.1. Farm area and forage site 4.2. Animal house and cages 4.3. Milking parlor 4.4. Weighing scale and other tools, materials and equipment in handling dairy-type animals and milk collection 4.5. Medication and nutritional requirements 4.6. All workers involved in different activities must be fully oriented and cautioned on the different specific work activities of the farm 4.7. Technical supervisors should have skills and ability in the successful implementation of work program activities 5. Method of Assessment Competency in this unit must be assessed through: 5.1. Passing written exam 5.2. Practical demonstration 5.3. Testimonies of good performance and behavior of applicant by supervisor 6. Context of Assessment 6.1. Competency may be assessed individually in the actual workplace or through accredited farms/institutions",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 59 UNIT OF COMPETENCY: RAISE MEAT-TYPE ANIMALS UNIT CODE: AFF621905 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to raising feedlot cattle and buffaloes. It comprises of functions starting from preparation of animals, handling and feeding the feedlot animals including the applying health care until to the completion of tasks. 1. Provide assistance in management of meat-type animals 1.1. Assistance in pre-selection process of meat-type animals are provided following instructions of authority and industry standards. 1.2. Meat-type animals are raised in complete/semi-confinement or under grazing conditions 1.3. Fattening period is determined according to the target market weight. 1.4. Unproductive animals are managed according to the industry standards. 1.5. Assistance in animal husbandry practices are provided following GAHP. 2. Feed animals 2.1. Basal rations both for meat-type animals at various fattening periods are identified and provided based on feeding standard. 2.2. Feed supplements like concentrates, minerals and vitamins are offered according to animal requirements. 2.3. Feeding management for meat-type animals are identified and practiced 2.4. Grazing capacity of the pasture is determined based on established pasture. 3. Apply basic health care 3.1. Sick animals are reported to appropriate authority. 3.2. Assistance is provided during implementation of medication program in accordance with industry standards and instructions of authority. 3.3. Supplementation is done based on medication program. 3.4. Safety practices are observed according to Occupational Safety and Health Standards (OSHS). 4. Perform work to completion 4.1. Breeder for meat-type animals are selected for breeding purposes according to breeds standard. 4.2. Animals are prepared for market disposal following instructions of authority. 4.3. Animal and financial records derived from meat-type animals are updated and kept according to industry standard.",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 60 4.4. Wastes disposal is done according to enterprise protocol and environmental legislations. 4.5. Tools, materials and supplies are maintained and stored according to enterprise procedures. 4.6. Reporting was done to immediate authority following enterprise requirements.",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 61
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 61 RANGE OF VARIABLES VARIABLE SCOPE 1. Unproductive animals 1.1. Average Daily Gain (ADG) is low 1.1.1. Too old 1.1.2. Digestive disorders 1.1.3. Diseased or sick animals 1.1.4. Unthrifty animals 1.1.5. Physically deformed/injured animals 2. Animal husbandry practices 2.1. Castration (surgical or elastrator) 2.2. Deworming 2.3. Dehorning 2.4. Dehooving 2.5. Vaccination 2.6. Disbudding 2.7. Putting identification (ear tagging, branding, etc) 2.8. Shearing 2.9. Medication 3. Feeding management 3.1. Cut and carry 3.2. Continuous grazing 3.3. Rapid Rotational grazing (RRG) 3.4. Combination 4. Records 4.1. Production records 4.2. Finished weight of meat - type animals 4.3. Inventory and consumption records 4.4. Financial and sales records 4.5. Health records 4.6. Mortality and disposal records",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 62
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 62 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1 Provided assistance in management of meat-type animals 1.2 Fed animals 1.3 Applied basic health care 1.4 Performed work to completion 2. Required Knowledge and Attitudes 2.1 Knowledge, Theory, Practices and Systems Operations 2.2.1 Pre-selection process for meat-type animals 2.2.2 Procedures in the preparation of houses 2.2.3 Knowledge of correct feeding and management of growing ruminants meat-type 2.2.4 Implementation of medication program 2.2.5 Culling of unproductive animals 2.2.6 GAHP for raising meat-type animals 2.2.7 Preparation of animals for disposal in market 2.2.8 Disposal of wastes of the operations 2.2.9 OSHS 2.2.10 Record keeping on raising meat-type animals 2.2 Communications 2.2.1 Preparation of inventory reports and production records 2.2.2 Following verbal and written instructions 2.2.3 Updating and keeping of data and records 2.3 Mathematics and Mensuration 2.3.1 Estimation harvest time (meat-type animals) 2.3.2 Computation of harvest recovery (meat-type animals) 2.3.3 Feed conversion efficiency 2.3.4 Space requirements at various stages of growth 2.3.5 Provision of right amount of drugs, vaccines and other biologicals 2.3.6 Profitability of the operation 2.4 Safety Practices 2.4.1 5S implementation 2.4.2 Knowledge in handling biologicals and disinfectants base on manufacturers specifications or VET recommendations 2.4.3 Wearing PPE 2.4.4 Practicing OSHS 2.5 Codes and Regulations 2.5.1 Appropriate legal regulatory body that supervises the animal industry such as BAI and Phil. Animal Health Center (PAHC), DENR 2.5.2 Occupational Safety and Health Standards 2.5.3 Good Animal Husbandry Practices (GAHP) 2.5.4 Animal Welfare Act 2.6 Materials, Tools & Equipment: Uses, Specifications and",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 63
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Animal Production (Ruminants) NCI I Promulgated December 2013 63 Maintenance 2.6.1 Tools and Equipment 2.6.1.1. Can understand and follow instructional manuals 2.6.1.2. Safe keeping of equipment every after use 2.6.2 Materials 2.6.2.1. Where to source good quality supplies, materials and equipment needed in the rearing dairy type animals 2.6.3 Maintenance 2.6.3.1. Regular upkeep of equipment and facilities 2.6.3.2. Preventive maintenance skills 2.7 Values 2.7.1. Diligence 2.7.2. Time consciousness 2.7.3. Honesty in records of sales 2.7.4. Confidence in selecting meat-type animals 2.7.5. Personal integrity in doing routine management practices 2.7.6. Perseverance in executing routine works 2.7.7. Ability to work with others harmoniously 3. Required Skills 3.1. Work safety 3.2. Simple carpentry and masonry skills 3.3. Calculations 3.4. Planning skills 3.5. Communicate effectively 4. Resource Implications 4.1. Farm area and forage site 4.2. Animal house and cage 4.3. Weighing scale and other tools, materials and equipment for raising meat-type animals 4.4. Medication and nutritional requirements 4.5. All workers involved in different activities must be fully oriented and cautioned on the different specific work activities of the farm 4.6. Technical supervisors should have skills and ability in the successful implementation of work program activities 5. Method of Assessment Competency in this unit must be assessed through: 5.1. Passing written exam 5.2. Practical demonstration 5.3. Testimonies of good performance and behavior of applicant by supervisor 6. Context of Assessment 6.1 Competency may be assessed individually in the actual workplace or through accredited farms/institutions",
                "metadata": {
                    "source": "datasets\\raw\\Animal Production (Ruminants) NC II.pdf",
                    "page": 64
                },
                "type": "Document"
            }
        ]
    }
]