[
    {
        "name": "Artificial Insemination (Swine) NC II",
        "core_competencies": [
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 23 CORE COMPETENCIES UNIT OF COMPETENCY: CONFIRM READINESS OF SOW/GILT FOR ARTIFICIAL INSEMINATION UNIT CODE: AGR 621210 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to confirm the readiness of sow/gilt for artificial insemination. It includes validation information on animal and assessing animal condition. ELEMENT PERFORMANCE CRITERIA Italized terms are elaborated in the Range of Variable 1. Validate information on animal 1.1. Information on confirming readiness of sow/gilt for artificial insemination was collected in clear and logical sequence. 1.2. Client’s and animal’s profile are recorded using the prescribed forms and in accordance with standard operating procedures. 1.3. Transactions and coordination is made in accordance to communication etiquette. 1.4. Accurate interpretation and decision is made based on the gathered information. 2. Assess animal condition 2.1 Physical condition of the animal is evaluated based on recommended standards. 2.2 Signs of estrus are confirmed. 2.3 Heat detection is conducted to determine the animal is on standing heat. 2.4 Task is performed without causing injuries to the animal, technician and others. 2.5 Accurate interpretation and decision is made based on the result of the actual heat detection.",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 24
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 24 RANGE OF VARIABLES VARIABLE RANGE 1. Animal profile This includes the following information: 1.1 Identification number (ID number) 1.2 Age/date of birth 1.3 Approximate weight 1.4 Breed/Strain 1.5 Number of parities 1.6 Date of last weaning 1.7 Dam and sire 1.8 Date of last estrus 1.9 Date of last breeding 2. Transactions and coordination This refers to the following: 2.1 Face to face 2.2 Telephone/Cellphone conversation 2.3 Text messaging 3. Communication etiquette This may include, but not limited to: 3.1 Politeness 3.2 Courtesy 3.3 Maintain composure 3.4 Patience 4. Recommended standards This includes the following: 4.1 Body weight 4.2 Body condition score 4.3 Apparently healthy 4.4 Age 4.5 At least 2nd estrus (for gilt) 5. Signs of estrus This includes the following: 5.1 Swelling and redness of vulvar lips 5.2 Frequent urination 5.3 Standing still when mounted 5.4 Mucus discharge from the vagina 5.5 Restlessness 5.6 Loss of appetite 5.7 Mounting other animals 5.8 Number of days in estrus 6. Heat detection This includes the following: 6.1 Back pressure test 6.2 Riding on the back test 6.3 Use of teaser boar 6.4 Use of pheromones (eg. boar saliva, boar semen, synthetic pheromones)",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 25
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 25 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1. Made accurate estrus detection 2. Required Knowledge and Attitudes 2.1 Signs of estrus 2.2 Breeds 2.3 Animal conditions 2.4 Heat detection techniques 2.5 Practicing 5S and 3Rs 2.6 Communication 2.5.1. Preparation of inventory reports, production and performance records. 2.7 Safety practices 2.6.1. Personal protective paraphernalia or device (Rubber boots) 2.8 Breeding calendar 2.9 Codes and Regulations 2.8.1. Animal Welfare Act (RA 8485) 2.8.2. Environmental regulations (waste management act, etc.) 2.9 Attitudes 2.9.1. Punctuality 2.9.2. Personal hygiene 2.9.3. Ability to work well with others harmoniously 3. Required Skills 3.1. Using Personal Protective Equipment 3.2. Arithmetic (Multiplication, Division, Addition and Subtraction) 3.3. Communicate effectively 3.4. Usage of communication equipment 4. Method of Assessment Competency in this unit must be assessed through: 4.1. Oral interview 4.2. Practical demonstration with questioning 4.3. Observation with questioning 4.4. Third party report 4.5. Portfolio 5. Resource Implication 5.1. Practice animals 5.2. Farm facilities 5.3. Rubber boots and scrub suits 5.4. Communication equipment 5.5. Forms 6. Context of Assessment 6.1. Competency may be assessed individually in the actual workplace or through accredited farms/institution.",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 26
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 26 UNIT OF COMPETENCY: COLLECT BOAR SEMEN UNIT CODE: AGR621211 UNIT DESCRIPTOR: This unit covers the outcomes in the preparation and transport of AI equipment, tools, supplies and materials, including hygiene and safety requirements to ensure the integrity and quality of the semen prior to the AI procedure. ELEMENT PERFORMANCE CRITERIA Italized terms are elaborated in the Range of Variable 1. Carry-out preparatory activities 1.1 Boar is cleaned and dried in accordance with the hygiene and safety requirements. 1.2 AI Paraphernalia are prepared according to standard procedure. 1.3 Preparatory activities are performed for semen collection in accordance with the hygiene and safety requirements. 2. Perform collection of boar semen 2.1 Boar is led to the collecting pen 2.2 Preputial fluid is removed according to procedure. 2.3 Penile area is massaged to encourage ejaculation of semen. 2.4 Semen is collected according to standard procedures. 2.5 Semen evaluated to determine semen quality. 2.6 Required form for semen collection is accomplished and filed. 2.7 Semen collection is performed to ensure safety of the boar, technician and other individuals. 3. Handle boar semen for transport 3.1 Collected semen is transferred to pre-warmed semen bottles. 3.2 Semen is properly packed according to required temperature.",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 27
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 27 RANGE OF VARIABLES VARIABLE RANGE 1. AI Paraphernalia This may include, but not limited to: 1.1. Collecting cup 1.2. Semen filter 1.3. Distilled water 1.4. Gloves (Powder-free vinyl and plastic gloves) 1.5. Disposable hand towel 1.6. Neutral pH soap 2. Preparatory activities These refer to the following: 2.1 Wear personal protective paraphernalia (i.e. farm clothes/ and rubber boots) 2.2 Penile area is clean and dry 2.3 Trim sheath hair when necessary 2.4 Wear powder-free vinyl and plastic gloves 2.5 Pre-warm sterilized collecting cups prior to collection (to avoid thermal shock) 2.6 Adjust dummy height 3. Evaluated This includes the following: 3.1. Visually 3.2. Microscopically 4. Semen quality This refers to the following: 4.1 Volume of semen 4.2 Color of semen 4.3 Smell of semen 4.4 Microscopic (sperm motility) 5. Semen bottles This may include, but not limited to: 5.1 Squeeze bottles 5.2 Flexi-tube 5.3 Flat pack 6. Packed This refers to the following methods of handling semen after extraction: 6.1 Wrapped with wet paper or cloth inside ice box without ice (if short distance, that is within 30 minutes travel). 6.2 Put in an ice or styrofoam box with ice (if long distance, that is more than 30 minutes travel). 7. Required form Required form containing data such as: 7.1 Breed and age of boar 7.2 Date of collection 7.3 Semen quality 7.4 Number of doses produced 7.5 Source 7.6 Boar ID 8. Hygiene and safety requirements This refers to the following: 8.1 Personal Hygiene (e.g. no long nails, washing hands with neutral pH soap) 8.2 Discard preputial fluid prior to collection 8.3 Cleanliness and sanitation of collection area",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 28
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 28 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1. Demonstrated semen collection and handling. 2. Required Knowledge and Attitudes 2.1. Frequency of semen collection based on age of boar 2.2. Collection techniques 2.3. Semen quality 2.4. Semen handling 2.5. Animal handling 2.6. Use and function of simple microscope 2.7. Safety precautionary measures on handling boars 2.8. Practicing 5S and 3Rs 2.9. Communication 2.4.1. Preparation of records. 2.10. Safety Practices 2.5.1. Wear rubber boots as safety measure 2.5.2. Wear gloves to prevent zoonotic disease transmission 2.11. Codes and Regulations 2.6.1. Animal Welfare Act (RA 8485) 2.6.2. Environmental regulations (ex. waste management act) 2.12. Attitudes 2.7.1. Agility 2.7.2. Patience 2.7.3. Humane handling of animals 3. Required Skills 3.1. Using Personal Protective Equipment 3.2. Record keeping 3.3. Animal handling skills 3.4. Communication skills 3.5. Using microscope 4. Method of Assessment Competency in this unit must be assessed through: 4.1. Oral interview 4.2. Practical demonstration with questioning 4.3. Observation with questioning 4.4. Third party report 4.5. Portfolio 5. Resource Implication 5.1. Practice Animals 5.2. Microscope 5.3. Farm facilities 5.4. Ice or styrofoam box 5.5. AI paraphernalia and other supplies 5.6. Personal protective paraphernalia and devices 5.7. Forms and logbook 6. Context of Assessment 6.1. Competency may be assessed individually in the actual workplace or through accredited farms/institution.",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 29
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 29 UNIT OF COMPETENCY: PERFORM ARTIFICIAL INSEMINATION ON SOW/GILT UNIT CODE: AGR 621212 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes on the performance of artificial insemination (AI). It includes preparation and deposition of semen and the performing of post-artificial insemination (AI) activities. ELEMENT PERFORMANCE CRITERIA Italized terms are elaborated in the Range of Variable 1. Conduct preparatory activities 1.1. Semen to be used is secured in accordance with clients’ requirements/requests. 1.2. AI paraphernalia is prepared in accordance to established procedures. 1.3. Preparatory activities is performed for AI in accordance with the hygiene and safety requirements. 2. Deposit semen 3.1. Sow/gilt is stimulated prior to AI. 3.2. Semen is deposited into the female reproductive tract following recommended procedure. 3.3. Task is performed without causing injuries to the animal, technician and others. 3. Perform post-artificial insemination (AI) activities 4.1. Cleaning of the external genitalia is performed using suitable materials. 4.2. Wastes disposal is performed according to existing environmental regulations. 4.3. Task is performed without causing injuries to the animal, technician and others 4.4. Clients are advised about the management of animals after AI. 4.5. AI activities are documented using prescribed forms.",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 30
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 30 RANGE OF VARIABLES VARIABLE RANGE 1. AI paraphernalia This may include, but not limited to 1.1. Catheter 1.2. Lubricant 1.3. Semen 1.4. Transport box 1.5. Clean damp cloth or paper towel 2. Preparatory activities This may include, but not limited to: 2.1. Wear rubber boots 2.2. Practice hygienic procedures for AI technician 2.3. Cleaning of vulvar area of sow 2.4. Ensure cleanliness of insemination area 2.5. Pre-warm semen 3. Stimulated This refers to the following techniques: 3.1. Back pressure 3.2. Riding the back 3.3. Use of weights on the back of the sow (such as sandbag, breeding saddle) 3.4. Clitorial stimulation 3.5. Haunch pressure 3.6. Use of pheromones (eg. boar saliva, sex odors, aerosol) 3.7. Semen on snout 4. Environmental regulations This may include but not limited to the following: 4.1. Water 4.1.1. RA 9275 (Clean Water Act) 4.1.2. DAO 1990-35 (Revised effluent regulation) 4.1.3. DAO 2004-25 (Discharge permit) 4.2. Solid 4.2.1. RA 9003 (Ecological Solid Waste Management Act of 2000 IRR RA 9003) 5. Management of animals This includes the following: 5.1. Minimize stress (eg. trauma, movement) 5.2. Proper feeding 5.3. Perform heat detection after 18-24 days 5.4. Humane handling of animals",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 31
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 31 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1. Demonstrated preparation and deposition of semen in the female reproductive tract within the time frame. 2. Required Knowledge and Attitudes 2.1. Procedures of semen preparation and deposition. 2.2. Reproductive system and cycle of swine 2.3. Waste management (ex. 3Rs) 2.4. Practicing 5S 2.5. Communication 2.4.1. Preparation of inventory reports, production and performance records. 2.6. Safety Practices 2.5.1. Personal protective paraphernalia or device 2.5.2. Humane handling of the animal 2.7. Codes and Regulations 2.6.1. Animal Welfare Act (RA 8485) 2.6.2. Environmental regulations 2.8. Values 2.7.1. Punctuality 2.7.2. Personal hygiene 2.7.3. Ability to work well with others harmoniously 3. Required Skills 3.1. Using Personal Protective Equipment 3.2. Arithmetic 3.3. Communication skills 4. Method of Assessment Competency in this unit must be assessed through: 4.1. Oral interview 4.2. Practical demonstration with questioning 4.3. Observation with questioning 4.4. Third party report 4.5. Portfolio 5. Resource Implication 5.1 Practice animals 5.2 Farm facilities 5.3 Artificial Insemination paraphernalia and supplies 5.4 Personal Protective Paraphernalia 5.5 Forms 6. Context of Assessment 6.1 Competency may be assessed individually in the actual workplace or through accredited farms/institution.",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 32
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 32 UNIT OF COMPETENCY: PREPARE DOCUMENTATIONS AND REPORTS ON SOW/GILT ARTIFICIAL INSEMINATION (AI) ACTIVITIES UNIT CODE: AGR 621213 UNIT DESCRIPTOR: This unit covers the required documentation for technicians in the conduct of artificial insemination and related activities. ELEMENT PERFORMANCE CRITERIA Italized terms are elaborated in the Range of Variable 1. Collect and process data 1.1. Necessary forms are secured. 1.2. Data is collected and processed as required in the forms. 1.3. Evidence for breed registry is secured (applicable to technicians of private farms) 2. Accomplish and submit forms 2.1. Forms are accomplished and submitted to the local government unit. 2.2. Summary report is prepared and submitted using required forms. 2.3. File copies of accomplished forms and summary report are kept and compiled by technicians according to required filing procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 33 RANGE OF VARIABLES VARIABLE RANGE 1. Data This refers to the following: 1.1. Date and time of AI 1.2. Boar ID 1.3. Client’s name, address and contact number 1.4. Number of parities 1.5. Breed 1.6. Name of Technician 1.7. Body score 1.8. Litter size and born alive 2. Summary of report This may include, but not limited to: 2.1. Summary of AI service data 2.2. Litter size 2.3. Farrowing rate 2.4. Conception rate",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 34 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1. Demonstrate data collection and processing. 1.2. Made entries to required forms for submission. 1.3. Prepare summary report for submission. 2. Required Knowledge and Attitudes 2.1. Familiarity with all the necessary forms. 2.2. Familiarity with gestation lengths of swine 2.3. Familiarity with breeds of swine 2.4. Knowledge on basic animal husbandry practices 2.5. Practicing 5S and 3Rs 2.6. Systematic, thorough, and prompt in the accomplishment and submission of reports 2.7. Accuracy of data entries in the forms 2.8. Ability to meet deadlines 3. Required Skills 3.1. Basic record-keeping 3.2. Arithmetic (Multiplication, Division, Addition and Subtraction) 3.3. Communication skills 4. Method of Assessment Competency in this unit must be assessed through: 4.1. Oral interview 4.2. Written examination 4.3. Demonstration with questioning 4.4. Third party report 4.5. Portfolio 5. Resource Implication 5.1. Required forms 5.2. Calculator 5.3. Breeding calendars 5.4. Ballpens/Pencils 6. Context of Assessment 6.1. Competency may be assessed individually in the actual workplace or through accredited farms/institution.",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 35 ELECTIVE COMPETENCY UNIT OF COMPETENCY: CONDUCT COMMUNITY AWARENESS PROGRAM ON ARTIFICIAL INSEMINATION UNIT CODE: AGR621214 UNIT DESCRIPTOR: This unit involves the skills, knowledge and attitudes required to conduct community awareness program on artificial insemination to the wider public. It includes competencies in gathering of information, approaching the target clients and promoting artificial insemination. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare for the conduct of community awareness programs 1.1. Community consultation is conducted to ensure that programs meet their needs. 1.2. Coordination with local government and relevant personnel is carried out to determine objectives of the program. 1.3. Programs are structured and finalized with reference to the objectives. 1.4. Relevant equipment, aids and other materials to be used are sourced and organized. 2. Carry-out community awareness programs 2.1. Information on artificial insemination is presented to the target clients in a clear and logical sequence. 2.2. Programs are conducted using effective public speaking techniques. 2.3. Effective approach is used to assist the community in understanding the program. 2.4. Opportunities are provided for the community to seek clarification on important points. 2.5. Routine clients questions are answered and supplemented with relevant information as needed. 2.6. Queries outside the area of responsibility or expertise are referred to appropriate personnel/area. 2.7. Objections and adverse reactions are handled fittingly.",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 36 RANGE OF VARIABLES VARIABLE RANGE 1. Community This may include, but not limited to: 1.1 Individuals  Farmers  Animal enthusiasts/hobbyists  Other interested individuals 1.2 Groups and institutions:  Farmer’s Cooperatives  Community groups  Schools and Training Providers  Local Government Units  Non-government institutions  Private associations 2. Community consultation Community consultation is done: 2.1 To determine community expectations and needs 2.2 To raise community awareness on existing programs 3. Equipment, aids and other materials These may include the following but not limited to: 3.1 Equipment:  video and audio materials  whiteboard  DVD player and monitor 3.2 Aids and materials:  charts and posters  diagrams  handouts  information kits  models (ex. Model of Reproductive tract)  pamphlets  videos 4. Public speaking technique This may include, but not limited to: 4.1 audience interaction 4.2 body language 4.3 eye contact 4.4 inflection 4.5 pace of speech 4.6 tone of voice 5. Approach May include but are not limited to: 5.1 personal visitation 5.2 film viewing/visual presentation 5.3 information materials (eg. Pamphlets) 5.4 over the telephone and text messaging 5.5 demonstration/orientation 6. Routine clients questions Routine clients questions may relate to: 6.1 price 6.2 features 6.3 advantages and benefits",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 37 EVIDENCE PLAN 1. Critical aspects of Competency Assessment requires evidence that the candidate: 1.1 Prepared for the conduct of the community aware 1.2 Carry-out community awareness programs 2. Required Knowledge and Attitudes 2.1. Data collection methods to support the development of materials 2.2. Legislation relevant to the subject matter of the presentation 2.3. Organisational policies and procedures relating to presenting information to the public 2.4. Principles of animal welfare and ethics 2.5. Practicing 5S and 3Rs 2.6. Range of presentation aids and materials available to support the presentation 2.7. Range of communication strategies 2.8. Relevant and current community awareness programs 2.9. Technical information relevant to the presentation or subject matter. 2.10. Attitude  Courtesy  Patience  Innovative  Resourceful 3. Required Skills 3.1. Listening-questioning techniques. 3.2. Verbal and non-verbal communication skills  negotiation techniques.  types and clients needs  handling clients objections 3.3. Public speaking skills to include  opening techniques to awaken clients interest  strategies to focus clients specific needs  answering clients questions  handling customer objections and adverse reactions 3.4. Skills in making simple visual aids (eg. drawing) 4. Resource Implications The following resource MUST be provided: 4.1 a work environment 4.2 relevant documentation, such as procedures manuals 4.3 a range of clients with different requirements 4.4 promotional materials (pamphlets) 4.5 communication equipment (telephone, cellphone) 5. Methods of Assessment Competency may be assessed through: 5.1. Observation 5.2. Demonstration with questioning 5.3. Third-party reports 5.4. Oral questioning/Interview 5.5. Portfolio assessment 6. Context of Assessment 6.1. Assessment may be performed in the workplace or simulated workplace situation 6.2 Assessment activities are carried out through TESDA's accredited assessment center",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 38 UNIT OF COMPETENCY: RENDER ASSISTANCE TO VETERINARY PROCEDURES RELATED TO REPRODUCTIVE PROBLEMS UNIT CODE: AGR621215 UNIT DESCRIPTOR: This unit covers the required knowledge, skills and attitude to perform assistance of veterinary procedures related to swine reproductive problems, through identification, reporting and administering of treatment and preventive procedures under the supervision of a Licensed Veterinarian. ELEMENT PERFORMANCE CRITERIA Italized terms are elaborated in the Range of Variable 1. Recognize swine reproductive problems/diseases 1.1. Forms are secured from veterinarian 1.2. Swine assessment/observation is made and findings are noted on the prescribed forms 1.3. Accomplished forms are submitted to veterinarian. 1.4. Safety precautionary measures are observed using the prescribed PPEs 2. Administer drugs and biologics connected with reproductive problems or disease. 2.1. Recommendations/prescriptions from the veterinarian are obtained 2.2. Drugs and biologics are secured according to veterinarian’s prescription 2.3. Drugs and biologics are administered according to veterinarian’s instructions 2.4. Client are given advice after administration of drugs and biologics 2.5. Veterinarian is given feedback regarding the services rendered 2.6. Daily /Monthly accomplishment report is prepared and submitted using required forms. 2.7. File copies of accomplished forms and summary report are kept and compiled by technicians according to required filing procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 39 RANGE OF VARIABLES VARIABLE RANGE 1. PPE May include the following, but not limited to: 1.1. Rubber boots 1.2. Surgical gloves 1.3. Face mask 2. Drugs and biologics This includes the following: 2.1. Antibiotics 2.2. Vaccines 2.3. Vitamins 2.4. Parasiticides (external and internal) 2.5. Hormones 3. Advice This includes the following: 3.1. Observe after treatment of recommended dose of antibiotics 3.2. Observe adverse reactions after vaccinations 3.3. Observe for response after vitamin administration 3.4. Observe for presence of internal and external parasites after treatment dose.",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR - ARTIFICIAL INSEMINATION (SWINE) 40 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1. Recognized swine reproductive problems/diseases. 1.2. Administered drugs and biologics. 2. Required Knowledge and Attitudes 2.1. Familiarity with all the necessary forms. 2.2. Familiarity with administration techniques of drugs and biologics 2.3. Familiarity with symptoms of swine reproductive problems 2.4. Systematic, thorough, and prompt in the accomplishment and submission of reports 2.5. Practicing 5S and 3Rs 2.6. Accuracy of data entries in the forms 2.7. Ability to meet deadlines 3. Required Skills 3.1. Basic record-keeping 3.2. Arithmetic (Multiplication, Division, Addition and Subtraction) 3.3. Visual estimation of weight 3.4. Skills in administration techniques of drugs and biologics 3.5. Communication skills 4. Method of Assessment Competency in this unit must be assessed through: 4.1. Oral interview 4.2. Written examination 4.3. Demonstration with questioning 4.4. Third party report 4.5. Portfolio 5. Resource Implication 5.1. Required forms 5.2. Veterinary prescription 5.3. Calculator 5.4. Veterinary drugs and biologics 5.5. Veterinary tools (syringe, needles, forceps, etc.) 5.6. PPE (rubber boots, rubber gloves, face mask) 5.7. Ballpens/Pencils 5.8. Practice animals 6. Context of Assessment 6.1. Competency may be assessed individually in the actual workplace or through accredited farms/institution.",
                "metadata": {
                    "source": "datasets\\raw\\Artificial Insemination (Swine) NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            }
        ]
    }
]