[
    {
        "name": "Barista NC II",
        "core_competencies": [
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -29- CORE COMPETENCIES UNIT OF COMPETENCY: PREPARE ESPRESSO UNIT CODE: TRS311399 UNIT DESCRIPTOR: This unit deals with the knowledge and skills of preparing the perfect shot of espresso based on the parameters provided herein. ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 1. Set up and prepare machine and equipment 1.1 Cups are pre-heated in accordance with enterprise standards. 1.2 Portafilter is wiped clean and dry before dosing. 1.3 Grind of coffee is checked. 1.4 Enough coffee is ground for the shot of espresso 1.5 Drip tray is cleaned and dried. 1.6 Rags are prepared and used properly. 2. Dose and Tamp Coffee 2.1 The appropriate amount of ground coffee is dosed in the portafilter. 2.2 Appropriate amount of pressure is applied to tamp the ground beans 2.3 Ground coffee is tamped evenly. 2.4 Portafilter sides and spouts are wiped and cleaned before inserting to the brew head 2.5 Spillage and wastage of ground beans are minimized during dosing and grinding. 3. Extract espresso 3.1 Group head is flushed before inserting the portafilter 3.2 Portafilter is inserted and coffee is brewed immediately 3.3 Volume of espresso is checked 3.4 Extraction time of shot is monitored. 3.5 Crema of shot is inspected. 3.6 Espresso is served or used in a beverage immediately",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 30
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -30- RANGE OF VARIABLES VARIABLE RANGE 1. Grind of coffee May include: 1.1 Course 1.2 Medium 1.3 Fine 1.4 Pulverized 2. Rags May include: 2.1 For portafilter basket 2.2 Steam wand 2.3 Drip tray 2.4 Cups 3. Appropriate amount of ground coffee May be between 7-9 grams for single shot and 14-18 grams for a double shot 4. Appropriate amount of pressure May be between 30-50 lbs pressure 5. Portafilter May include: 5.1 Single spout portafilter 5.2 Double spout portafilter 5.3 Blind portafilter 6. Volume of espresso shot Volume of a shot of espresso may be between .85-1.2 ounce (25-35ml) 7. Extraction time Extraction time of shots is between 20-30 seconds",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 31
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 - 31- EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Pre-heated cups before making the shot of espresso 1.2 Wiped the portafilter clean and dry before dosing 1.3 Dosed the correct amount and tamped coffee properly 1.4 Wiped and cleaned portafilter sides and spouts before inserting to the brew head 1.5 Flushed the group head before inserting the portafilter 1.6 Inserted portafilter and brewed coffee immediately 1.7 Checked volume of espresso 1.8 Monitored extraction time of shot. 1.9 Inspected the crema of the espresso. 1.10 Served or used the espresso immediately 2. Required Knowledge 2.1 Types of coffee grind 2.2 Types of commercially viable coffee beans 2.3 Roast levels 2.4 Espresso extraction 2.5 Parts of an espresso 2.6 Espresso machine parts 3. Required Skills 3.1 Grinder calibration 3.2 Dosing and tamping 3.3 Extracting a perfect shot of espresso 4. Resource Implications The following resources should be provided: 4.1 Commercial espresso machine 4.2 Institutional coffee grinder 4.3 Coffee beans 4.4 Coffee bar tools and supplies (tamper, brush etc.) 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on coffee beans, types of grind, espresso extraction etc 5.2 Practical/Demonstration on extracting a perfect shot of espresso. 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 32
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II\nPromulgated December 2013 - 32- UNIT OF COMPETENCY: TEXTURE MILK\nUNIT CODE: TRS3113100\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required to steam milk which is essential in the preparation of espresso-based beverages with milk like cappuccino and latte. It covers the two stages of steaming milk: foaming and heating, at the desired temperature and consistency.\nELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables\n1. Prepare milk and equipment\n1.1 Milk is chilled in accordance to appropriate temperature.\n1.2 Adequate amount of milk is measured according to the kind of drink to be prepared.\n1.3 Correct (size of) steaming pitcher is selected in accordance with enterprise standards\n1.4 Steaming pitcher is chilled in accordance to appropriate temperature.\n1.5 Steam wand is flushed to remove condensed water.\n1.6 Steam wand is wiped before steaming.\n1.7 Rags for the steam wand are kept clean and moist\n2. Foam milk\n2.1 Steam wand is positioned at the right depth of the milk.\n2.2 Full steam is applied when introducing air into the milk.\n2.3 The sound of air being drawn into the milk is judged/evaluated thru the hissing sound.\n2.4 Milk is stretched according to the desired volume of foam.\n2.5 Milk is converted into microfoam.\n3. Steam milk\n3.1 Steam wand is angled as appropriate to create a whirlpool effect.\n3.2 Milk is spun to achieve the desired consistency.\n3.3 Milk is steamed at the ideal temperature for immediate consumption.\n3.4 Steam wand is shut off some 5 degrees before the desired temperature.\n3.5 Steam wand is flushed and wiped after steaming.\n3.6 Big bubbles are removed by swirling and knocking the pitcher on the counter.",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -33- RANGE OF VARIABLES VARIABLE RANGE 1. Steaming pitcher Size may include: 1.1 10 oz 1.2 12 oz 1.3 20 oz 1.4 32 oz 2. Selection factors May include but not limited to: 2.1 Amount of milk 2.2 Steam pressure/steam capacity of machine 2.3 Steam wand tip 3. Desired volume of foam Volume of milk would have expanded to about: 3.1 1/3 of original volume for latte and 3.2 Doubled for cappuccino 4. Desired consistency 4.1 Silky 4.2 Velvety 4.3 Pouring consistency 4.4 Naturally sweet 4.5 Glossy 4.6 Microfoam bubbles 5. Ideal temperature Ideal temperature for steaming milk is between 140 to 160 degrees Fahrenheit",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -34- EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate. 1.1 Measured the adequate amount of milk according to the kind of drink to be prepared. 1.2 Used chilled milk. 1.3 Selected the correct size of steaming pitcher 1.4 Flushed and wiped the steam wand before and after steaming milk 1.5 Kept rags clean and moist. 1.6 Listened to the sound of air being drawn into the milk. 1.7 Stretched the milk according to the desired volume of foam. 1.8 Steamed the milk to its desired texture 1.9 Steamed the milk at the ideal temperature. 2. Required Knowledge 2.1 Milk types and Chemistry of milk 2.2 Espresso machine parts 2.3 Milk based coffee beverages 3. Required Skills 3.1 Milk texturing and steaming 4. Resource Implications The following resources should be provided: 4.1 Commercial espresso machine 4.2 Institutional coffee grinder 4.3 Coffee beans 4.4 Coffee bar tools and supplies (tamper, steaming pitcher etc.) 4.5 Milk 4.6 Chiller/ref or ice box with ice 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on the step by step procedure of steaming milk; chemistry or composition of milk; its effect on the texture and sweetness of the steamed milk etc. 5.2 Practical/Demonstration on steaming milk 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II\nPromulgated December 2013 - 35 - UNIT OF COMPETENCY: PREPARE AND SERVE COFFEE BEVERAGES\nUNIT CODE: TRS311310 1\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required in the preparation of standard coffee beverages, both hot and cold using the espresso machine and the other brewing methods like syphon, pour over and French press.\nELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables\n1. Take orders of guests\n1.1 Orders are taken and verified with guests or dining service crew.\n1.2 Recommendations are offered to the guest on selection of coffee beverages.\n1.3 General information about the coffee beans are provided to guests\n1.4 Mise-en-place for coffee service is completed according to establishment’s standards and procedures.\n2. Prepare espresso-based beverages\n2.1 Hot and cold espresso-based beverages are prepared according to standard recipes of the establishments.\n2.2 Only good/perfect shots of espresso are served or used in the beverages.\n2.3 Appropriate cups/glasses and accessories are selected according to the beverage ordered.\n2.4 Espresso beverages are served immediately.\n3. Prepare and serve brewed coffee\n3.1 Brewed coffee is prepared according to the brewing method desired by the guest. 3.2 Coffee is brewed according to ideal brewing time of the method\n3.3 Coffee beans are weighed or measured according to brewing method.\n3.4 Brewed coffee is served immediately.",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -36- RANGE OF VARIABLES VARIABLE RANGE 1. Coffee beans information May include: 1.1 Variety 1.2 Origin 1.3 Coffee Blend 1.4 Roast level 1.5 Coffee grind 2. Mis-en-place May include: 2.1 Preparing machine or brewing equipment 2.2 Setting cups, saucers, accessories 2.3 Supplies/condiments 3. Hot and cold espresso-based beverages May include: Hot 3.1 Espresso 3.2 Americano 3.3 Cappuccino 3.4 Café Latte 3.5 Café Mocha Cold 3.6 Mocha Frappe 3.7 Ice Café Latte 3.8 Iced Café Mocha 4. Perfect shot of espresso 4.1 Espresso shot within the parameters: 4.2 Amount of ground coffee: Between 7-9 grams 4.3 Volume: Between 25-35 ml 4.4 Water temperature: Between 195-205 degrees F 4.5 Atm pressure: Between 9-10 bars 4.6 Extraction time: 20-30 seconds 5. Coffee cups/glasses May include: 5.1 Espresso cups/demitasse 5.2 Cappuccino cups 5.3 Latte cups 5.4 Irish glass 5.5 Parfait 6. Brewing method May include: 6.1 French Press/Plunger 6.2 Syphon 6.3 Pourover",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -37- EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Provided general information about the coffee beans to the guest 1.2 Prepared hot and cold espresso-based beverages 1.3 Served beverages immediately 1.4 Brewed coffee with the used of the different brewing methods 2. Required Knowledge 2.1 Coffee growing countries 2.2 Coffee varieties 2.3 Basic espresso beverages 2.4 Brewing methods 3. Required Skills 3.1 Extracting espresso 3.2 Brewing coffee 4. Resource Implications The following resources should be provided: 4.1 Commercial espresso machine 4.2 Institutional coffee grinder 4.3 Coffee beans 4.4 Coffee bar tools and supplies 4.5 Milk 4.6 Brewing equipment 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on espresso and espresso based beverages; brewing methods 5.2 Practical/Demonstration on preparing the basic espresso-based beverages and brewing coffee using the different brewing methods 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 - 38- UNIT OF COMPETENCY : PERFORM BASIC MAINTENANCE OF MACHINES AND EQUIPMENT UNIT CODE : TRS311310 2 UNIT DESCRIPTOR : This unit deals with the knowledge and skills required in the regular maintenance of the espresso machine and other coffee equipment including cleaning and standard operating procedures that must be performed before and after operating the machines and equipment. ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 1. Maintain espresso machine 1.1 Backflushing of espresso is performed according to the type of machine. 1.2 Group head, gasket and porta filters are checked regularly. 1.3 Clean hot water is poured to the drip tray. 1.4 Steam wand is cleaned and wiped with a clean and moist rag. 1.5 Appropriate food grade cleaning chemical is used to backflush and descale espresso machine 1.6 Porta filter and baskets are soaked in hot water to remove oils. 1.7 Group head and screen are brushed at the end of the day. 1.8 Water softener filter is checked regularly. 1.9 Suitable cleaning tools and materials are used to perform maintenance procedures of the machine. 2. Clean doser grinder 2.1 Grounds are brushed off from the bottom and exterior part of the grinder 2.2 Bean hopper is wiped with clean cloth or paper towel or washed in warm water 2.3 The doser chamber or compartment (especially the chute area) is brushed out. 2.4 Grinder blades are checked regularly. 3. Care of small brewing devices 3.1 Small brewers are cleaned right after use in accordance with enterprise standards. 3.2 Small brewers are wiped dried before storage in accordance with enterprise standards. 3.3 Small brewers are stored in their proper places in accordance with enterprise standards. 3.4 Ceramics and glass brewers are washed and soaped after use in accordance with enterprise standards. 3.5 Filters of the small brewing apparatuses are checked for damages.",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 - 39 - RANGE OF VARIABLES VARIABLE RANGE 1. Food grade cleaning chemical May include: 1.1 Capsule form 1.2 Powder form 1.3 Tablet form 2. Cleaning tools and materials May include: 2.1 Grinder brush 2.2 Stiff bristle toothbrush 2.3 Screwdrivers 2.4 Cleaning espresso machine chemical 2.5 Lint-free cloth/rags 3. Grinder blades May include: 3.1 Flat burrs 3.2 Conical burrs 3.3 Blades 4. Damages May include: 4.1 Holes 4.2 Tears 4.3 Clogs 4.4 Worn out",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -40- EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Demonstrated the steps and procedures of backflushing 1.2 Provided information about the parts if the espresso and doser grinder 1.3 Demonstrated screwing and unscrewing back group head screen 1.4 Separated and put parts back of espresso grinder 2. Required Knowledge 2.1 Different types of coffee machines and grinders 2.2 Machine parts 2.3 Grinder parts 2.4 Backflush 2.5 Basic maintenance and troubleshooting 3. Required Skills 3.1 Backflushing 4. Resource Implications The following resources should be provided: 4.1 Commercial espresso machine 4.2 Institutional coffee grinder 4.3 Cleaning tools and materials 4.4 Cleaning chemical 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on espresso cleaning and maintenance 5.2 Practical/demonstration on backflushing and cleaning of group head. 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 - 41- UNIT OF COMPETENCY : PERFORM BASIC CASHIERING AND GENERAL CONTROL PROCEDURES UNIT CODE : TRS3113103 UNIT DESCRIPTOR : This unit deals with the knowledge and skills required to perform basic cashiering function as well as carry out general control procedures including stock/inventory control. ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 1. Operate Electronic Cash register (ECR) or Point of sales system (POS) 1.1 ECR or POS is prepared before operation following standard procedures 1.2 Business transactions are entered and recorded in accordance with enterprise standards. 1.3 Reports are generated at the end of the shift in accordance with enterprise standards. 1.4 New item data are entered into the system in accordance with enterprise standard operating procedures. 1.5 Back up database are made in accordance with enterprise standards. 2. Receive payments 2.1 Cash is received and counted in accordance with enterprise accounting procedures. 2.2 Change is given and counted in front of the guest in accordance with enterprise accounting procedures. 2.3 Receipts/tapes are printed out and given to guest in accordance with enterprise accounting procedures. 3. Handle Change Funds and Petty Cash 3.1 Cash funds are secured in accordance with enterprise standard procedures 3.2 Cash count reports are prepared in accordance with enterprise standard procedures. 3.3 Expenses are monitored and recorded in accordance with enterprise standard procedures. 4. Maintain par stock of items 4.1 Beginning and ending inventory are conducted before and after operations in accordance with enterprise inventory procedures 4.2 Stocks are requested according to enterprise standard procedures 4.3 Issued stock items are checked against requisition documents in accordance with enterprise procedures 4.4 Stock levels are monitored in accordance with par stocking procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -42- RANGE OF VARIABLES VARIABLE RANGE 1. ECR or POS is prepared May include: 1.1 Turning on machine and checking peripherals 1.2 Acquire opening reading or reset of machine 1.3 Put cash (cash fund) into the cash tray 2. Business Transactions May include: 2.1 ordering 2.2 Receiving 2.3 Invoicing 2.4 Sales 3. Reports May include: 3.1 Inventory 3.2 Spoilage 3.3 Void 3.4 Sales 4. Stocks May include: 4.1 Coffee beans 4.2 Milk 4.3 Sugar 4.4 Bar supplies 4.5 Flavored Syrups",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 - 43- EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Demonstrated knowledge on the operation of POS or ECR 1.2 Accomplished reports 1.3 Followed procedures in daily sales reporting 1.4 Followed procedures in securing cash and inventory 2. Required Knowledge 2.1 Standard POS features 2.2 Policies and procedures related to cash handling 2.3 Benefits/uses of POS 2.4 Par stock 2.5 Inventory control 3. Required Skills 3.1 Computer skills 3.2 Accounting skills 3.3 Stocking skills 3.4 Operating ECR or POS 4. Resource Implications The following resources should be provided: 4.1 POS 4.2 Sales reports.forms 4.3 Order slips 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on POS system 5.2 Practical/demonstration on simulated business transaction. 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            }
        ]
    }
]