[
    {
        "name": "Barista NC II",
        "core_competencies": [
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -29- CORE COMPETENCIES UNIT OF COMPETENCY: PREPARE ESPRESSO UNIT CODE: TRS311399 UNIT DESCRIPTOR: This unit deals with the knowledge and skills of preparing the perfect shot of espresso based on the parameters provided herein. ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 1. Set up and prepare machine and equipment 1.1 Cups are pre-heated in accordance with enterprise standards. 1.2 Portafilter is wiped clean and dry before dosing. 1.3 Grind of coffee is checked. 1.4 Enough coffee is ground for the shot of espresso 1.5 Drip tray is cleaned and dried. 1.6 Rags are prepared and used properly. 2. Dose and Tamp Coffee 2.1 The appropriate amount of ground coffee is dosed in the portafilter. 2.2 Appropriate amount of pressure is applied to tamp the ground beans 2.3 Ground coffee is tamped evenly. 2.4 Portafilter sides and spouts are wiped and cleaned before inserting to the brew head 2.5 Spillage and wastage of ground beans are minimized during dosing and grinding. 3. Extract espresso 3.1 Group head is flushed before inserting the portafilter 3.2 Portafilter is inserted and coffee is brewed immediately 3.3 Volume of espresso is checked 3.4 Extraction time of shot is monitored. 3.5 Crema of shot is inspected. 3.6 Espresso is served or used in a beverage immediately",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 30
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -30- RANGE OF VARIABLES VARIABLE RANGE 1. Grind of coffee May include: 1.1 Course 1.2 Medium 1.3 Fine 1.4 Pulverized 2. Rags May include: 2.1 For portafilter basket 2.2 Steam wand 2.3 Drip tray 2.4 Cups 3. Appropriate amount of ground coffee May be between 7-9 grams for single shot and 14-18 grams for a double shot 4. Appropriate amount of pressure May be between 30-50 lbs pressure 5. Portafilter May include: 5.1 Single spout portafilter 5.2 Double spout portafilter 5.3 Blind portafilter 6. Volume of espresso shot Volume of a shot of espresso may be between .85-1.2 ounce (25-35ml) 7. Extraction time Extraction time of shots is between 20-30 seconds",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 31
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 - 31- EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Pre-heated cups before making the shot of espresso 1.2 Wiped the portafilter clean and dry before dosing 1.3 Dosed the correct amount and tamped coffee properly 1.4 Wiped and cleaned portafilter sides and spouts before inserting to the brew head 1.5 Flushed the group head before inserting the portafilter 1.6 Inserted portafilter and brewed coffee immediately 1.7 Checked volume of espresso 1.8 Monitored extraction time of shot. 1.9 Inspected the crema of the espresso. 1.10 Served or used the espresso immediately 2. Required Knowledge 2.1 Types of coffee grind 2.2 Types of commercially viable coffee beans 2.3 Roast levels 2.4 Espresso extraction 2.5 Parts of an espresso 2.6 Espresso machine parts 3. Required Skills 3.1 Grinder calibration 3.2 Dosing and tamping 3.3 Extracting a perfect shot of espresso 4. Resource Implications The following resources should be provided: 4.1 Commercial espresso machine 4.2 Institutional coffee grinder 4.3 Coffee beans 4.4 Coffee bar tools and supplies (tamper, brush etc.) 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on coffee beans, types of grind, espresso extraction etc 5.2 Practical/Demonstration on extracting a perfect shot of espresso. 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 32
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II\nPromulgated December 2013 - 32- UNIT OF COMPETENCY: TEXTURE MILK\nUNIT CODE: TRS3113100\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required to steam milk which is essential in the preparation of espresso-based beverages with milk like cappuccino and latte. It covers the two stages of steaming milk: foaming and heating, at the desired temperature and consistency.\nELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables\n1. Prepare milk and equipment\n1.1 Milk is chilled in accordance to appropriate temperature.\n1.2 Adequate amount of milk is measured according to the kind of drink to be prepared.\n1.3 Correct (size of) steaming pitcher is selected in accordance with enterprise standards\n1.4 Steaming pitcher is chilled in accordance to appropriate temperature.\n1.5 Steam wand is flushed to remove condensed water.\n1.6 Steam wand is wiped before steaming.\n1.7 Rags for the steam wand are kept clean and moist\n2. Foam milk\n2.1 Steam wand is positioned at the right depth of the milk.\n2.2 Full steam is applied when introducing air into the milk.\n2.3 The sound of air being drawn into the milk is judged/evaluated thru the hissing sound.\n2.4 Milk is stretched according to the desired volume of foam.\n2.5 Milk is converted into microfoam.\n3. Steam milk\n3.1 Steam wand is angled as appropriate to create a whirlpool effect.\n3.2 Milk is spun to achieve the desired consistency.\n3.3 Milk is steamed at the ideal temperature for immediate consumption.\n3.4 Steam wand is shut off some 5 degrees before the desired temperature.\n3.5 Steam wand is flushed and wiped after steaming.\n3.6 Big bubbles are removed by swirling and knocking the pitcher on the counter.",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -33- RANGE OF VARIABLES VARIABLE RANGE 1. Steaming pitcher Size may include: 1.1 10 oz 1.2 12 oz 1.3 20 oz 1.4 32 oz 2. Selection factors May include but not limited to: 2.1 Amount of milk 2.2 Steam pressure/steam capacity of machine 2.3 Steam wand tip 3. Desired volume of foam Volume of milk would have expanded to about: 3.1 1/3 of original volume for latte and 3.2 Doubled for cappuccino 4. Desired consistency 4.1 Silky 4.2 Velvety 4.3 Pouring consistency 4.4 Naturally sweet 4.5 Glossy 4.6 Microfoam bubbles 5. Ideal temperature Ideal temperature for steaming milk is between 140 to 160 degrees Fahrenheit",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -34- EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate. 1.1 Measured the adequate amount of milk according to the kind of drink to be prepared. 1.2 Used chilled milk. 1.3 Selected the correct size of steaming pitcher 1.4 Flushed and wiped the steam wand before and after steaming milk 1.5 Kept rags clean and moist. 1.6 Listened to the sound of air being drawn into the milk. 1.7 Stretched the milk according to the desired volume of foam. 1.8 Steamed the milk to its desired texture 1.9 Steamed the milk at the ideal temperature. 2. Required Knowledge 2.1 Milk types and Chemistry of milk 2.2 Espresso machine parts 2.3 Milk based coffee beverages 3. Required Skills 3.1 Milk texturing and steaming 4. Resource Implications The following resources should be provided: 4.1 Commercial espresso machine 4.2 Institutional coffee grinder 4.3 Coffee beans 4.4 Coffee bar tools and supplies (tamper, steaming pitcher etc.) 4.5 Milk 4.6 Chiller/ref or ice box with ice 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on the step by step procedure of steaming milk; chemistry or composition of milk; its effect on the texture and sweetness of the steamed milk etc. 5.2 Practical/Demonstration on steaming milk 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II\nPromulgated December 2013 - 35 - UNIT OF COMPETENCY: PREPARE AND SERVE COFFEE BEVERAGES\nUNIT CODE: TRS311310 1\nUNIT DESCRIPTOR: This unit covers the skills and knowledge required in the preparation of standard coffee beverages, both hot and cold using the espresso machine and the other brewing methods like syphon, pour over and French press.\nELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables\n1. Take orders of guests\n1.1 Orders are taken and verified with guests or dining service crew.\n1.2 Recommendations are offered to the guest on selection of coffee beverages.\n1.3 General information about the coffee beans are provided to guests\n1.4 Mise-en-place for coffee service is completed according to establishment’s standards and procedures.\n2. Prepare espresso-based beverages\n2.1 Hot and cold espresso-based beverages are prepared according to standard recipes of the establishments.\n2.2 Only good/perfect shots of espresso are served or used in the beverages.\n2.3 Appropriate cups/glasses and accessories are selected according to the beverage ordered.\n2.4 Espresso beverages are served immediately.\n3. Prepare and serve brewed coffee\n3.1 Brewed coffee is prepared according to the brewing method desired by the guest. 3.2 Coffee is brewed according to ideal brewing time of the method\n3.3 Coffee beans are weighed or measured according to brewing method.\n3.4 Brewed coffee is served immediately.",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -36- RANGE OF VARIABLES VARIABLE RANGE 1. Coffee beans information May include: 1.1 Variety 1.2 Origin 1.3 Coffee Blend 1.4 Roast level 1.5 Coffee grind 2. Mis-en-place May include: 2.1 Preparing machine or brewing equipment 2.2 Setting cups, saucers, accessories 2.3 Supplies/condiments 3. Hot and cold espresso-based beverages May include: Hot 3.1 Espresso 3.2 Americano 3.3 Cappuccino 3.4 Café Latte 3.5 Café Mocha Cold 3.6 Mocha Frappe 3.7 Ice Café Latte 3.8 Iced Café Mocha 4. Perfect shot of espresso 4.1 Espresso shot within the parameters: 4.2 Amount of ground coffee: Between 7-9 grams 4.3 Volume: Between 25-35 ml 4.4 Water temperature: Between 195-205 degrees F 4.5 Atm pressure: Between 9-10 bars 4.6 Extraction time: 20-30 seconds 5. Coffee cups/glasses May include: 5.1 Espresso cups/demitasse 5.2 Cappuccino cups 5.3 Latte cups 5.4 Irish glass 5.5 Parfait 6. Brewing method May include: 6.1 French Press/Plunger 6.2 Syphon 6.3 Pourover",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -37- EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Provided general information about the coffee beans to the guest 1.2 Prepared hot and cold espresso-based beverages 1.3 Served beverages immediately 1.4 Brewed coffee with the used of the different brewing methods 2. Required Knowledge 2.1 Coffee growing countries 2.2 Coffee varieties 2.3 Basic espresso beverages 2.4 Brewing methods 3. Required Skills 3.1 Extracting espresso 3.2 Brewing coffee 4. Resource Implications The following resources should be provided: 4.1 Commercial espresso machine 4.2 Institutional coffee grinder 4.3 Coffee beans 4.4 Coffee bar tools and supplies 4.5 Milk 4.6 Brewing equipment 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on espresso and espresso based beverages; brewing methods 5.2 Practical/Demonstration on preparing the basic espresso-based beverages and brewing coffee using the different brewing methods 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 - 38- UNIT OF COMPETENCY : PERFORM BASIC MAINTENANCE OF MACHINES AND EQUIPMENT UNIT CODE : TRS311310 2 UNIT DESCRIPTOR : This unit deals with the knowledge and skills required in the regular maintenance of the espresso machine and other coffee equipment including cleaning and standard operating procedures that must be performed before and after operating the machines and equipment. ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 1. Maintain espresso machine 1.1 Backflushing of espresso is performed according to the type of machine. 1.2 Group head, gasket and porta filters are checked regularly. 1.3 Clean hot water is poured to the drip tray. 1.4 Steam wand is cleaned and wiped with a clean and moist rag. 1.5 Appropriate food grade cleaning chemical is used to backflush and descale espresso machine 1.6 Porta filter and baskets are soaked in hot water to remove oils. 1.7 Group head and screen are brushed at the end of the day. 1.8 Water softener filter is checked regularly. 1.9 Suitable cleaning tools and materials are used to perform maintenance procedures of the machine. 2. Clean doser grinder 2.1 Grounds are brushed off from the bottom and exterior part of the grinder 2.2 Bean hopper is wiped with clean cloth or paper towel or washed in warm water 2.3 The doser chamber or compartment (especially the chute area) is brushed out. 2.4 Grinder blades are checked regularly. 3. Care of small brewing devices 3.1 Small brewers are cleaned right after use in accordance with enterprise standards. 3.2 Small brewers are wiped dried before storage in accordance with enterprise standards. 3.3 Small brewers are stored in their proper places in accordance with enterprise standards. 3.4 Ceramics and glass brewers are washed and soaped after use in accordance with enterprise standards. 3.5 Filters of the small brewing apparatuses are checked for damages.",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 - 39 - RANGE OF VARIABLES VARIABLE RANGE 1. Food grade cleaning chemical May include: 1.1 Capsule form 1.2 Powder form 1.3 Tablet form 2. Cleaning tools and materials May include: 2.1 Grinder brush 2.2 Stiff bristle toothbrush 2.3 Screwdrivers 2.4 Cleaning espresso machine chemical 2.5 Lint-free cloth/rags 3. Grinder blades May include: 3.1 Flat burrs 3.2 Conical burrs 3.3 Blades 4. Damages May include: 4.1 Holes 4.2 Tears 4.3 Clogs 4.4 Worn out",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -40- EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Demonstrated the steps and procedures of backflushing 1.2 Provided information about the parts if the espresso and doser grinder 1.3 Demonstrated screwing and unscrewing back group head screen 1.4 Separated and put parts back of espresso grinder 2. Required Knowledge 2.1 Different types of coffee machines and grinders 2.2 Machine parts 2.3 Grinder parts 2.4 Backflush 2.5 Basic maintenance and troubleshooting 3. Required Skills 3.1 Backflushing 4. Resource Implications The following resources should be provided: 4.1 Commercial espresso machine 4.2 Institutional coffee grinder 4.3 Cleaning tools and materials 4.4 Cleaning chemical 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on espresso cleaning and maintenance 5.2 Practical/demonstration on backflushing and cleaning of group head. 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 - 41- UNIT OF COMPETENCY : PERFORM BASIC CASHIERING AND GENERAL CONTROL PROCEDURES UNIT CODE : TRS3113103 UNIT DESCRIPTOR : This unit deals with the knowledge and skills required to perform basic cashiering function as well as carry out general control procedures including stock/inventory control. ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 1. Operate Electronic Cash register (ECR) or Point of sales system (POS) 1.1 ECR or POS is prepared before operation following standard procedures 1.2 Business transactions are entered and recorded in accordance with enterprise standards. 1.3 Reports are generated at the end of the shift in accordance with enterprise standards. 1.4 New item data are entered into the system in accordance with enterprise standard operating procedures. 1.5 Back up database are made in accordance with enterprise standards. 2. Receive payments 2.1 Cash is received and counted in accordance with enterprise accounting procedures. 2.2 Change is given and counted in front of the guest in accordance with enterprise accounting procedures. 2.3 Receipts/tapes are printed out and given to guest in accordance with enterprise accounting procedures. 3. Handle Change Funds and Petty Cash 3.1 Cash funds are secured in accordance with enterprise standard procedures 3.2 Cash count reports are prepared in accordance with enterprise standard procedures. 3.3 Expenses are monitored and recorded in accordance with enterprise standard procedures. 4. Maintain par stock of items 4.1 Beginning and ending inventory are conducted before and after operations in accordance with enterprise inventory procedures 4.2 Stocks are requested according to enterprise standard procedures 4.3 Issued stock items are checked against requisition documents in accordance with enterprise procedures 4.4 Stock levels are monitored in accordance with par stocking procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 -42- RANGE OF VARIABLES VARIABLE RANGE 1. ECR or POS is prepared May include: 1.1 Turning on machine and checking peripherals 1.2 Acquire opening reading or reset of machine 1.3 Put cash (cash fund) into the cash tray 2. Business Transactions May include: 2.1 ordering 2.2 Receiving 2.3 Invoicing 2.4 Sales 3. Reports May include: 3.1 Inventory 3.2 Spoilage 3.3 Void 3.4 Sales 4. Stocks May include: 4.1 Coffee beans 4.2 Milk 4.3 Sugar 4.4 Bar supplies 4.5 Flavored Syrups",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR - Barista NC II Promulgated December 2013 - 43- EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Demonstrated knowledge on the operation of POS or ECR 1.2 Accomplished reports 1.3 Followed procedures in daily sales reporting 1.4 Followed procedures in securing cash and inventory 2. Required Knowledge 2.1 Standard POS features 2.2 Policies and procedures related to cash handling 2.3 Benefits/uses of POS 2.4 Par stock 2.5 Inventory control 3. Required Skills 3.1 Computer skills 3.2 Accounting skills 3.3 Stocking skills 3.4 Operating ECR or POS 4. Resource Implications The following resources should be provided: 4.1 POS 4.2 Sales reports.forms 4.3 Order slips 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on POS system 5.2 Practical/demonstration on simulated business transaction. 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Barista NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Bartending NC II",
        "core_competencies": [
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 29- CORE COMPETENCIES UNIT OF COMPETENCY: CLEAN BAR AREAS UNIT CODE: TRS5123 95 UNIT DESCRIPTOR: This unit deals with the knowledge, skills and attitude required to provide general assistance in maintaining cleanliness of bar area, related equipment and tools. It reflects the role of a “bartender” and/or a bar utility/back and may be part of the role of a bar attendant. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Clean bar, equipment and tools 1.1 Bar surfaces, equipment and tools are cleaned in accordance with industry standard and hygiene regulations 1.2 Working condition of equipment is checked in accordance with manufacturer’s manual and instructions 1.3 Condition of utensils and glassware is checked for dirt and damages 1.4 Broken, cracked items and other waste are safely disposed in accordance with environmental considerations 1.5 Reports are prepared in accordance with establishments policy procedures 1.6 “Closing up” procedures of glassware and other equipment are accomplished based on enterprise standards 2. Clean and maintain public areas 2.1 Identified public areas are promptly cleaned and maintained in accordance with industry and/or enterprise standards 2.2 Empty and unwanted glasses are removed on a regular basis with minimum disruption to customers 2.3 Tables and service counter are cleaned hygienically in accordance with enterprise requirements and standards 2.4 Adherence to customer service is maintained in accordance with industry and/or enterprise standards",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 30
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 30- RANGE OF VARIABLES VARIABLE RANGE 1. Bar surfaces, equipment and tools May include: 1.1 service counters 1.2 service stations 1.3 back bar mirrors 1.4 display counter / shelves 1.5 flooring 1.6 beverage storages 1.7 post mix service points 1.8 refrigeration equipment 1.9 glass washers 1.10 glass racks 1.11 ice maker 1.12 ice bin 1.13 trash bin 1.14 blenders 1.15 fruit juicers / extractors 1.16 coffee machines 1.17 glassware 1.18 food containers for garnishes, chips 1.19 bar tools 1.20 utensils 1.20.1 cutleries 1.20.2 cups and saucers 2. Reports May include: 2.1 Materials inventory 2.2 Breakage report 2.3 Damage report 2.4 Maintenance report 3. Public areas May include: 3.1 bar areas 3.2 restaurant areas 3.3 function areas 3.4 gaming areas",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 31
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 31- EVIDENCE GUIDE 1. Critical aspects of Competency Assessment requires evidences that the candidate: 1.1 Applied workplace operations and procedures 1.2 Maintained the cleanliness and tidiness of bar area 1.3 Performed bar cleaning procedures safely and hygienically 2. Required Knowledge 2.1 Trade theory 2.1.1 Knowledge on bar operations 2.1.2 Logical and efficient work flow 2.2 Safety 2.2.1 Safe work practices and first aid regulations 2.2.2 Hygienic and sanitary practices specific on bar operations 2.2.3 Health Act related to basic hygiene requirements in bar area 3. Required Skills 3.1 Communication skills 3.2 Use of cleaning equipment and chemicals 3.3 Bar tools and equipment operations including glass washer and coffee maker 3.4 Time management skills 4. Resource Implications The following resources should be provided: 4.1 Workplace location 4.2 Access to a range of bar cleaning equipment, tools and materials / chemicals 4.3 Access to a fully equipped bar including current industry equipment and tools 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Demonstration of the proper operation of the appropriate cleaning equipment 5.2 Written or oral questions to test knowledge on proper hygiene and procedures in maintaining cleanliness of the bar 5.3 Review of portfolios of evidence relevant to legislation and OH&S issues and third-party reports to evaluate on-the-job and/or workplace performance by the candidate 6. Context of Assessment 6.1 Fully-equipped workplace or simulated environment with current bar tools, equipment and materials / products (assessment centers) 6.2 TESDA accredited assessment center/venue with expert and accredited assessor.",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 32
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 32- UNIT OF COMPETENCY: OPERATE BAR UNIT CODE: TRS5123 96 UNIT DESCRIPTOR: This unit covers the skills and knowledge required to carry out bar operations. It includes preparing bar for service, taking drink orders, serving drinks, maintaining bar control procedures, closing the bar and dealing with intoxicated persons in all Food and Beverage Service providers, except for “Specialty Coffee Shops”. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare bar for service 1.1 Basic parts of the bar are identified according to service operation requirements. 1.2 Bar display and work area are set up in accordance with industry and/or enterprise requirements and bar service style 1.3 Bar products and materials are checked and re-stocked in accordance with industry and/or enterprise policy and procedures 1.4 All obtained items are stored in accordance with established storing procedures and techniques 1.5 Suitable kinds of decorations, coasters, edible and non-edible garnishes are prepared in accordance with industry and/or enterprise requirements 1.6 Appropriate ice supplies are prepared in accordance with enterprise volume requirement for a days’ operation. 1.7 Necessary Bar tools, equipment and utensils are checked and ready for service operation. 2. Take drink orders 2.1 Product and brand preferences are checked with the customer courteously 2.2 Selection of drinks are politely recommended to customer in accordance with enterprise policy and procedures 2.3 Specific customer preferences are identified in accordance with orders taken 2.4 Customer’s order are promptly recapped in accordance enterprise service standard policy 3. Serve drinks 3.1 Ordered drinks are promptly and courteously served, in accordance with customer preferences, using required glassware and garnishes 3.2 Alcoholic and non-alcoholic beverages are served according to customer preferences 3.3 Waste and spillage are avoided 3.4 Beverage quality is checked during service and corrections are made if necessary 3.5 Beverage and service issues are reported promptly to the appropriate person in accordance with industry and/or enterprise policy 3.6 Drinks are served using service tray, where appropriate in accordance with enterprise procedures 3.7 Proper handling of glassware are observed at all times 3.8 Any unexpected situations are attended to promptly and safely in accordance with industry.",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 33- ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables and/or enterprise policy 4. Deals with customers affected with alcohol 4.1 Responsible service of alcohol is practiced in accordance with relevant legislations and licensing requirements 4.2 Behavioral warning signs of intoxication are identified, recognized and monitored 4.3 Intoxicated persons are dealt with courteously and promptly in accordance with the enterprise service policy and guidelines 4.4 Intoxicated customers are refused service of alcoholic beverage in a diplomatic and suitable manner 4.6 Where practicable, appropriate food and non-alcoholic beverages are offered to intoxicated persons 4.7 Intoxicated customer misdemeanor are recorded in appropriate record book for future guest service reference 5. Maintain proper bar operation control procedures 5.1 Opening and ending inventory are performed according to enterprise prescribed form and operating procedures 5.2 Order slip are checked and taken according to enterprise operating policy 5.3 POS system procedures are observed according to enterprise standard policy, when necessary 5.4 Order count are recorded in accordance with the enterprise standard form and policy 5.5 Appropriate control system forms are used, when necessary 5.6 Proper par stock level is maintained at all time. 5.7 Replenishment of consumed items is performed. 6. Close/turn over bar operations 6.1 Beverage display are kept and set up of bar area are removed and cleaned in accordance with industry and/or enterprise procedures 6.2 Leftover garnishes suitable for next-day operations are hygienically stored at recommended temperature 6.3 Materials, tools and glasses are properly kept in suitable cabinets 6.4 Stocks are checked and replenished in accordance with industry and/or enterprise procedures 6.5 When appropriate, equipment are shut down in accordance with enterprise safety procedures and manufacturer’s instructions 6.6 Bar set up and stocks are maintained for the next shift of service, ensuring equipment and glasses are in the correct place, whenever necessary 6.7 Turnover of bar operations to the next shift is done in accordance with enterprise procedure 6.8 Bar service concerns and issues are properly recorded in the enterprise communication logbook for information and appropriate action",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 34- RANGE OF VARIABLES VARIABLE RANGE 1. Bar Areas May include: 1.1 Front bar area 1.2 Back bar area 1.3 Under bar area 1.4 Bar floor area 1.5 Bar storage 2. Bar service 2.1 Must include the service of a variety drinks including: 2.1.1 Mixed drinks and cocktails 2.1.2 Beers 2.1.3 Spirits 2.1.4 Wines 2.1.5 Non-alcoholic beverages 2.2 May include set-up requirements and procedures for: 2.2.1 inclusive packages 2.2.2 cash bar 2.2.3 set limits 2.2.4 pre-set drinks 2.2.5 open bar 3. Bar products and materials May include: 3.1 different types of alcoholic and non-alcoholic beverages 3.2 flavored syrups 3.3 garnishes, both edible and non-edible 3.4 accompaniments 3.5 serviettes 3.6 coasters 3.7 bar towels 3.8 Bar mats 3.9 Stirrers 3.10 Straws 3.11 Fruit picks 3.12 display items including brochures, bar menus, price lists and other promotional materials 4. Alcoholic beverages May include: 4.1 Distilled spirits 4.1.1 whiskies (scotch, american, canadian, irish, japanese) 4.1.2 brandies / cognacs 4.1.3 rums 4.1.4 vodkas 4.1.5 tequilas 4.1.6 lambanog (other locally made spirits)",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 35- VARIABLE RANGE 4.2 Compounded 4.2.1 gins 4.2.2 liqueurs/cordials 4.3 Fermented 4.3.1 Beer 4.3.2 Wines 4.3.2.1 Wines (Imported) 4.3.2.1.1 Still or natural wine 4.3.2.1.1.1 white wine 4.3.2.1.1.2 red wine 4.3.2.1.1.3 rose wine 4.3.2.1.1.4 blush wine 4.3.2.1.2 Sparkling wines 4.3.2.1.3 Fortified wines 4.3.2.1.4 Aromatic wines 4.3.2.2 Wines (local) 4.3.2.2.1 Rice wines 4.3.2.2.2 Assorted Fruit wines 5. Non-alcoholic beverages May include: 5.1 tea 5.2 coffee 5.3 milk 5.4 carbonated drinks / sodas 5.5 Fruit juices 5.6 Fruit purees 5.7 bottled waters 5.8 energy drinks 6. Ice Supplies May include: 6.1 Cleaned tube ice 6.2 Cleaned cube ice 6.3 Cracked ice 6.4 Cleaned shaved / crushed ice 7. Specific customer preferences May include: 7.1 Ice 7.2 Garnishes 7.3 Glassware 7.4 Mixers 7.5 Temperature 7.6 Alcoholic Strength 8. Control system forms May include: 8.1 Inventory Form 8.2 Order Slip 8.3 Full Bottle Sales Report 8.4 Inter Bar/Outlet Form 8.5 Requisition Forms 8.6 Spoilage Report Form 8.7 Bin Cards",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 36- VARIABLE RANGE 9. Equipment and utensils May include: 9.1 blenders, juicers and shakers 9.2 Coffee Brewing Equipment 9.3 Cleaning Equipment 9.4 Refrigeration Equipment 9.5 Glass Washers 9.6 Beer Dispensing System 9.7 Post Mix Systems 9.8 Ice Machines 9.9 Manual And Electronic Cash Registers, Credit Card and POS Equipment 9.10 Utensils 9.10.1 Cutleries 9.10.2 Cups and saucers 10. Bar service concerns May include: 10.1 Incident report 10.2 Guest comments 10.3 Items for maintenance and repair 11. Unexpected situations May include: 11.1 Spillages 11.2 Breakages 11.3 Unruly customers 12. Behavioral signs of intoxication May include: 12.1 Relaxing of inhibition 12.2 Slowing of reaction 12.3 Impairment of judgment 12.4 Decrease in coordination 12.5 Mumbling or incomprehensible speech",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 37- EVIDENCE GUIDE 1. Critical aspects of Competency Assessment requires evidences that the candidate: 1.1 Applied workplace operations and procedures 1.2 Set up and operated bar in accordance with established procedures and systems 1.3 Used accurate measures and appropriate glassware and garnish for drinks 1.4 Served a variety of standard drinks, both alcoholic and non-alcoholic 1.5 Served alcohol in accordance with the provisions of relevant legislations, licensing requirements and responsible alcohol service 1.6 Demonstrated enterprise standard procedures in making beverage inventory system 1.7 Closed/turned-over bar operations to next shift 2. Required Knowledge and Attitude 2.1 Trade theory 2.1.1 Different types of bars and bar service 2.1.2 Proper uses of different bar equipment and tools 2.1.3 Variety of beverage products and an overview of commonly requested drinks 2.1.4 Types, origins, nature and characteristics of the different alcoholic beverages (wines, spirits, beers, etc) 2.1.5 Types and characteristics of non-alcoholic beverages and its respective flavors 2.1.6 Serving techniques for different types of beverages and Cocktails 2.1.7 Bar operation control procedures and POS system 2.2 Tools 2.2.1 Tools and equipment specifications and uses 2.3 Safety 2.3.1 Safe work practices and first aid regulations 2.3.2 Hygienic practices specific to bar operations national/local government laws related to service of alcohol 2.3.3 Waste minimization and environmental considerations 3. Required Skills 3.1 Communication skills 3.2 Preparation and service techniques 3.3 Proper selling techniques 3.4 Showmanship skills 3.5 Time management 3.6 Opening and serving beverage techniques",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 38- 4. Resource Implications The following resources should be provided: 4.1 Access to workplace location 4.2 Access to a fully-equipped bar including current industry equipment 4.3 Work activities under industry-realistic conditions 4.4 Access to different beverage products and service under industry-realistic conditions 4.5 Materials relevant to the proposed activities and tasks 4.6 Access to different types of bar control forms 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Observation on the proper set up of the bar including classification of alcoholic beverages, glasses and proper service of beverage 5.2 Demonstration on the classification of beverage and preparation of garnish presentations 5.3 Written and/or oral questions on general knowledge on beverage products, material and appropriate characteristics and service procedures 5.4 Third-party report from the supervisor and/or competent employer’s representative on the candidate's actual work performance 5.5 Portfolio of relevant subjects attended 6. Context of Assessment 6.1 Assessment may be done in a fully-equipped workplace or in a simulated workplace setting with current bar tools, equipment and materials/products (assessment centers) 6.2 Assessment activities are carried out through TESDA’s accredited assessment center with accompanying expert and accredited assessor",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 39- UNIT OF COMPETENCY: PREPARE AND MIX COCKTAILS AND NON-ALCOHOLIC CONCOCTIONS UNIT CODE: TRS5123 97 UNIT DESCRIPTOR: The unit deals with the knowledge and skills required to prepare and mix different types of cocktails and non-alcoholic concoctions in all food and beverage service providers, except for “Specialty Coffee Shops”. It includes the proper use, cleaning and maintaining tools and equipment and machineries for mixing drinks. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare and mix a range of cocktails 1.1 Classification of alcoholic beverages are determined according to ingredients used, process and characteristics 1.2 Non-alcoholic beverages and mixers used as modifiers are identified in accordance with the flavoring ingredients and process forms 1.3 Different types of bar tools and equipment are identified and used in accordance with manufacturer’s manual and instruction 1.4 Different types of glasses are identified and handled in accordance with enterprise standard and sanitary practices 1.5 Ice supplies are prepared and used according to hygiene and sanitary practices 1.6 Appropriate mixing methods and procedures are applied based on international standards 1.7 Necessary garnish, edible and non-edible fruits and vegetables are prepared and used based on cocktail presentation 1.8 Different categories of cocktails are identified according to international standard 1.9 Cocktail recipes are mixed using appropriate method and established international standard within the required time frame and customer reference 1.10 Specialty drink concoction are prepared and mixed in accordance with industry and/or enterprise recipe and service procedure 1.11 Appropriate product substitutes for out of stock liquor ingredients are utilized based on appropriate product standard 1.12 Broken and chip glasses are identified and removed 1.13 Occupational health and sanitary practices in mixing cocktails are observed according to enterprise standard procedures 1.14 Safety practices in using mechanical equipment are observed according to manufacturers guidelines 2. Prepare and mix a variety of non-alcoholic concoctions 2.1 Non-alcoholic beverages are identified in accordance with industry standard classification 2.2 Modifiers in flavored syrups and other forms are identified in accordance with ingredients used and process 2.3 Edible fruits and vegetables used in mixing non-alcoholic cocktails are determined and prepared according to enterprise standards.",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 40- ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 2.4 Ingredients, equipment and tools are prepared prior to service 2.5 Appropriate name and style of non-alcoholic drinks are properly identified according to customer request 2.6 Correct ingredients are selected and mixed in accordance with enterprise service practice 2.7 Drinks are prepared appropriately in accordance with standard recipe and required time frame 2.8 Correct glasses and garnish are used attractively where appropriate 2.9 Occupational health and sanitary practices are observed in mixing drinks according to enterprise operating procedures 2.10 Safety practices in using mechanical equipment are observed according to manufacturer's guidelines 3. Use, clean and maintain bar tools and equipment and machineries for mixing cocktails and non-alcoholic concoctions 3.1 Bar tools are used and cleaned immediately after using in accordance with industry and/or enterprise safety and sanitary procedures 3.2 Equipment and machineries are used in accordance with manufacturer's specifications and hygiene/safety requirements 3.3 Machineries and equipment are maintained in accordance with maintenance schedule and manufacturer's specifications 3.4 Problems are promptly identified, reported to and acted upon immediately",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 41- RANGE OF VARIABLES VARIABLE RANGE 1. Alcoholic beverage May include: 1.1 Distilled spirits 1.1.1 whiskies (scotch, american, canadian, irish, japanese) 1.1.2 brandies / cognacs 1.1.3 rums 1.1.4 vodkas 1.1.5 tequilas 1.1.6 Lambanog (other locally made spirits) 1.2 Compounded 1.2.1 Gins 1.2.2 liqueurs/cordials 1.3 Fermented 1.3.1 Beers 1.3.2 Wines (Imported) 1.3.2.1 Still or natural wine 1.3.2.1.1 white wine 1.3.2.1.2 red wine 1.3.2.1.3 rose wine 1.3.2.1.4 blush wine 1.3.2.2 Sparkling wines 1.3.2.3 Fortified wines 1.3.2.4 Aromatic wines 1.3.3 Wines (local) 1.3.3.1 Rice wines 1.3.3.2 Assorted Fruit wines 2. Non-alcoholic beverages and mixers May include: 2.1 Fruit Juices 2.2 Fruit Purees 2.3 Sodas / carbonated drinks 2.4 Mineral water 2.5 Distilled water 2.6 Milk / creams 2.7 Energy drinks 2.8 Syrups 3. Flavored syrups May include: 3.1 Fruit Flavors 3.2 Citrus Flavors 3.3 Single and mixed Herbs Flavors 3.4 Bean and kernel Flavors",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 42- VARIABLE RANGE 4. Bar tools May include: 4.1 Chopping board 4.2 Jigger 4.3 Fruit Juicer / squeezer 4.4 Bar spoon 4.5 Bar spill mat 4.6 Bar caddy 4.7 Decanter 4.8 Bar Strainer (Hawthorn) 4.9 Cork screw with foil cutter 4.10 Cocktail Shakers 4.11 Bottle and can opener 4.12 Mixing glass 4.13 Tin can 4.14 Canulator 4.15 Straw dispenser 4.16 Ice bucket 4.17 Ice scooper 4.18 Pitcher 4.19 Ice tong 4.20 Ice Pick 4.21 Speed pourer 4.22 Funnel 4.23 Bar knife 4.24 Fruit molder 4.25 Muddler 4.26 Juice jugs 4.27 Measuring Cup 4.28 Garnish dispenser 4.29 Cocktail/Bar tray 4.30 Wine bucket 4.31 Wine basket 4.32 Wine stopper/ re-sealer 4.33 Glass-rimmer 4.34 utensils 4.34.1 cutleries 4.34.2 cups and saucers 5. Bar equipment May include: 5.1 Ice bin 5.2 Speed rail 5.3 Electric Blender 5.4 Post mix system 5.5 Glass chiller 5.6 Underbar s’ refrigerator 5.7 Wine chiller 5.8 Electric mixer 5.9 Wine Humidor 5.10 Glass brushes",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 43- VARIABLE RANGE 5.11 Beer dispenser 5.12 Mechanical Glass washer 5.13 Soda gun 5.14 Fruit extractor 5.15 Ice crusher 6. Glasses May include: 6.1 stem wares 6.2 footed wares 6.3 tumblers 6.4 mugs 6.5 Specialty designed glass 7. Ice Supply May include: 7.1 Cleaned tube ice 7.2 Cleaned cube ice 7.3 Cracked ice 7.4 Cleaned shaved / crushed ice 8. Mixing Methods and Procedures May include: 8.1 to build 8.2 to shake 8.3 to stir 8.4 to blend 8.5 to muddle 9. Categories of cocktails May include: 9.1 Pre-dinner 9.2 After dinner 9.3 Long drinks 9.4 Fancy drinks 9.5 Sparkling drinks 10. Garnishes May include: 10.1 Fresh and unblemished 10.1.1 Vegetables 10.1.2 Fruits 10.1.3 Herbs 10.1.4 spices 10.2 Preserved fruits and vegetables 10.2.1 red cherries 10.2.2 green olives 10.2.3 cocktail onions 10.2.4 other preserved fruits 11. Cocktail recipes May include: 11.1 Name of the Cocktail 11.2 Ingredients 11.3 Measurements 11.4 Proper procedures 11.5 Appropriate glass 11.6 Appropriate garnish",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 44- EVIDENCE GUIDE 1. Critical aspects of Competency Assessment requires evidences that the candidates: 1.1 Applied workplace operations and procedures 1.2 Prepared materials, equipment/utensils, glasses and garnishes for mixing drinks 1.3 Prepared and mixed a variety of internationally-known cocktails and non-alcoholic concoctions according to specific industry standards 1.4 Prepared quantities of cocktails and non-alcoholic mixed drinks according to acceptable timeframe 2. Required Knowledge and Attitude 2.1 Trade theory 2.1.1 Types, origins, nature and characteristics of different alcoholic beverages (wines, spirits, beers, etc) 2.1.2 Types and characteristics of non-alcoholic beverages and its respective flavors 2.1.3 Alcoholic and non-alcoholic ingredients of Cocktails 2.1.4 Recipes of popular international standard Mix drinks 2.1.5 Mixing tools and equipment specifications and uses 2.1.6 Glassware and garnitures required for different types of cocktails 2.1.7 Serving techniques for different types of beverages, cocktails and non-alcoholic concoctions 2.2 Mathematics 2.2.1 Portion and control 2.3 Safety 2.3.1 Safe work practices and first aid regulations 2.3.2 Workplace safety environment 2.3.3 Hygienic and sanitation practices 2.4 Safe/Territory Act related to alcohol service 3. Required Skills 3.1 Communication skills 3.2 Proper preparation and mixing procedures 3.3 Presentation methods for different cocktails 3.4 Garnish preparation creativity 3.5 Showmanship skills 3.6 Time Management 3.7 Opening and serving beverage techniques",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 45- 4. Resource Implications The following resources should be provided: 4.1 Access to workplace location 4.2 Access to relevant tools, equipment/utensils and glassware 4.3 Standards that would allow the candidate to demonstrate and apply knowledge of specific cocktail recipes and non-alcoholic concoction 4.4 Materials relevant to the proposed activities and tasks 4.5 Access to different beverage products and service under industry-realistic conditions 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Observation shall be done on the proper classification of alcoholic beverages and glasses; proper mixing procedures on several cocktails and the uses and maintenance of different bar tools and equipment 5.2 Demonstration of skills on mixing different (in quantity) international cocktails in a prescribed timeframe; utilizing systematic liquor pouring and proper bar measurement; mixing of non-alcoholic concoction showmanship skill techniques 5.3 Written or oral questions on beverage products, their characteristics and materials used in preparing and serving beverages 5.4 Third-party report on some relevant criteria from the supervisor and/or competent employer’s representative on the candidate's actual work performance 5.5 Portfolio of relevant subjects being attended 6. Context of Assessment 6.1 Assessment may be done in a fully-equipped workplace or in a simulated workplace setting with current bar tools, equipment and materials/products (assessment centers) 6.2 Assessment activities are carried out in TESDA’s accredited assessment center with accompanying expert and accredited assessor",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 46- UNIT OF COMPETENCY: PROVIDE BASIC WINE SERVICE UNIT CODE: TRS5123 98 UNIT OF DESCRIPTOR: This unit deals with the skills and knowledge on providing wine service. It focuses on basic knowledge on wines; its attributes and characteristics, proper presentation and opening, serving, and the ability to further develop and update wine knowledge. It may apply to a Bar Supervisor, Bartender and Food & Beverage Attendant. The essential knowledge base for this unit will vary according to industry need. Training must reflect the in-depth of knowledge required to meet the specific requirements of industry employers. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Explain different types of wines to customer 1.1 Wine list is presented to customer in accordance with industry and/or enterprise established service procedures. 1.2 Appropriate wine types, names, characteristic, origin and or regions are explained to guest 1.3 Proper wine making process and storage are explained to customer, when necessary 1.4 Appropriate wine labels and terminologies are properly interpreted 1.5 Customers are assisted in selecting wine according to his/her taste 2. Recommend appropriate wine and food combinations to customers 2.1 Compatible wine and food combinations are recommended based on customer's preferences 2.2 Appropriate wine for special occasions are recommended based on customer's needs 2.3 Special/featured wines of the month are recommended in accordance with enterprise policy 3. Prepare wine, glasses and accessories for service 3.1 Necessary order slip is prepared according to establishment's procedures 3.2 Wine is carefully taken out from the cellar/storage 3.3 Wine is presented to the customer according to established industry wine service procedures 3.4 Appropriate glassware is set up according to established industry service and hygienic practices 3.5 Appropriate wine service accessories are prepared",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 47- ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 4. Open and serve wine 4.1 Customer is queried as to when to open the wine 4.2 Wine bottle is opened according to industry standard opening procedures 4.3 Small amount of wine is poured to the glass for guest’s tasting and approval 4.4 Sensory evaluation of wine is performed, if necessary 4.5 Faulty wine is replaced with new one should the guest disapproved its taste 4.6 Wine is served to the guest according to established industry service procedures 4.7 Multiple wine service sequence is applied according to established industry service procedures, when necessary 4.8 Customers' glass is refilled, when necessary 4.9 Additional wine order is inquired politely from the host, when needed 4.10 Used and empty glasses are cleared according to sanitary and safety procedures. 5. Check wine for faults 5.1 Cork is inspected for any faults 5.2 Wine is examined for clarity and limpidity 5.3 Wine is smelled for any possible fault 5.4 Sensory evaluation of wine is performed, if necessary 5.5 Small amount of wine is tasted to identify other fault 5.6 Basic faults of wine are recognized and reported",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 48- RANGE OF VARIABLES VARIABLE RANGE 1. Wine sensory evaluation May include: 1.1 Sight, to check the wine for clarity and brightness/intensity in terms of shade or color. 1.2 Smell or nose, for aroma and bouquet 1.3 Taste component, bitter, spicy, salty and sweet 2. Wine types May include: 2.1 Still / Natural Wines 2.1.1 Red wine 2.1.2 White wine 2.1.3 Rosé wine 2.1.4 Blush wine 2.2 Sparkling wines 2.3 Fortified wines 2.4 Aromatized wines 3. Wine making process and storage May include: 3.1 viticulture (vine growing) 3.2 vinification (wine making) 3.3 proper storing 3.4 proper handling 4. Compatibility of wines with different food items May include: 4.1 White wine with white meat 4.2 Red wine for red meat 4.3 Sparkling wines with any types of Food 4.4 Fortified wines with appetizer and/or dessert 4.5 Aromatized wines with appetizer 5. Names of wines May include: 5.1 Generic name of wines 5.2 Varietal name of wines 5.3 Branded name of wines 5.4 Place of origin wine names 6. Characteristics of wine May include: 6.1 sweetness 6.2 dryness 6.3 bitterness 6.4 tartness 6.5 saltiness 6.6 acidity 6.7 freshness 6.8 fruitiness",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 49- VARIABLE RANGE 6.9 flowery 6.10 spiciness 6.11 woodiness 6.12 yeasty 6.13 crispiness 6.14 full-bodied 6.15 light-bodied 7. Multiple wine service sequence May include: 7.1 Light before full bodied 7.2 Dry before sweet 7.3 Young before old 7.4 Dry white before red 8. Special occasion where wine could be offered May include: 8.1 Birthday Party 8.2 Anniversary 8.3 Reception 8.4 New Year 8.5 Baptismal 8.6 Victory celebration 9. Appropriate glassware 9.1 White wine glass for white wine 9.2 Red wine glass for red wine 9.3 Champagne glass for sparkling wine 9.4 Sherry / Port wine glass for Fortified wines 9.5 All Purposed wine glass for any types of wines 10. Wine service accessories May include: 10.1 Corkscrew with foil cutter 10.2 Wine bucket with stand 10.3 Wine basket 10.4 Wine decanter / carafe 10.5 Table napkins 10.6 Wine Stopper/re-sealer 11. Wine Faults May include: 11.1 Dried cork 11.2 Defaced wine labels 11.3 Heavy sediments/deposits 11.4 Musty or foul odor 11.5 Loose cork 11.6 Rotten cork 11.7 Vinegary 11.8 Chipped bottle",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 50- EVIDENCE GUIDE 1. Critical aspects of Competency Assessment requires evidences that the candidate: 1.1 Updated and maintained basic and relevant knowledge on wines and apply them in the workplace 1.2 Interpreted relevant information on wine labels and terminologies. 1.3 Recommended appropriate wine combination to a particular food item 1.4 Answered customer queries on general information about wines 1.5 Merchandised wine that is suitable and pleasing to the customer 1.6 Demonstrated established standard technique in opening wine 1.7 Demonstrated established procedures in serving wine according to types of wine 2. Required Knowledge 2.1 Structure, history, health benefits and trends related to wines 2.2 Characteristic of wines including: 2.2.1 Different wine types and their styles 2.2.2 Different production methods 2.2.3 Label terminology and interpretation 2.2.4 Wine producing countries and regional variations 2.2.5 Principal grape varieties used in the production of different wine types 2.2.6 Applicable wine classifications that govern production in the old and new world wine countries 2.3 Variations in wine production techniques include: 2.3.1 White wine processes e.g. Fermentation without skins Additional clarification process before and after fermentation process, pressing, malolactic fermentation, oak usage, etc. 2.3.2 Red wine processes e.g. Fermentation of with the skins, maceration techniques such as pumping over, plunging down, heading down and rotary fermenting vat 2.3.3 Rosé wine e.g. Partial fermentation with skins 2.3.4 Sparkling wines e.g. with second fermentation of different process, as méthode champenoise / tradicionale, transfer process, tank fermentation, carbonation/ impregnation 2.3.5 Fortified wines e.g. Different processes applied to different types with addition of brandy before or after fermentation. Fino/Oloroso Sherry, Port and Madeira, Marsala 2.3.6 Aromatized wine e.g. addition of aromatic herbs and spices e.g. Sweet/Dry Vermouth, Bitter, Anise 2.4 Impact of the wine production techniques to the style and taste of wine 2.5 Key structural components of wine including 2.5.1 Alcohol 2.5.2 Tannin 2.5.3 Acid 2.5.4 Sugar 2.5.5 Fruit flavor",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR-Bartending NC II (Amended) Promulgated December 2013 - 51- 2.6 Factors affecting the style and quality of wine 2.7 Guidelines for successful wine and food matching including: 2.7.1 Commonly known food and wine Marriages 2.7.2 Using wine in cooking 2.7.3 Interaction of primary flavors of food and wine 2.7.4 Wines for seasons and social occasions 2.8 Requirements of the applicable laws related to responsible service of alcohol. 2.9 International trends in wine style and production methods 2.10 Knowledge on wine tasting terminologies 3. Required Skills 3.1 Indicators of wines quality, analysis and diagnosis of wine faults and impairments 3.2 Proper opening techniques of wine bottle 3.3 Wine service techniques including serving aged wines and processes for decanting wine 3.4 Suggestive wine pairing and selling techniques 3.5 Specialized wine sensory evaluation techniques 3.6 Cork troubleshooting 3.7 Good grooming and hygienic practices relevant to beverage service. 4. Resource Implications The following resources should be provided: 4.1 Standards that would allow the candidate to demonstrate and apply knowledge on wine to meet the establishment service procedures 4.2 Access to a wide range of wines and to information of wines 4.3 Access to suitable facilities complete with the required equipment, tools, storage system for wine service 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Direct observation of candidate providing advice to customers or colleagues on wine and its proper serving procedures 5.2 Oral and written questioning to assess on the general knowledge of wine 5.3 Demonstration of wine presentation and the proper opening and serving of wine using the necessary accessories to service 5.4 Review of portfolio of evidence on relevant subjects attended and third party workplace reports of on-the-job performance by candidate 6. Context of Assessment 6.1 Assessment may be done in the workplace or in a simulated workplace setting (assessment centers) with current bar tools, equipment and materials/products such as different types of wines. 6.2 Assessment activities are carried out through TESDA’s accredited assessment center and certified assessors",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TR-Bartending NC II (Amended) Promulgated December 2013 - 52- ELECTIVE COMPETENCIES UNIT OF COMPETENCY: PREPARE ESPRESSO UNIT CODE: TRS3113100 UNIT DESCRIPTOR: This unit deals with the knowledge and skills of preparing the perfect shot of espresso based on the parameters provided herein. ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 1. Set up and prepare machine and equipment 1.1 Cups are pre-heated in accordance with enterprise standards. 1.2 Portafilter is wiped clean and dry before dosing. 1.3 Grind of coffee is checked. 1.4 Enough coffee is ground for the shot of espresso 1.5 Drip tray is cleaned and dried. 1.6 Rags are prepared and used properly. 2. Dose and Tamp Coffee 2.1 The appropriate amount of ground coffee is dosed in the portafilter. 2.2 Appropriate amount of pressure is applied to tamp the ground beans 2.3 Ground coffee is tamped evenly. 2.4 Portafilter sides and spouts are wiped and cleaned before inserting to the brew head 2.5 Spillage and wastage of ground beans are minimized during dosing and grinding. 3. Extract espresso 3.1 Group head is flushed before inserting the portafilter 3.2 Portafilter is inserted and coffee is brewed immediately 3.3 Volume of espresso is checked 3.4 Extraction time of shot is monitored. 3.5 Crema of shot is inspected. 3.6 Espresso is served or used in a beverage immediately",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TR-Bartending NC II (Amended) Promulgated December 2013 - 53- RANGE OF VARIABLES VARIABLE RANGE 1. Grind of coffee May include: 1.1 Course 1.2 Medium 1.3 Fine 1.4 Pulverized 2. Rags May include: 2.1 For portafilter basket 2.2 Steam wand 2.3 Drip tray 2.4 Cups 3. Appropriate amount of ground coffee May be between 3.1 7-9 grams for single shot and 3.2 14-18 grams for a double shot 4. Appropriate amount of pressure May be between 30-50 lbs pressure 5. Portafilter May include: 5.1 Single spout portafilter 5.2 Double spout portafilter 5.3 Blind portafilter 6. Volume of espresso shot Volume of a shot of espresso may be between .85-1.2 ounce (25-35ml) 7. Extraction time Extraction time of shots is between 20-30 seconds",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TR-Bartending NC II (Amended) Promulgated December 2013 - 54- EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Pre-heated cups before making the shot of espresso 1.2 Wiped the portafilter clean and dry before dosing 1.3 Dosed the correct amount and tamped coffee properly 1.4 Wiped and cleaned portafilter sides and spouts before inserting to the brew head 1.5 Flushed the group head before inserting the portafilter 1.6 Inserted portafilter and brewed coffee immediately 1.7 Checked volume of espresso 1.8 Monitored extraction time of shot. 1.9 Inspected the crema of the espresso. 1.10 Served or used the espresso immediately 2. Required Knowledge 2.1 Types of coffee grind 2.2 Types of commercially viable coffee beans 2.3 Roast levels 2.4 Espresso extraction 2.5 Parts of an espresso 2.6 Espresso machine parts 3. Required Skills 3.1 Grinder calibration 3.2 Dosing and tamping 3.3 Extracting a perfect shot of espresso 4. Resource Implications The following resources should be provided: 4.1 Commercial espresso machine 4.2 Institutional coffee grinder 4.3 Coffee beans 4.4 Coffee bar tools and supplies (tamper, brush etc.) 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on coffee beans, types of grind, espresso extraction etc 5.2 Practical/Demonstration on extracting a perfect shot of espresso. 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TR-Bartending NC II (Amended) Promulgated December 2013 - 55- \nUNIT OF COMPETENCY: TEXTURE MILK \nUNIT CODE: TRS311310 1 \nUNIT DESCRIPTOR: This unit covers the skills and knowledge required to steam milk which is essential in the preparation of espresso-based beverages with milk like cappuccino and latte. It covers the two stages of steaming milk: foaming and heating, at the desired temperature and consistency. \nELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables \n1. Prepare milk and equipment \n1.1 Milk is chilled in accordance to appropriate temperature. \n1.2 Adequate amount of milk is measured according to the kind of drink to be prepared. \n1.3 Correct (size of) steaming pitcher is selected in accordance with enterprise standards \n1.4 Steaming pitcher is chilled in accordance to appropriate temperature. \n1.5 Steam wand is flushed to remove condensed water. \n1.6 Steam wand is wiped before steaming. \n1.7 Rags for the steam wand are kept clean and moist \n2. Foam milk \n2.1 Steam wand is positioned at the right depth of the milk. \n2.2 Full steam is applied when introducing air into the milk. \n2.3 The sound of air being drawn into the milk is judged/evaluated thru the hissing sound. \n2.4 Milk is stretched according to the desired volume of foam. \n2.5 Milk is converted into microfoam. \n3. Steam milk \n3.1 Steam wand is angled as appropriate to create a whirlpool effect. \n3.2 Milk is spun to achieve the desired consistency. \n3.3 Milk is steamed at the ideal temperature for immediate consumption. \n3.4 Steam wand is shut off some 5 degrees before the desired temperature. \n3.5 Steam wand is flushed and wiped after steaming. \n3.6 Big bubbles are removed by swirling and knocking the pitcher on the counter.",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TR-Bartending NC II (Amended) Promulgated December 2013 - 56- RANGE OF VARIABLES VARIABLE RANGE 1. Steaming pitcher Size may include: 1.1 10 oz 1.2 12 oz 1.3 20 oz 1.4 32 oz 2. Selection factors May include but not limited to: 2.1 Amount of milk 2.2 Steam pressure/steam capacity of machine 2.3 Steam wand tip 3. Desired volume of foam Volume of milk would have expanded to about 3.1 1/3 of original volume for latte and 3.2 Doubled for cappuccino 4. Desired consistency 4.1 Silky 4.2 Velvety 4.3 Pouring consistency 4.4 Naturally sweet 4.5 Glossy 4.6 Microfoam bubbles 5. Ideal temperature Ideal temperature for steaming milk is between 140 to 160 degrees Fahrenheit",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TR-Bartending NC II (Amended) Promulgated December 2013 - 57- EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate. 1.1 Measured the adequate amount of milk according to the kind of drink to be prepared. 1.2 Used chilled milk. 1.3 Selected the correct size of steaming pitcher 1.4 Flushed and wiped the steam wand before and after steaming milk 1.5 Kept rags clean and moist. 1.6 Listened to the sound of air being drawn into the milk. 1.7 Stretched the milk according to the desired volume of foam. 1.8 Steamed the milk to its desired texture 1.9 Steamed the milk at the ideal temperature. 2. Required Knowledge 2.1 Milk types and Chemistry of milk 2.2 Espresso machine parts 2.3 Milk based coffee beverages 3. Required Skills 3.1 Milk texturing and steaming 4. Resource Implications The following resources should be provided: 4.1 Commercial espresso machine 4.2 Institutional coffee grinder 4.3 Coffee beans 4.4 Coffee bar tools and supplies (tamper, steaming pitcher etc.) 4.5 Milk 4.6 Chiller/ref or ice box with ice 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on the step by step procedure of steaming milk; chemistry or composition of milk; its effect on the texture and sweetness of the steamed milk etc. 5.2 Practical/Demonstration on steaming milk 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "TR-Bartending NC II (Amended) Promulgated December 2013 - 58- UNIT OF COMPETENCY: PREPARE AND SERVE COFFEE BEVERAGES UNIT CODE: TRS311310 2 UNIT DESCRIPTOR: This unit covers the skills and knowledge required in the preparation of standard coffee beverages, both hot and cold using the espresso machine and the other brewing methods like syphon, pour over and French press. ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 1. Take orders of guests 1.1 Orders are taken and verified with guests or dining service crew. 1.2 Recommendations are offered to the guest on selection of coffee beverages. 1.3 General information about the coffee beans are provided to guests 1.4 Mise-en-place for coffee service is completed according to establishment’s standards and procedures. 2. Prepare espresso-based beverages 2.1 Hot and cold espresso-based beverages are prepared according to standard recipes of the establishments 2.2 Only good/perfect shots of espresso are served or used in the beverages. 2.3 Appropriate cups/glasses and accessories are selected according to the beverage ordered. 2.4 Espresso beverages are served immediately. 3. Prepare and serve brewed coffee 3.1 Brewed coffee is prepared according to the brewing method desired by the guest. 3.2 Coffee is brewed according to ideal brewing time of the method 3.3 Coffee beans are weighed or measured according to brewing method. 3.4 Brewed coffee is served immediately.",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "TR-Bartending NC II (Amended) Promulgated December 2013 - 59- RANGE OF VARIABLES VARIABLE RANGE 1. Coffee beans information May include: 1.1 Variety 1.2 Origin 1.3 Coffee Blend 1.4 Roast level 1.5 Coffee grind 2. Mis-en-place May include: 2.1 Preparing machine or brewing equipment 2.2 Setting cups, saucers, accessories 2.3 Supplies/condiments 3. Hot and cold espresso-based beverages May include: Hot 3.1 Espresso 3.2 Americano 3.3 Cappuccino 3.4 Café Latte 3.5 Café Mocha Cold 3.6 Mocha Frappe 3.7 Ice Café Latte 3.8 Iced Café Mocha 4. Perfect shot of espresso 4.1 Espresso shot within the parameters: 4.2 Amount of ground coffee: Between 7-9 grams 4.3 Volume: Between 25-35 ml 4.4 Water temperature: Between 195-205 degrees F 4.5 Atm pressure: Between 9-10 bars 4.6 Extraction time: 20-30 seconds 5. Coffee cups/glasses May include: 5.1 Espresso cups/demitasse 5.2 Cappuccino cups 5.3 Latte cups 5.4 Irish glass 5.5 Parfait glass 6. Brewing method May include: 6.1 French Press/Plunger 6.2 Syphon 6.3 Pour over",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "TR-Bartending NC II (Amended) Promulgated December 2013 - 60- EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Provided general information about the coffee beans to the guest 1.2 Prepared hot and cold espresso-based beverages 1.3 Served beverages immediately 1.4 Brewed coffee with the used of the different brewing methods 2. Required Knowledge 2.1 Coffee growing countries 2.2 Coffee varieties 2.3 Basic espresso beverages 2.4 Brewing methods 3. Required Skills 3.1 Extracting espresso 3.2 Brewing coffee 4. Resource Implications The following resources should be provided: 4.1 Commercial espresso machine 4.2 Institutional coffee grinder 4.3 Coffee beans 4.4 Coffee bar tools and supplies 4.5 Milk 4.6 Brewing equipment 5. Methods of Assessment Competency in this unit may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on espresso and espresso based beverages; brewing methods 5.2 Practical/Demonstration on preparing the basic espresso-based beverages and brewing coffee using the different brewing methods 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Bartending NC II.pdf",
                    "page": 61
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Beauty Care NC II",
        "core_competencies": [
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 27 - CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM PRE AND POST BEAUTY CARE SERVICES UNIT CODE: HCS515301 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in performing pre and post beauty care services. These include in the preparing of tools and equipment, preparing the client and performing of correct storing of tools and equipment and proper disposing of wastage from the beauty care service. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare tools and equipment 1.1 Necessary tools and equipment are selected, checked and prepared for the specific treatment activity. 1.2 Appropriate supplies and materials are prepared according to salon policies and procedures. 1.3 Treatment products are prepared following salon safety policies and procedures. 1.4 Work station / cubicle is thoroughly checked and sanitized. 2. Prepare the client 2.1 Clients’ special personal needs are attended according to salon policies and procedures. 2.2 Appropriate protective clothing materials are provided to the client according to OHSC requirements. 2.3 Clients’ safety and comfort is ensured during the entire process. 2.4 Client is provided with salon amenities following salon procedures. 2.5 If required by client, other beauty care options are offered and advised to the client. 3. Perform storing of tools and equipment and disposing of wastage 3.1 Tools and equipment used are stored according to salon safety policies and procedures. 3.2 Used treatment products and other chemicals are stored following safety and environmental codes and regulations. 3.3 Workstation is checked, cleaned and sanitized and prepared for succeeding treatment. 3.4 Supplies and materials used are cleaned and stored according to salon policies and procedures. 3.5 Waste materials are segregated, and disposed following D.O.H. and local rules and regulations.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 30
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 28 - RANGE OF VARIABLES VARIABLE RANGE 1. Clients 1.1 Child 1.2 Men 1.3 Women 1.4 Working Group 1.5 Teener 1.6 Elderly 2. Tools 2.1 Nail Care Tools 2.2 Towel 2.3 Facial Cleansing Tools 2.4 Facial Treatment Tools 2.5 Mirror 2.6 Foot and Hand Treatment Tools 3. Equipment 3.1 Foot Bath Machine 3.2 Facial Machine 3.3 Nail Care Machine 4. Beauty Care Options 4.1 Facial Treatment 4.2 Foot Spa 4.3 Hand Spa 4.4 Pedicure 4.5 Manicure 4.6 Facial Cleansing 4.7 Body Bleach 4.8 Body Scrub 4.9 Body Massage 4.10 Make-Up 4.11 Chair Spot Massage / Half Massage 4.12 Waxing 4.13 Ear Cleaning 5. Protective Clothing Materials 5.1 Draper 5.2 Towel / Towelette 5.3 Smock Gown 5.4 Headband for Facial 6. Waste Segregation 6.1 Biodegradable 6.2 Non-Biodegradable",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 31
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 29 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Prepared and stored the tools and equipment according to OHSC requirements. 1.2 Ensured clients safety and comfort during the entire process. 1.3 Applied correct techniques in draping, providing of other protective clothing to clients. 1.4 Applied questioning and listening skills in assessing the needs of clients. 1.5 Disposed wastage according to environmental rules and regulations. 2. Underpinning knowledge and attitudes 2.1 Salon Procedures 2.2 Salon Policies 2.3 Different Types of Beauty Care Products 2.4 Proper Use of Tools, Equipment, Supplies and Materials 2.5 Code of Ethics 2.6 Different Types and Condition of Skin 2.7 OHSC Rules and Regulations 2.8 Time Management 2.9 Water Temperature 2.10 Proper Hygiene 2.11 Different Beauty Care Services 3. Underpinning skills 3.1 Listening and Questioning Skills 3.2 Correct Draping Technique 3.1 Correct Checking 3.2 Proper Cleaning and Sanitization Practices 3.3 Proper Setting of Tools and Equipment 3.4 Correct Use of Tools and Equipment 3.5 Proper Storage Technique 3.6 Client Relations 3.7 Proper Disposal Practices 4. Resource implications The following resources MUST be provided: 4.1 Live model 4.1 Actual work station or simulated workplace 4.2 Supplies and materials 4.3 Tools and Equipment 5. Method of assessment Competency MUST be assessed through: 5.1 Demonstration with questioning 5.2 Observation with questioning 6. Context of assessment 6.1 Competency may be assessed in the workplace or accredited assessment center.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 32
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 30 - UNIT OF COMPETENCY: PERFORM MANICURE AND PEDICURE UNIT CODE: HCS515302 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in performing manicure and pedicure. This involves preparing the client, cleaning of finger nails and toe nails, applying nail polish, and apply final retouch. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare clients 1.1 Client is consulted on desired nail service activity and specific requirements. 1.2 Clients’ hand nail structure and condition are checked and analyzed. 1.3 Client is provided with protective materials for hygiene purposes. 1.4 Nail disorder is recognized and if necessary, referred to appropriate personnel. 1.5 Appropriate sanitized tools and equipment, supplies and materials are selected and prepared according to salon procedures. 1.6 Clients’ safety and comfort is ensured during the entire process. 2. Clean the finger nails and toe nails 2.1 Nail polish is completely removed with nail polish remover. 2.2 Fingernails are soaked in warm water with soap following salon standards. 2.3 Cuticles and dry skins are slightly pushed and completely removed using appropriate tools observing safety precautions. 2.4 Nails are trimmed and filed following customer’s desired shape and style. 2.5 Antiseptic is applied immediately upon accidental cut is incurred. 3. Apply nail polish 3.1 Hands and foot fingernails are massaged following different massage movements according to salon procedure. 3.2 Base coat is applied with long strokes starting with the little finger. 3.3 Color of the nail polish is selected and agreed according to customer desire or requirements. 3.4 Polish is applied from the base to the edge of the nail using light sweeping stroked around the cuticle. 3.5 Top or seal coat is applied with long strokes in the same manner as the base coat. 4. Perform final retouch 4.1 Outcome is checked and analyzed against agreed nail service result. 4.2 Excess polish is removed around the cuticle and nail using appropriate tools. 4.3 Quick drying agent is applied on each polished nail according to salon standard. 4.4 Client is advised on nail maintenance practices.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 31 - RANGE OF VARIABLES VARIABLE RANGE 1. Nail Condition 1.1 Normal Nail 1.2 Abnormal Nail 1.3 Hang Nail 2. Nail Disorder 2.1 Wavy Ridges - Corrugation 2.2 Depression - Furrous 2.3 White Spots - Leuconychia 2.4 Hypertrophy - Onychauxis 2.5 Wasting Away - Atrophy 2.6 Pterygium 2.7 Bitten Nails - Onycophay 2.8 Brittle Nails - Onychorrhexis 3. Shape of Nails 3.1 Flat of Arched - Acora 3.2 Roofed 3.3 Trapezoid 3.4 Olive 3.5 Date 3.6 Concave 3.7 Convex 3.8 Square 3.9 Angular 3.10 Narrow 3.11 Fan 3.12 Circumflex 3.13 Arched 3.14 Tubular 4. Different Diseased 4.1 Nail 4.2 Hand 4.3 Foot 5. Massage 5.1 Pulling 5.2 Sliding 5.3 Circular 5.4 Stretching 6. Foot/Hand Condition 6.1 With Corns 6.2 With Calluses 6.3 With Ingrown 6.4 With Normal Condition 6.5 With Fungal Infection 6.6 With Cuts 6.7 With Wound 7. Kinds of Nails 7.1 Natural 7.2 Sculptured 7.3 Artificial 7.4 Eggshell 7.5 Blue 7.6 Bruised 8. Nail Service Activity 8.1 Oil Manicure/Pedicure 8.2 Ladies Manicure/Pedicure 8.3 Men’s Manicure/Pedicure 8.4 Hand/Toe Nail Design (Manual) 8.5 Machine – Based Nail Design",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 32 - VARIABLE RANGE 9. Nail Style 9.1 Square or Rectangular 9.2 Round 9.3 Oval 9.4 Pointed 10. Equipment 10.1 Manicuring Table 10.2 Adjustable Lamp 10.3 Clients Chair 10.4 Manicurist Hair or Stool 10.5 Supply Tray 10.6 Finger Bowl 10.7 Container for Cotton 10.8 Wet Sanitizer 10.9 Glass Container 10.10 Hand Towel 10.11 Ottoman 10.12 Low Stool 10.13 Apron 10.14 Special Toe Nail Clippers 11. Implements 11.1 Orange Wood Sticks 11.2 Nail File 11.3 Cuticle Pusher 11.4 Cuticle Nipper 11.5 Nail Brush 11.6 Emery Boards 11.7 Nail Buffer 11.8 Fine Camels Hair Brush 11.9 Tweezers 11.10 Cuticle Scissors 12. Supplies/Materials 12.1 Antiseptic Solution 12.2 Cotton 12.3 Foot Powder 12.4 Foot Lotion 12.5 Nail Cleansers 12.6 Nail Polish Remover 12.7 Cuticle Oil 12.8 Cuticle Cream 12.9 Cuticle Remover 12.10 Nail Bleaches 12.11 Nail Whiteners 12.12 Dry Nail Polish 12.13 Abrasine 12.14 Liquid Nail Polish 12.15 Nail Polish Thinner 12.16 Base Coat 12.17 Top Coat 12.18 Nail String Thinner 12.19 Nail Dryer 12.20 Alum Solution 12.21 Hand Cream or Hand Lotion 12.22 Absorbent Cotton 12.23 Cleanser 12.24 Sanitized Towel",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 33 - VARIABLE RANGE 12.25 Antiseptic Solution 12.26 Disinfectant 12.27 Spatula 12.28 Mending Tissue 12.29 Silk 12.30 Linen 12.31 Plastic or Liquid Fibers 12.32 Alcohol 12.33 Nail Polish",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 34 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Consulted client on desired nail service activity and specific requirements. 1.2 Checked and analyze nail condition, structure, shape and style. 1.3 Provided client with protective clothing. 1.4 Recognized nail disorder and give advice or referral to appropriate personnel. 1.5 Selected and prepared sanitized tools and equipment. 1.6 Prepared appropriate supplies and materials. 1.7 Used questioning and listening skills to ensure client's safety and comfort during the entire process. 1.8 Cleaned nails by pushing cuticle and removing dry skin using appropriate tools observing safety precautions. 1.9 Massaged hand and foot following D.O.H. rules and regulations. 1.10 Applied base coat and tip seal coat using long strokes and single direction. 1.11 Applied agreed nail polish color using light sweeping strokes around the cuticle and nail. 1.12 Checked outcome and apply finishing touches according to salon standard. 2. Underpinning knowledge and attitudes 2.1 Types of Nails 2.2 Condition of Nail 2.3 Structure, Shape and Styles of Nails 2.4 Hand and Foot Massage Movements 2.5 Code of Ethics 2.6 Analysis of Nail Disorder 2.7 D.O.H. Rules and Regulations 2.8 OHSC Rules and Regulations 2.9 Salon Policies and Procedures 2.10 Different Kinds of Antiseptic 3. Underpinning skills 3.1 Technique in Massage 3.2 Nail Polish Application Technique 3.3 Negotiations Skills 3.4 Base and Top Coat Application Technique 3.5 Proper Use of Tools and Equipment 3.6 Client Relations 4. Resource implications The following resources MUST be provided: 4.1 Live Model 4.2 Treatment Products 4.3 Tools and Equipment 4.4 Actual workstation or simulated workplace with complete facilities 5. Method of assessment Competency may be assessed through: 5.1 Demonstration with questioning 5.2 Direct observation with questioning 5.3 Written test 6. Context of assessment 6.1 Competency may be assessed in the workplace or accredited assessment center.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 35 - UNIT OF COMPETENCY: PERFORM HAND SPA UNIT CODE: HCS515303 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in performing spa for the hands. It also involves preparing the client, application of hand spa products and performing post hand spa activities. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare client 1.1 Condition of hand and nails are checked and analyzed. 1.2 Clients’ safety and comfort is ensured prior start of activity. 1.3 Hand is washed with warm water and soap before and after scrubbing. 1.4 Hand is towel dried and scrubbed with appropriate lotion. 1.5 Hand spa machine is set to regulate heat to achieve required melting of wax. 2. Apply hand treatment 2.1 Hand spa machine is set to regulate heat to achieve required melting of wax. 2.2 Necessary tools and supplies/materials are prepared and used according to OHSC requirements. 2.3 Appropriate temperature is determined and tested by client respective heat tolerance. 2.4 Hand is submerged for 4 seconds for 3 consecutive times. 2.5 Hand is wrapped with plastic gloves and mittens for client requirements. 2.6 Wax is removed from hand according to manufacturer’s instructions. 2.7 Hand is applied with hand softening product and massaged according to prescribed procedures. 3. Perform post hand activity 3.1 Waste products including used wax are disposed according to OHSC & DOH requirements. 3.2 Tools and equipment are sanitized and stored. 3.3 Client is advised on after service maintenance program. 3.4 Workstation is cleaned and sanitized for next treatment activity. 3.5 Desired service outcome is confirmed with client and recorded.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 36 - RANGE OF VARIABLES VARIABLE RANGE 1. Hand and Nail Conditions 1.1 Super Callous 1.2 Normal 1.3 Dry 2. Tools 2.1 Mittens 2.2 Transparent Plastic 2.3 Hand Towel 2.4 Small Basin 2.5 Stool 2.6 Hand Spa Machine 3. Hand Spa Machine Setting 3.1 Melt or Boil 3.2 Warm 4. After Service Maintenance Program 4.1 Frequent Salon Visit (Twice a Month) 4.2 3-5 Times a day application of lotion. 5. Supplies and Materials 5.1 Softening Lotion 5.2 Paraffin Wax 5.3 Soap 5.4 Scrub Lotion 5.5 Liniment Oil 5.6 Aromatherapy Oil 5.7 Olive Oil 5.8 Cling Wrap 5.9 Rubbing Alcohol",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 37 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Checked and analyzed hand and nail conditions. 1.2 Performed standard procedure in washing, scrubbing and massaging of hands. 1.3 Followed safety rules in setting and handling, cleaning and storing of tools and equipment. 1.4 Applied salon policies and procedures and industry codes of practice in application of hand and nail treatment. 1.5 Consistently used effective questioning and listening techniques in ensuring client safety and comfort throughout the service. 1.6 Properly set spa machine to appropriate temperature. 2. Underpinning knowledge and attitudes 2.1 Hand Analysis 2.2 Code of Ethics 2.3 D.O.H. and OHSC Regulations 2.4 Salon Practice and Procedures 2.5 Different Hand Treatments 2.6 Different Hand Conditions 3. Underpinning skills 3.1 Apply Standard Procedures 3.2 Setting of Tools and Equipment 3.3 Proper Handling, Cleaning and Storing of Tools and Equipment 3.4 Effective Questioning and Listening Skills 3.5 Selection of Treatment Product 3.6 Time Management. 3.7 Scrubbing, Massaging Technique 3.8 Client Relations 4. Resource implications The following resources MUST be provided: 4.1 Live Model 4.2 Supplies and materials 4.3 Actual or simulated work station 4.4 Tools and equipment 4.5 Protective clothing and gadgets 5. Method of assessment Competency MUST be assessed through: 5.1 Demonstration with questioning. 5.2 Direct observation with questioning 6. Context of assessment 6.1 Competency may be assessed in the workplace or accredited assessment center.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 38 - UNIT OF COMPETENCY: PERFORM BODY MASSAGE UNIT CODE: HCS515304 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in performing body massage. This involves preparing the client, massaging the desired and planned body area and applies post body massage treatment activities. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare clients 1.1 Clients’ body condition is checked and analyzed. 1.2 Client is consulted on what type of massage is desired. 1.3 Client is provided with protective clothing materials. 1.4 All product, tools are prepared and used according to OHSC requirements. 1.5 Client is consulted on the type of massage products are to be used. 1.6 Client is advised to remove all personal accessories and kept in a safe place. 2. Massage body 2.1 Client is laid in a position ensuring the safety and comfort during the entire process. 2.2 Correct direction and required movements / strokes are followed in the massage technique. 2.3 Appropriate timeline is observed according to salon policies standard. 2.4 Body massage product is spread out on the area and followed with massage according to salon standard procedures. 2.5 Critical body points are massage with soft pressure. 2.6 Any pain / complain made by the client is immediately acknowledged. 3. Post body massage treatment 3.1 Client is advised not to take a bath within 12 hours according to D.O.H. rules. 3.2 Cubicle is sanitized and prepared for the next salon activity. 3.3 Tools, massage products are cleaned and sterilized and kept in designated cabinets. 3.4 Massage activity is recorded according to salon policies and procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 39 - RANGE OF VARIABLES VARIABLE RANGE 1. Body Condition 1.1 Normal 1.2 With Low Blood Pressure 1.3 With High Blood Pressure 1.4 With Deformities 1.5 With Skin Rashes 2. Types of Massage 2.1 Swedish 2.2 Siatzu 2.3 Reflexology 2.4 Basic 2.5 Chair Spot 2.6 Thai 3. Timeline 3.1 45 mins. 3.2 1 hour 3.3 20 minutes (for partial area of the body) 4. Cleaning 4.1 Use face towel with lukewarm water 4.2 Steam Bath 4.3 Quick Shower 5. Tools and Equipment 5.1 Massage Gadgets 5.2 Massage Bed 5.3 Bed Sheets 5.4 Pillow 5.5 Stool 6. Personal Accessories 6.1 Jewelries 6.2 Head Band 6.3 Wrist Watch 6.4 Hair Accessories 7. Massage Technique 7.1 Soft Pressure 7.2 Hard Pressure 8. Protective Clothing Materials 8.1 Face Towel 8.2 Bath Towel 8.3 Shorts 8.4 Gauze Mask 8.5 Smock Gown 8.6 Bath Robe 8.7 Head Band 8.8 Apron 9. Massage Products 9.1 Lotion 9.2 Aromatic Oil 9.3 Olive Oil 9.4 Powder 9.5 Mentholated Oil 9.6 Herbal Oil 10. Critical Body Points 10.1 Nape 10.2 Breast 10.3 Spinal 10.4 Head 10.5 Stomach 10.6 Back of Knee",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 40 - VARIABLE RANGE 11. Movements/Stroke 11.1 Spreading 11.2 Pressing 11.3 Sliding 11.4 Circular 11.5 Tapping 11.6 Kneading 11.7 Stretching 12. Body Position 12.1 Sitting Position 12.2 Lying Position 12.3 Prone Position",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 41 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Checked and analyzed body condition. 1.2 Requested the un-wearing of personal accessories to achieve optimum result. 1.3 Ensured clients comfort and safety in performing the body massage in any position. 1.4 Prepared and used Tools, Supplies and Materials according to OHSC requirements. 1.5 Applied appropriate and necessary strokes and movements following DOH requirements. 1.6 Applied necessary movements according to prescribed direction. 1.7 Observed timeline according to salon standard. 1.8 Advise clients on safety precautions after the massage. 1.9 Acknowledged pain or other complains made by the client. 2. Underpinning knowledge and attitudes 2.1 Different types of Massage 2.2 D.O.H. Rules and Regulations 2.3 OHSC Policies and Procedures 2.4 Timeline 2.5 Protective Clothing 2.6 Salon Policies and Procedures 2.7 Client Relations 2.8 Different Body Conditions 2.9 Different Massage Products 2.10 Body Critical Points 3. Underpinning skills 3.1 Observe personal hygiene 3.2 Apply different types of massage 3.3 Use tools and equipment 3.4 Use appropriate strokes / movements 3.5 Use of different massage product 4. Resource implications The following resources MUST be provided: 4.1 Live Model 4.2 Supplies and Materials 4.3 Body Massage Product 4.4 Protective Clothing and Gadget 4.5 Simulated or Actual Workplace 4.6 Appropriate Tools and Equipment 5. Method of assessment Competency MUST be assessed through: 5.1 Direct Observation with Questioning 5.2 Demonstration with Questioning 6. Context of assessment 6.1 Competency may be assessed in the workplace or accredited assessment center.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 42 - UNIT OF COMPETENCY : PERFORM BODY SCRUB UNIT CODE : HCS515305 UNIT DESCRIPTOR : This unit covers the knowledge, skills and attitude in performing body scrub. It involves the preparation of the clients, application of body scrub treatment products and performing post body scrubbing activities. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare client 1.1 Clients’ skin condition and types are checked and analyzed. 1.2 Client is provided with appropriate clothing material. 1.3 Client is advised to remove personal accessories to achieve optimum service results. 1.4 Client is positioned lying upside down. 1.5 Work station is thoroughly checked according to salon policies and procedures. 1.6 Necessary tools and equipment are prepared according to the service requirements. 1.7 Skin test is administered to prevent possible contraindications. 2. Scrub body surface 2.1 Client is bathed in lukewarm water before and after scrubbing the body surface using face towel. 2.2 Skin scrub product is applied thoroughly on the body surface using hand in a to and fro motion. 2.3 Clients’ safety and comfort is ensured during the entire process. 2.4 Supplies and materials are prepared and used according to OHSC requirement. 2.5 Scrubbing is performed with the timeline and procedure prescribed by salon or industry. 3. Perform final checking and polish output 3.1 Result is checked according to the clients desired outcome. 3.2 Client is advised with appropriate maintenance progress. 3.3 Client is consulted and prepared for other possible skin enhancement/improvement activity. 3.4 Used supplies and material scrub products are stored and disposed according to OHSC requirements. 3.5 Workstation is sanitized and prepared for next salon activity.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 43 - RANGE OF VARIABLES VARIABLE RANGE 1. Types and skin conditions 1.1 Dry 1.2 Oily 1.3 Normal 1.4 Fine 1.5 Rough 2. Protective clothing materials 2.1 Bath Towel 2.2 Bath Robe 2.3 Headband 2.4 Gauge Mask 2.5 Slippers 3. Personal accessories 3.1 Wrist Watch 3.2 Ring 3.3 Bangles and Bracelet 3.4 Necklace 3.5 Anklet 4. Supplies/materials 4.1 Scrubbing Product 4.2 Scrubbing Cream 4.3 Body Lotion 4.4 Bed Sheet 4.5 Lukewarm Water 4.6 Whitening Soap 5. Tools and equipment 5.1 Stool 5.2 Face Towel 5.3 Basin 5.4 Scrubbing Gloves 5.5 Timer 5.6 Pillow 6. Timeline procedure 6.1 45 minutes 6.2 1 hour 7. Scrubbing area 7.1 Arms 7.2 Legs 7.3 Armpit 7.4 Entire body",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 44 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Checked and analyzed the client's skin type condition. 1.2 Provides client with appropriate clothing material. 1.3 Bathe client with lukewarm water. 1.4 Applied appropriate skin scrub products on body surface following salon policies and procedures. 1.5 Ensured client's safety and comfort during the entire process by questioning-listening to them. 1.6 Prepared and used S/M according to OHSC requirements. 1.7 Performed the scrubbing activity following prescribed salon policies and procedures. 1.8 Checked result and advice client on appropriate maintenance program. 1.9 Consulted and explained all possible skin improvement enhancement of skin. 2. Underpinning knowledge and attitudes 2.1 Skin Type Condition 2.2 Code of Ethics 2.3 Treatment Products 2.4 Clothing Material 2.5 D.O.H. Rules and Regulations 2.6 Time Management 3. Underpinning skills 3.1 Apply scrubbing product 3.2 Apply client relationship 3.3 Apply scrubbing technique 3.4 Use supply and materials 4. Resource implications The following resources MUST be provided: 4.1 Live Model 4.2 Supplies and Materials 4.3 Actual workstation or simulated workplace with complete facilities. 4.4 Body skin scrubbing products. 5. Method of assessment Competency MUST be assessed through: 5.1 Demonstration with questioning 5.2 Direct observation with questioning 6. Context of assessment 6.1 Competency may be assessed in the workplace or accredited assessment center.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 45 - UNIT OF COMPETENCY : PERFORM FACIAL TREATMENT UNIT CODE : HCS515306 UNIT DESCRIPTOR : This unit covers the knowledge, skills and attitude in performing facial treatment. It also covers the competency in assessing the clients; perform actual facial cleansing and treatment of the face and post treatment activity. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Assess clients needs 1.1 Clients’ facial skin condition is checked and analyzed. 1.2 Client is advised on appropriate facial treatment option. 1.3 Protective clothing and gadget are worn by the client and attendant. 1.4 Hands are thoroughly washed and sanitized before performing the activity. 1.5 Client is consulted to confirm health condition per instruction if any. 2. Perform cleaning and actual treatment of the face (separate cleaning from actual treatment, these can be two activities or elements) 2.1 Treatment products are prepared and used according to salon procedures and manufacturer’s instruction. 2.2 Appropriate cleaning technique and application of cleansing product is performed following salon policies. 2.3 Client safety and comfort is ensured during the process. 2.4 Face is massaged thoroughly using different strokes always in upward movement. 2.5 Appropriate timeline prescribed for each step is followed. 2.6 Water level of facial steamer is checked according to D.O.H. rules and regulations. 2.7 Skin is toned with manual or facial machine and applied with appropriate finishing facial products. 3. Perform post treatment activity 3.1 Result is checked through visual or with the use of equipment. 3.2 Client is advised on post treatment precautions and appropriate maintenance product procedure. 3.3 Tools, equipment and materials are cleaned and sanitized and stored according to OHSC. 3.4 Workstation is cleaned for next activities. 3.5 Cleansing and treatment products are stored in designated areas. 3.6 Wastes are disposed following DENR regulations. 3.7 Cold compress is applied on treated area following salon policies and procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 46 - RANGE OF VARIABLES VARIABLE RANGE 1. Skin Condition 1.1 With Pimples 1.2 With Acne 1.3 With Warts 2. Protective Clothing And Gadget 2.1 Eyepads 2.2 Towel 2.3 Headband 2.4 Facial Gown 2.5 Gauze Mask 2.6 Bib (White Cloth) 2.7 Bath Towel 2.8 Linen (Leg Cover) 2.9 Facial Mask 3. Treatment Product 3.1 Skin Toner 3.2 Facial Cream 3.3 Moisturizer 3.4 Astringent 3.5 Bleaching Cream 3.6 Acne Cream 3.7 Sun Block Cream 3.8 Peeling Lotion 3.9 Peel-Off Mask 3.10 Mud Pack 3.11 Honey Pack 3.12 Cleansing Cream 3.13 Facial Scrub 4. Supplies And Materials 4.1 Bed Sheet 4.2 Towelette 4.3 Tissue 4.4 Facial Mask 4.5 Cotton 4.6 Skin Tone 5. Tools And Equipment 5.1 Facial machine with the following accessories: 5.1.1 Scrubbing Brush 5.1.2 Ultraviolet 5.1.3 Vacuum 5.1.4 Spray 5.1.5 Galvanic 5.2 Magnifying Lamp 5.3 Hot Cabinet 5.4 Facial Steamer 5.5 Facial Bed 5.6 Facial Brush 5.7 Facial Bowl 5.8 Facial Glass 5.9 Facial Basin 5.10 Sterilizer 5.11 Stool 5.12 Pricking Tools",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 47 - VARIABLE RANGE 6. Different Strokes 6.1 Spreading 6.2 Chin Movements 6.3 Lower Cheeks 6.4 Mouth Nose Cheek Movement 6.5 Linear Movement Forehead 6.6 Circular Movements Forehead 6.7 Criss-Cross 6.8 Stroking Movements 6.9 Brow and Eye Movements 6.10 Nose and Upper Cheek Movements 6.11 Lip and Chin Movement 6.12 Optional Movement 6.13 Lifting Movement of Cheeks 6.14 Rotary Move of Cheeks 6.15 Light Tapping Movement 6.16 Stroking Movement of Neck 6.17 Circular Movement Over Neck and Chest 6.18 Shoulder and Back Movement 6.19 Chest and Back Movement 6.20 Back Massage (optional)",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 48 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment required evidence that the candidate: 1.1 Checked and analyzed clients’ facial skin tone and condition. 1.2 Used protective clothing and gadget. 1.3 Observed personal hygiene sanitation practices during the entire process. 1.4 Used appropriate types and amount of treatment products. 1.5 Performed cleaning and massage following standard techniques and procedures. 1.6 Applied listening and questioning skills ensuring the safety and comfort of clients. 1.7 Checked set, use and sanitize tools and equipment supplies and materials according to OHSC requirements. 1.8 Checked final outcome and advises client on post treatment precautions and use of appropriate facial maintenance products. 2. Underpinning knowledge and attitudes 2.1 Facial Skin Type and Condition 2.2 Code of Ethics 2.3 Treatment Products (Types) 2.4 Correct Massage Techniques 2.5 Machine Equipment Procedure 2.6 Protective Clothing and Gadget 2.7 D.O.H. Rules and Regulations 2.8 Salon Policies and Procedures 2.9 Time Management 3. Underpinning skills 3.1 Handling Tools and Equipment 3.2 Operating Equipment 3.3 Applying Massage Techniques 3.4 Applying Customer Relations 3.5 Applying Treatment Product 3.6 Proper disposing of waste 3.7 Communicating skills 4. Resource implications The following resources MUST be provided: 4.1 Live Model 4.2 Treatment Products 4.3 Tools and Equipment 4.4 Actual workstation or simulated workplace with complete facilities 5. Method of assessment Competency may be assessed through: 5.1 Demonstration with questioning 5.2 Direct observation with questioning 5.3 Written test 6. Context for assessment 6.1 Competency may be assessed in the workplace or accredited assessment center.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 49 - UNIT OF COMPETENCY: PERFORM FOOT SPA UNIT CODE: HCS515307 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in performing foot spa. It involves the preparation of the clients, application of foot spa products and performing post foot spa activities. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare client 1.1 Foot condition is checked and analyzed. 1.2 Client safety and comfort is ensured during the entire process. 1.3 Tools, equipment, supplies and materials are prepared and used according to salon procedures. 1.4 Personal protective clothing and gadget are worn before the start of the procedure. 1.5 Water temperature is checked against client heat tolerance. 2. Apply foot spa 2.1 Foot is thoroughly scrubbed using appropriate tools following safety procedures. 2.2 Foot is applied with treatment product before and after soaking in foot spa machine. 2.3 Treatment is performed within the required salon time frame. 2.4 Foot is massage following basic foot massage motion movement. 2.5 Foot is cleaned thoroughly by soaking in liquid soap and lukewarm water for 10-15 minutes. 3. Perform post foot spa activity 3.1 Tools, equipment, supplies and materials are disinfected and stored according to OHSC requirements. 3.2 Outcome of treatment is assessed against clients’ requirements and recorded following salon procedure. 3.3 After care advice and homecare products are recommended according to clients needs. 3.4 Workstation is sanitized and prepared for the succeeding salon activities. 3.5 Wastes are disposed according to OHSC requirements.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 50 - RANGE OF VARIABLES VARIABLE RANGE 1. Condition of the Foot 1.1 Normal 1.2 Dry 1.3 With abrasions or cuts 1.4 With fungal infection or wounds 1.5 With open wound 2. Tools and Equipment 2.1 Foot Spa Machine 2.2 Foot File 2.3 Foot Stool 2.4 Pumice Stone 2.5 Gloves 2.6 Metal File 2.7 Brush 2.8 Small Basin 2.9 Foot Towel 2.10 Mixing Bowl 2.11 Callous Scraper 3. Supplies and materials 3.1 Foot Toner 3.2 Whitening Powder 3.3 Moisturizing Lotion 3.4 Medicated Liquid Soap 3.5 Antiseptics 3.6 Liquid Soap 3.7 Foot Lotion 3.8 Foot Scrub Lotion 3.9 Oil 3.10 Warm Water 4. Basic Foot Massage Movement 4.1 Sliding 4.2 Circular Motion 4.3 Pressing 4.4 Stretching of Finger Toes 5. Home Care Products 5.1 Foot Powder 5.2 Foot Spray 5.3 Foot Lotion 5.4 Petroleum Jelly",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 51 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Applied salon policies and procedures in performing foot treatment. 1.2 Applied of safety rules and regulations during the entire process. 1.3 Analyzed varied condition of the foot. 1.4 Checked, handled and stored appropriate tools, equipment, supplies, materials according to OHSC requirements. 1.5 Applied basic foot massage following different prescribed movements. 1.6 Applied treatment product as per clients needs following manufacturers instructions and safety practices. 1.7 Displayed the ability to use effective questioning and listening skills in consulting and negotiating with clients. 1.8 Used personal protective clothing and gadgets in performing the activity. 2. Underpinning knowledge and attitudes 2.1 Foot Condition 2.2 Code of Ethics 2.3 OHSC and D.O.H. Rules and Regulations 2.4 Basic Foot Massage Procedure 2.5 Salon Policies and Procedures 2.6 Basic Product Knowledge 2.7 Time Management 3. Underpinning skills 3.1 Applying basic massage 3.2 Applying proper massage procedure 3.3 Handling of tools 3.4 Handling client 3.5 Managing time 4. Resource implications The following resources MUST be provided: 4.1 Relevant Supplies and Materials 4.2 Live Model 4.3 Simulated or Actual Workplace 4.4 Tools and Equipment used in the treatment 5. Method of assessment Competency MUST be assessed through: 5.1 Demonstration with Questioning 5.2 Direct Observation with Questioning 6. Context of assessment 6.1 Competency may be assessed in the workplace or accredited assessment center.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 52 - UNIT OF COMPETENCY: APPLY FACIAL MAKE-UP UNIT CODE: HCS515314 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in applying facial make-up. It also involves the preparation of the client, application of make-up and the performance of post-facial make-up activities. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare clients 1.1 Client is consulted on specific make-up requirements. 1.2 Clients’ shapes of face and skin type/tones are analyzed. 1.3 Client is seated in a comfortable position during the entire process. 1.4 Protective clothing is provided to the client. 1.5 Client is advised to remove all personal accessories. 2. Perform application of make-up 2.1 Hand is sanitized before actual application of make-up. 2.2 Make-up tools, supplies and materials are selected according to client make-up requirement. 2.3 The eyebrow is defined using appropriate tools. 2.4 Clients face is thoroughly cleaned using appropriate cleansing products. 2.5 Concealer and foundation are applied to cover dark spots of the face according to clients’ skin tone. 2.6 Appropriate make-up products and accessories are selected and applied in standard sequence/procedure in accordance with OHSC regulations. 3. Perform post facial make-up activities 3.1 Make-up result is checked before application of final touch. 3.2 Make-up products tools and materials are stored according to safety and sanitation rules and regulations. 3.3 Client is advised on appropriate product and procedure to apply retouch. 3.4 Workstation is cleared and prepared for next customer.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 53 - RANGE OF VARIABLES VARIABLE RANGE 1. Make-up Requirements 1.1 Day Make-Up 1.2 Evening Make-Up 1.3 Photographic 1.4 Bridal 1.5 Stage 1.6 Fantasy 1.7 Debutant Make-Up 1.8 Cinematic and Television Make-Up 2. Shape of Face 2.1 Rectangle or Elongated 2.2 Inverted 2.3 Heart 2.4 Oval 2.5 Triangular 2.6 Square 2.7 Diamond 2.8 Round 3. Skin Type 3.1 Dry 3.2 Normal 3.3 Oily 4. Skintone 4.1 Dark 4.2 Fair 4.3 Light 5. Protective clothing may include 5.1 Bath Towel 5.2 Headband 5.3 Smock Gown 5.4 Face Towel or Towelette 6. Foundation Eye Liner 6.1 Liquid 6.3 Cake Eye Liner 6.2 Pencil 6.4 Gel Eye Liner 7. Eyebrow may be defined through 7.1 Plucking 7.2 Threading 7.3 Shaving 8. Make-up Tools 8.1 Sponge 8.1.1 Natural 8.1.2 Sea Sponge 8.1.3 Soft for Cake 8.1.4 Finger Tips 8.2 Sharpener 8.3 Cotton Buds 8.4 Eyelash Curler 8.5 Powder Applicator 8.6 Flat brush 8.6.1 Lip Brush 8.6.2 Eye Liner Brush 8.6.3 Eye Shadow Brush 8.6.4 Large Eyebrow Brush 8.6.5 Small Eyebrow Brush 8.6.6 Large Blusher Brush 8.6.7 Powder Brush 8.6.8 Brow with Comb Brush 8.6.9 Body Brush",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 54 - VARIABLE RANGE 8.7 Eye Brow Scissor 8.8 Curl Lash 8.9 Fun Brush 8.10 Eye Brow Blade 8.11 Tweezer 9. Cleansing Products 9.1 Cream Form 9.2 Liquid Form 10. Make-up Product 10.0 Concealer 10.1 Cake of Liquid Foundation 10.2 Blusher 10.3 Eyeshadow 10.4 Eye Liner 10.5 Eye Brow Pencil 10.6 Lip Pencil 10.7 Lip Stick 10.8 Mascara 10.9 Face Powder 11. Face Powder 11.1 Pressed Powder 11.2 Loose Powder 12. Accessories 12.1 Glitter Gel 12.2 Eye Gel 12.3 Stoned Glitter 12.4 Powder Glitter 12.5 Lasher Glue (Artificial) 13. Personal Accessories 13.1 Earrings 13.2 Necklace 13.3 Any pierced items in the face",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care NC II Promulgated August 2005 - 55 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Consulted clients’ make-up requirements. 1.2 Performed analysis of clients face, skin tone and types. 1.3 Used appropriate make-up tools and materials and accessories. 1.4 Selected and applied appropriate make-up products. 1.5 Performed checking and apply final touch on client. 1.6 Performed safe and sanitary procedures in handling customer. 2. Underpinning knowledge and attitudes 2.1 Code of Ethics 2.2 Make-Up Procedure 2.3 Facial Skin and Type Analysis 2.4 Make-Up Product Knowledge 2.5 Make-Up Technique 3. Underpinning skills 3.1 Handling Client 3.2 Handling tools and materials 3.3 Applying make-up 3.4 Blending of color 4. Resource implications The following resources MUST be provided: 4.1 Live Model 4.2 Make-Up Tools and Materials 4.3 Make-Up Products 4.4 Actual work facilities or simulated work place 5. Method of assessment Competency may be assessed through: 5.1 Demonstration with questioning 5.2 Direct observation with questioning 5.3 Written test 6. Context of assessment 6.1 Competency may be assessed in the workplace or accredited assessment center.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Beauty Care Services (Nail Care) NC II",
        "core_competencies": [
            {
                "page_content": "TR Beauty Care Services (Nail Care) NC II Promulgated - 30 - CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM MANICURE AND PEDICURE UNIT CODE: HCS5153 25 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in performing manicure and pedicure. This involves preparing the client, cleaning of finger nails and toe nails, applying nail polish, and applies final touch. ELEMENT PERFORMANCE CRITERIA Bold & Italicized fonts are elaborated in the Range of Variables 1. Prepare clients 1.1 Client is consulted on desired nail service activity and specific requirements and consultation record is agreed and signed 1.2 Clients’ hand nail structure and condition are checked and analyzed 1.3 Client is provided with protective materials for hygiene purposes 1.4 Nail disorder is recognized and if necessary, referred to appropriate personnel 2. Perform cleaning and cutting of nails 2.1 Appropriate sanitized tools and equipment, supplies and materials are selected and prepared according to salon procedures 2.2 Hands and feet are disinfected sanitized, cleaned and dried completely 2.3 Nails are cleaned in accordance with established or acceptable procedures. 2.4 Nails are trimmed and filed based on client’s desired shape. 2.5 Fingers are lightly massaged following prescribed movements 2.6 Client’s safety and comfort is ensured during the entire process. 2.7 First-aid is applied in case of accidental cuts and wounds 3. Apply nail polish 3.1 Color of nail polish is selected and agreed according to customer requirements 3.2 Nail polish is applied in accordance with established / acceptable as procedure 3.3 Outcome is checked and analyzed against agreed nail service result. 4. Perform post-service activities 5.1 Client is advised on nail maintenance practices 5.2 Waste are properly disposed according to waste environment and safety regulations 5.3 Tools and materials are sanitized and stored in accordance with salon policies and procedures 5.4 Workstation is cleaned and sanitized in accordance with OH&S requirements",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care Services (Nail Care) NC II.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care Services (Nail Care) NC II Promulgated - 31 - RANGE OF VARIABLES VARIABLE RANGE 1. Client 1.1 Ladies 1.2 Men 2. Nail service activity 2.1 Manicure 2.2 Pedicure 3. Nail condition 3.1 Normal nail 3.2 Hang nail 4. Nail Disorder 3.1 Wavy Ridges - Corrugation 3.2 Depression - Furrous 3.3 White Spots - Leuconychia 3.4 Hypertrophy - Onychauxis 3.5 Wasting Away - Atrophy 3.6 Pterygium 3.7 Bitten Nails - Onyco phay 3.8 Brittle Nails – Onychorrhexis 5. Equipment /Tools 5.1 Manicuring Table 5.2 Adjustable Lamp 5.3 Clients Chair 5.4 Manicurist Chair or Stool 5.5 Supply Tray 5.6 Finger Bowl 5.7 Container for Cotton 5.8 Wet Sanitizer 5.9 Glass Container 5.10 Sterilizer 5.11 Cuticle pusher 5.12 Emery board 5.13 Orange wood stick 5.14 Cuticle nipper 5.15 Nail Cutter 5.16 Nail brush 5.17 Nail buffer 5.18 Toe nail separator 5.19 Nail file 5.20 Cuticle scissors 6. Supplies/Materials 6.1 Antiseptic Solution 6.2 Cotton 6.3 Nail Polish Remover 6.4 Cuticle Oil 6.5 Cuticle Remover 6.6 Base Coat 6.7 Top Coat",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care Services (Nail Care) NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care Services (Nail Care) NC II Promulgated - 32 - VARIABLE RANGE 6.8 Hand and Foot Lotion 6.9 Sanitized Towel 6.10 Alcohol 6.11 Colored Nail Polish 6.12 Cotton balls 6.13 Quick dry 6.14 Nail solvent 7. Established procedure 7.1 Cleaning Nails 7.1.1 Remove old nail polish with nail polish remover 7.1.2 Soak fingernails in lukewarm water with soap 7.1.3 Slightly push cuticles and dry skins and trim. 7.1.4 Cut nails and file following customer’s desired shape and style 7.1.5 Massage hands and foot following different massage movements 7.2 Applying Nail polish 7.2.1 Apply nail polish from the base to the edge of the nail using light sweeping stroke around the cuticle 7.2.2 Apply top or seal coat with long strokes in the same manner as the base coat 7.2.3 Remove excess nail polish around the cuticle and nail. 7.2.4 Apply quick drying agent on each polished nail 8. Nail Shape 8.1 Oval 8.2 Square 8.3 Round 8.4 Pointed 9. Massage movements 9.1 Effleurage massage 9.2 Petrissage massage 9.3 Sliding 9.4 Circular 9.5 Stretching 9.6 Friction 10. Client’s safety and comfort 10.1 During massage 9.1.1 Maneuvering of customers during massage 9.1.2 Confirmation of client allergies 10.2 Determining skin disorders and ailments relevant to beauty care treatment 11 Environment and safety regulations 11.1 Occupational Health and safety 11.2 5S Procedures 11.3 3R Concepts",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care Services (Nail Care) NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care Services (Nail Care) NC II Promulgated - 33 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Consulted client on desired nail service activity and specific requirements 1.2 Checked and analyze nail condition, structure, shape and style 1.3 Recognized nail disorder and give advice or referral to appropriate personnel 1.4 Selected and prepared sanitized tools and equipment and appropriate supplies and materials 1.5 Observed proper handling of chemicals and protection 1.6 Cleaned and cut nails using appropriate tools and in accordance with established or acceptable procedures 1.7 Applied nail polish in accordance with established or acceptable procedures 1.8 Performed post-service activities 1.9 Used questioning and listening skills to ensure client’s safety and comfort during the entire process 2. Underpinning knowledge 2.1 Types of Nails 2.2 Condition of Nail 2.3 Skin Diseases around the nails 2.4 Structure, Shape and Styles of Nails 2.5 Hand and Foot Massage Movements 2.6 Code of Ethics 2.7 Analysis of Nail Disorder 2.8 D.O.H and OH&S requirements 2.9 First-aid treatment 2.10 Salon Policies and Procedures 2.11 Different Kinds of Antiseptic 2.12 Environment and safety regulations  Occupational Health and safety  5S Procedures  3R Concepts 3. Underpinning skills 3.1 Massaging techniques 3.2 Applying nail polish 3.3 Negotiations Skills 3.4 Using appropriate tools and equipment 3.5 Client Relations 3.6 Observing code of ethics 3.7 Compliance on DOH and OH&S requirements 3.8 Applying first-aid treatment in case cuts were done 4. Resource implications The following resources MUST be provided: 4.1 Model 4.2 Tools, equipment and supplies/materials relevant to the activity to be performed 4.3 Work area/facilities 5. Method of assessment Competency may be assessed through: 5.1 Demonstration with oral questioning 5.2 Third-Party Report 5.3 Portfolio 6. Context of assessment 6.1 Assessment may be conducted in the workplace or in a simulated environment (TESDA Accredited Training Centers)",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care Services (Nail Care) NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care Services (Nail Care) NC II Promulgated - 34 - UNIT OF COMPETENCY: PERFORM HAND SPA UNIT CODE: HCS5153 26 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in performing spa for the hands. It also involves preparing the client, application of hand spa products and performing post hand spa activities. ELEMENT PERFORMANCE CRITERIA Bold & Italicized fonts are elaborated in the Range of Variables 1. Prepare client 1.1 Condition of client’s hand and nails are checked and analyzed following salon policies and procedures 1.2 Client’s hand is washed with lukewarm water and soap, and towel-dried before and after scrubbing 1.3 Client is advised to remove jewelries and accessories 2. Apply hand treatment 2.1 Necessary tools and supplies/materials are prepared and used according to OH&S requirements 2.2 Hand spa machine is set to regulate heat to achieve required melting of wax 2.3 Appropriate temperature is determined and tested by client respective heat tolerance 2.4 Hand Spa is performed in accordance with establish or acceptable procedure 2.5 Clients’ safety and comfort is ensured during the entire process. 2.6 Desired service outcome is confirmed with client and recorded 3. Perform post service activities 3.1 Client is advised on after service maintenance 3.2 Waste products are disposed according to environment and safety regulations 3.3 Tools and equipment are sanitized and stored environment and safety regulations 3.4 Workstation is cleaned and sanitized for next client",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care Services (Nail Care) NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care Services (Nail Care) NC II Promulgated - 35 - RANGE OF VARIABLES VARIABLE RANGE 1. Hand conditions 1.1 Callous 1.2 Normal with no cuts or wounds 1.3 Dry 2. Clients 2.3 Child 2.4 Men 2.5 Women 2.6 Working Group 2.7 Teener 2.8 Elderly 3. Hand spa machine setting 3.1 Melt 3.2 Warm 4. Tools, equipment and supplies/machine 4.1 Tools 4.1.1 Small basin 4.1.2 Stool 4.2 Equipment 4.2.1 Hand spa machine 4.3 Supplies/materials 4.3.1 Mittens 4.3.2 Transparent Plastic 4.3.3 Hand Towel 4.3.4 Softening Lotion 4.3.5 Paraffin Wax 4.3.6 Soap 4.3.7 Scrub Lotion 4.3.8 Skin Oil (e.g. Liniment Oil, Aromatherapy Oil, Olive Oil) 4.3.9 Cling Wrap 4.3.10 Rubbing Alcohol 4.3.11 Rough gloves 5. Establish or acceptable procedure Hand Spa 5.1 Submerge hand in hand spa machine with wax within timeline. 5.2 Wrap hand with plastic gloves and mittens as within timeline 5.3 Remove wax from hand gradually 5.4 Apply hand softening product and massage 6. After service maintenance program 6.1 Frequent Salon Visit (Twice a Month) 6.2 3-5 Times a day application of lotion.",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care Services (Nail Care) NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care Services (Nail Care) NC II Promulgated - 36 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Checked and analyzed hand and nail conditions following salon policies and procedures 1.2 Observed proper handling of chemicals and protection 1.3 Performed washing, scrubbing and massaging of hand in accordance with established or acceptable procedure 1.4 Performed post-service activities 1.5 Followed safety rules in setting and handling, cleaning and storing of tools and equipment 1.6 Applied salon policies and procedures and industry codes of practice in application of hand and nail treatment 1.7 Consistently used effective questioning and listening techniques in ensuring client safety and comfort throughout the service 2. Underpinning knowledge 2.1 Hand Analysis 2.2 Code of Ethics 2.3 D.O.H. and OH&S Regulations 2.4 First-aid treatment 2.5 Salon Practice and Procedures 2.6 Different Hand Treatments 2.7 Different Hand Conditions 2.8 Environment and safety regulations  Occupational Health and safety  5S Procedures  3R Concepts 3. Underpinning skills 3.1 Applying Standard Procedures in hand treatment 3.2 Setting of Tools and Equipment 3.3 Proper Handling, Cleaning and Storing of Tools and Equipment 3.4 Effective Questioning and Listening Skills 3.5 Selection of Treatment Product 3.6 Time Management. 3.7 Scrubbing, Massaging Technique 3.8 Client Relations 3.9 Observing code of ethics 3.10 Compliance on DOH and OH&S requirements 3.11 Applying first-aid treatment 4. Resource implications The following resources MUST be provided: 4.1 Model 4.2 Tools, equipment and supplies/materials relevant to the activity to be performed 4.3 Work area/facilities 5. Method of assessment Competency MUST be assessed through: 5.1 Demonstration with oral questioning. 5.2 Third-Party Report 5.3 Portfolio 6. Context of assessment 6.1 Assessment may be conducted in the workplace or in a simulated environment (TESDA Accredited Training Centers)",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care Services (Nail Care) NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care Services (Nail Care) NC II Promulgated - 37 - UNIT OF COMPETENCY: PERFORM FOOT SPA UNIT CODE: HCS515330 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in performing foot spa. It involves the preparation of the clients, application of foot spa products and performing post foot spa activities. ELEMENT PERFORMANCE CRITERIA Bold & Italicized fonts are elaborated in the Range of Variables 1. Prepare client 1.1 Foot condition is checked and analyzed following salon policies and procedures 1.2 Where applicable, client is advised to defer massage at a later time 1.3 Client is advised to remove jewelries and accessories 1.4 Client’s foot is soaked in lukewarm water with soap before scrubbing 2. Clean and scrub foot 2.1 Tools, equipment, supplies and materials are prepared and used according to salon procedures 2.2 Water temperature is checked according to client heat tolerance 2.3 Foot spa is performed in accordance with established or acceptable procedure 2.4 Client’s safety and comfort is ensured during the entire process 2.5 Outcome of treatment is assessed against client’s requirements and recorded following salon procedure 3. Perform post service activities 3.1 After care advice and homecare products are recommended according to client’s needs 3.2 Tools, equipment, supplies and materials are disinfected and stored according to environment and safety regulations 3.3 Workstation is sanitized and prepared for the succeeding salon activities 3.4 Wastes are disposed according to environment and safety regulations",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care Services (Nail Care) NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care Services (Nail Care) NC II Promulgated - 38 - RANGE OF VARIABLES VARIABLE RANGE 1. Foot condition 1.1 Normal 1.2 Dry 1.3 With abrasions or cuts 1.4 With fungal infection or wounds 1.5 With open wound 2. Tools and equipment 2.1 Foot Spa Machine 2.2 Foot File 2.3 Foot Stool 2.4 Pumice Stone 2.5 Rough Gloves 2.6 Hand Brush 2.7 Foot Basin 2.8 Foot Towel 2.9 Bowl 2.10 Callous Scraper 2.11 Foot brush 3. Supplies and materials 3.1 Foot Toner 3.2 Foot Blush 3.3 Whitening Powder 3.4 Moisturizing Lotion 3.5 Antiseptics 3.6 Foot Soak 3.7 Foot Lotion 3.8 Foot Scrub Lotion 3.9 Oil 3.10 Warm Water 3.11 Henna Powder 4. Establish and acceptable procedure May include but are not limited to: 4.1 Clean feet thoroughly by soaking in liquid soap and lukewarm water within timeline 4.2 File feet thoroughly, rinse and dry after 4.3 Apply scrubbing product and slightly massage with rough mittens 4.4 Wash feet thoroughly and pat dried 4.5 Apply foot blush on the sole 4.6 Apply lotion and do the basic massage 5. Homecare products 5.1 Foot Powder 5.2 Foot Spray/Sanitizer 5.3 Foot Lotion/Moisturizer",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care Services (Nail Care) NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TR Beauty Care Services (Nail Care) NC II Promulgated - 39 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Analyzed varied condition of the foot following salon policies and procedures 1.2 Checked, handled and stored appropriate tools, equipment, supplies, materials according to OHSC requirements 1.3 Observed proper handling of chemicals and protection 1.4 Cleaned and scrubbed foot in accordance with the established or acceptable procedures 1.5 Applied treatment product as per clients needs following manufacturer’s instructions and safety practices 1.6 Applied salon policies and procedures in performing foot treatment 1.7 Applied of safety rules and regulations during the entire process 1.8 Displayed the ability to use effective questioning and listening skills in consulting and negotiating with clients 2. Underpinning knowledge and attitudes 2.1 Foot Condition 2.2 Code of Ethics 2.3 OH&S and D.O.H. Rules and Regulations requirements 2.4 Basic Foot Massage Procedure 2.5 Salon Policies and Procedures 2.6 Basic Product Knowledge 2.7 First-aid treatment 2.8 Time Management 2.9 Environment and safety regulations  Occupational Health and safety  5S Procedures  3R Concepts 3. Underpinning skills 3.1 Applying basic massage 3.2 Scrubbing procedures 3.3 Applying proper massage procedure 3.4 Handling of tools 3.5 Handling client 3.6 Managing time 4. Resource implications The following resources MUST be provided: 4.1 Model 4.2 Tools, equipment and supplies/materials relevant to the activity to be performed 4.3 Work area/facilities 5. Method of assessment Competency MUST be assessed through: 5.1 Demonstration with Oral Questioning 5.2 Third Party Report 5.3 Portfolio 6. Context of assessment 6.1 Assessment may be conducted in the workplace or in a simulated environment. (TESDA Accredited Training Centers)",
                "metadata": {
                    "source": "datasets\\raw\\Beauty Care Services (Nail Care) NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            }
        ]
    }
]