[
    {
        "name": "Caregiving NC II",
        "core_competencies": [
            {
                "page_content": "TR Caregiving NC II - 1 - CORE COMPETENCIES UNIT OF COMPETENCY: PROVIDE CARE AND SUPPORT TO INFANTS AND TODDLERS UNIT CODE: HCS323301 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to provide care and support to infants and toddlers ages from birth to three years. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Comfort infants and toddlers 1.1 Tools and equipment are prepared according to the need of the infant/toddler. 1.2 Distressed infants and toddlers are responded to based on appropriate methods, activity and non-verbal cues. 1.3 Infants and toddlers are picked up and cuddled according to procedure. 2. Bathe and dress infants and toddlers 2.1 Infants and toddlers’ vital signs are checked based on procedure. 2.2. Water quantity and temperature are checked as per requirement. 2.3 Infants and toddlers are bathed according to procedure. 2.4 Comforters are made available to infant and toddler when needed. 3. Feed infants and toddlers 3.1 Infants and toddlers’ feeding bottles are cleaned and sterilized as needed. 3.2 Milk formula is prepared as prescribed. 4. Put infants and toddlers to sleep 4.1 Infants and toddlers’ crib is prepared based on procedure. 4.2 Infants and toddlers are put to sleep based on procedure. 5. Enhance social, physical, intellectual, creative and emotional activities of infants and toddlers 5.1 Infants and toddlers are exposed to family members, relatives and playmates for communication and interaction purposes. 5.2 Infants/toddlers are provided with manipulative or creative toys and games as needed. 5.3 Infants/toddlers are given exercise activities as required.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 2 - RANGE OF VARIABLES VARIABLE RANGE 1. Tools and Equipment 1.1 Infants crib/bed 1.2 Blanket/comforters 1.3 Infant carrier 1.4 Stroller 1.5 Bassinet 1.6 Bathing paraphernalia (e.g. Baby bath tub, baby toiletries, towel, etc.) 1.7 Baby’s Layettes 1.8 Feeding bottles with cap, ring and nipple 1.9 Thermometer 1.10 Thermometer Tray 1.11 Sterilizer 1.12 Infant’s/Toddler’s Formula 1.13 Bibs 1.14 Nursery Rhymes 1.15 Toys for the Crib (Mobile) 1.16 Infants/Toddlers Toys 1.17 Story Books 2. Appropriate method or Activities 2.1 Imitating babies’ vocalizations 2.2 Talking 2.3 Singing 2.4 Laughing 2.5 Rhymes 2.6 Finger Games 2.7 Holding 2.8 Dancing 2.9 Gentle Bouncing 2.10 Substituting Activities 2.11 Playing 2.12 Distraction to an activity 2.13 Cuddles, comfort 2.14 Listening, talking with the infant or toddler quietly 2.15 Use of transition object 3. Infants/toddlers may show distress by: 3.1 Crying 3.2 Appearing withdrawn 3.3 Squirming 3.4 Lack of eye contact 3.5 Sleeping difficulties 3.6 Whining",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 3 - VARIABLE RANGE 3.7 Not playing or not playing creatively 3.8 Repetitive display of trauma 3.9 Aggression 3.10 Regression 3.11 Speech difficulties (e.g. Stuttering) 3.12 Toilet training difficulties 3.13 Nervous tics (e.g. Cough) 3.14 Hunger 3.15 Tiredness 3.16 Discomfort 3.17 Fear 3.18 Anxiety 3.19 Boredom 3.20 Clinging behavior 4. Non Verbal Cues 4.1 Cues to indicate distress 4.2 Response to an interesting activity 4.3 Smiling 4.4 Cues that express a desire to engage in an activity of interaction 5. Comforters 5.1 Special toys 5.2 Blankets 5.3 Dummies",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 4 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Responded to distressed infants and toddlers in a relaxed and calm manner. 1.2 Took vital signs, bathed and dressed/undressed infant/toddler. 1.3 Prepared milk formula and fed infant as prescribed. 1.4 Cleaned and sterilized feeding bottles. 1.5 Put infants/toddlers to sleep. 1.6 Enhanced social, physical, intellectual, creative and emotional activities of the infant/toddler. 1.7 Demonstrated the ability to assess infants/toddlers’ needs appropriately. 2. Underpinning knowledge and attitudes 2.1 The Dependent Nature of Infants/Toddlers 2.2 Bathing Paraphernalia and; Types, Uses, Specification 2.3 Procedures in Taking Vital Signs 2.4 Basic Infant Care 2.5 Procedures in Bathing and Dressing/Undressing of infants 2.6 Infant Diet 2.7 Procedures in Feeding 2.8 Types and Uses of Clothes and Underwear 2.9 Specifications and Uses of Non-Slip Rubber Mat 2.10 Hand Washing Procedures 2.11 Specifications of Different Types of Thermometer 2.12 Table Etiquette 2.13 Signs of Infants/Toddlers Distress 3. Underpinning skills 3.1 Communication Skills (listening, speaking, verbal and non-verbal) 3.2 Empathy 3.3 Interpersonal Skills 3.4 Creative Skills 3.5 Ability to establish bonding with infant/toddler 3.6 Basic Measurement 4. Resource implications The following resources MUST be provided: 4.1 A childcare workplace 4.2 Facilities, equipment and materials relevant to the unit of competency 5. Method of assessment Competency MUST be assessed through: 5.1 Demonstration with questioning 5.2 Interview 6. Context of assessment 6.1 Competency may be assessed in the workplace or in a simulated work setting.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 5 - UNIT OF COMPETENCY: PROVIDE CARE AND SUPPORT TO CHILDREN UNIT CODE: HCS323302 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to provide care and support to children between three (3) years old and twelve (12) years old. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Instill personal hygiene practices to children 1.1 Hygiene practices are explained clearly to children based on established procedures. 1.2 Personal hygiene procedure is demonstrated to children based on health and safety procedures. 1.3 Children paraphernalia are maintained based on healthy procedures. 2. Bathe and dress children 2.1 Children’s vital signs are checked before bathing based on procedures. 2.2 Bathing paraphernalia are prepared as per procedure. 2.3 Bath water quantity and temperature are checked based on health requirements of the child. 2.4 Children are assisted in dressing up according to prevailing weather condition 2.5 Children’s preferences and decisions are acknowledged, respected and followed whenever appropriate and possible 2.6 Children with difficult behavior in bathing are dealt with appropriately as per procedure. 3. Feed children 3.1 Nutritional requirements of children are determined according to their developmental stage. 3.2 Menu is prepared in accordance with children’s nutritional and cultural requirements. 3.3 Appetizing food and drink are prepared and served sufficiently and appropriately according to the child’s health needs and preferences. 3.4 Children are fed following healthy procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 6 - RANGE OF VARIABLES VARIABLE RANGE 1. Children’s paraphernalia 1.1 Bathing paraphernalia and toiletries 1.2 Diaper 1.3 Clothes 1.4 Grooming Kit (baby hairbrush, comb, nail scissors) 1.5 Oral Hygiene (toothbrush, toothpaste) 1.6 Feeding Utensils 1.7 Bibs 1.8 High Chair/Booster Seat/Portable Seat 1.9 Thermometer 1.10 Thermometer Tray 2. Nutritional requirements 2.1 Nutritious food 2.2 Balance Diet 2.3 Relevant nutritional needs according to age level 3. Menu 3.1 Breakfast 3.2 Lunch 3.3 Dinner 3.4 Snacks 4. Cultural requirements 4.1 Meal patterns over a day 4.2 Drinks provided 4.3 Foods used 4.4 Hot or cold meals 4.5 Spices and flavorings used 4.6 Inclusion of sweets 5. Appetizing food 5.1 Color 5.2 Shape 5.3 Texture 5.4 Variety 6. Health needs of children 6.1 Medical advice and diet 6.2 Allergies to certain foods 7. Food and drink preferences 7.1 Culture 7.2 Dietary Requirements 7.3 Religion 7.4 Age 7.5 Family Patterns 7.6 Individual Tastes 7.7 Stage of the Day",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 7 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment may requires evidence that the candidate: 1.1 Demonstrated ability to prepare nutritious foods suitable for children. 1.2 Instilled personal hygiene practices to children. 1.3 Took vital signs before bathing the child. 1.4 Demonstrated feeding procedures. 2. Underpinning knowledge and attitudes 2.1 Bathing and Dressing/Undressing Procedures 2.2 Procedures of Feeding Children 2.3 Procedures in Taking Vital Signs 2.4 Proper Health Care of Children 2.5 Hand Washing Procedures 2.6 Table Etiquette 2.7 Good Grooming 2.8 Nutritional Needs of Children 2.9 Fat Contents of Foods 2.10 Dietary Requirements for Infants 2.11 Cultural Practices and Beliefs about Food Provision 2.12 Impact of Foods and Drinks on Dental Health 2.13 Storage of Food – Temperatures 2.14 Food Preparation and Cooking 3. Underpinning skills 3.1 Cooking and Preparing Food 3.2 Menu Planning 3.3 Basic Measurements 4. Resource implications The following resources MUST be provided: 4.1 A childcare workplace 4.2 Facilities, equipment and materials relevant to the unit of competency 5. Method of assessment Competency MUST be assessed through: 5.1 Demonstration with questioning 5.2 Interview 6. Context of assessment 6.1 Competency may be assessed in the workplace or in a simulated work setting.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 8 - UNIT OF COMPETENCY: FOSTER THE SOCIAL, INTELLECTUAL, CREATIVE AND EMOTIONAL DEVELOPMENT OF CHILDREN UNIT CODE: HCS323303 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to foster the social, intellectual, creative and emotional development of children from 1 - 12 years old. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Foster children’s independence and autonomy 1.1 Opportunities to develop self-help skills and independence are provided as needed. 1.2 Children are given opportunities to make choice in appropriate ways taking into consideration their individual differences. 1.3 Children are encouraged to accept responsibility for their own actions. 1.4 Opportunities are created for children to participate in decision making. 2. Encourage children to express their feelings, ideas and needs 2.1 Children are encouraged to express their feelings, ideas and needs based on social norm. 2.2 Children are provided with activities as means of releasing their feelings according to their interests and needs. 2.3 Children are encouraged to respect each other’s individual needs, abilities and interest. 3. Stimulate children’s awareness and creativity 3.1 Children are encouraged to express their imagination and creativity based developmental needs. 3.2 Children are provided with activities that would support awareness of the range of movements of their own body based on developmental needs. 3.3 Materials and experiences are provided that would stimulate their various senses based on their interests. 3.4 Experiences that develop and enhance imagination and creativity are provided based on their interests. 4. Foster children’s self-esteem and development of self-concept 4.1 Opportunities are provided for children to experience their individual strengths and needs. 4.2 Acknowledgement and positive support are given based on child experience negative feeling (frustration, aggression, depression, fear and anxiety). 4.3 Activities that present a challenge within the child’s needs and capabilities are provided based on developmental stage. 4.4 Individual differences are acknowledged and respected based on child’s development stage. 4.5 Children’s achievements are acknowledged and appreciated based on preference. 4.6 Children’s positive self-worth and self-esteem are enhanced.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 9 - RANGE OF VARIABLES VARIABLE RANGE 1. Opportunities 1.1 Socio-dramatic play 1.2 Movement 1.3 Listening to music 1.4 Art experiences including day and finger painting 2. Individual differences 2.1 Age 2.2 Gender 2.3 Family background and lifestyle 2.4 Abilities and disabilities 2.5 Style of social interaction 2.6 Appearance 2.7 Cultural beliefs and practices 2.8 Temperament 2.9 Interests 2.10 Peer group acceptance, membership or isolation 3. Children’s activities Children’s activities are carried out with the use of the following: 3.1 Playpen with approximate toys according to age group (cradle toys, objects to explore by mouth, swinging toys, rattles, toys to poke, squeeze and push along 3.2 Audio Visual Equipment (radio cassette, TV) 3.3 Coloring Books 3.4 Crayons 3.5 Pencils 3.6 Peg Boards 3.7 Beads to String 3.8 Construction Sets 3.9 Scissors 3.10 Paper 3.11 Color 3.12 Paint/Short Fat Paint Brushes 3.13 Play Dough 3.14 Activity Kit 3.15 Puzzles 3.16 Books 3.17 Manual",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 10 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Demonstrated ability to evaluate the emotional and psychological stage of the child and to plan activities which will enhance their development 1.2 Demonstrated ability to assist children to be creative through providing a stimulating and challenging environment, taking into account child’s age, development, culture and abilities 1.3 Demonstrated ability to engage children in a range of developmental opportunities which are matched to their developmental stage and specific needs 2. Underpinning knowledge and attitudes 2.1 Psychology of Children 2.2 Cultural Awareness 2.3 Processes for Creative and Artistic Expression 2.4 Children Developmental Stages 2.5 Understanding of Children’s Physical and Skills Development 2.6 Children’s Needs, Interests and Problems 3. Underpinning skills 3.1 Planning 3.2 Interpersonal Skills 3.3 Motivational Skills 4. Resource implications The following resources MUST be provided: 4.3 A childcare workplace 4.4 Facilities, equipment and materials relevant to the unit of competency 5. Method of assessment Competency MUST be assessed through: 5.1 Demonstration with questioning 5.2 Interview 6. Context of assessment 6.1 Competency may be assessed in the workplace or in a simulated work setting.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 11 - UNIT OF COMPETENCY: FOSTER PHYSICAL DEVELOPMENT OF CHILDREN UNIT CODE: HCS323304 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to foster specific physical development of children from 1 - 12 years old. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Enhance physical activities of children 1.1 Children are provided with tools and equipment based on physical development needs. 1.2 Children are given exercise or activities based on needs. 2. Create opportunities for children to develop a wider range of physical development 2.1 Children are provided opportunities to develop their physical skills based on development needs. 2.2 Children are given the opportunities to develop themselves physically in accordance with resources available. 2.3 Equipment and tools are made available based on needs. 2.4 Opportunities for physical development are provided based on child’s stage of growth and development. 2.5 Children are monitored and encouraged to develop healthy sleeping patterns and practices based on physical needs. 4. Provide experience to support physical development of children 4.1 Experiences are provided which will develop and enhance physical fitness. 4.2 Encouragement is given to children to learn to develop habit forming physical activities 4.3 Ways and means for the child to participate in physical fitness are communicated, modeled and practiced",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 12 - RANGE OF VARIABLES VARIABLE RANGE 1. Tools and equipment 1.1 Playpen with approximate toys according to age group (cradle toys, objects to explore by mouth, swinging toys, rattles, toys to poke, squeeze and push along 1.2 Audio Visual Equipment (radio cassette, TV) 1.3 Coloring Books 1.4 Crayons 1.5 Pencils 1.6 Peg Boards 1.7 Beads to String 1.8 Construction Sets 1.9 Scissors 1.10 Paper 1.11 Color 1.12 Paint/Short Fat Paint Brushes 1.13 Play Dough 1.14 Activity Kit 1.15 Puzzles 1.16 Books 1.17 Manual 2. Opportunities to support children’s development will vary according to a number of factors such as: 2.1 Child/Worker Ratios 2.2 Physical Environment – Constraints & Potential 2.3 Purpose of the Service 2.4 The amount and type of support from parents and participation by parents 2.5 The level of support available to the service from external bodies e.g. advice specialist services, resource workers 2.6 The frequency and regularity of use of the service by the child 2.7 Age of the Child 3. Physical skills 3.1 Skills in motor areas – fine and gross motor 3.2 Dexterity 3.3 Eye – Hand Coordination 3.4 Balance 3.5 Locomotion 3.6 Coordination 4. Opportunities to develop physical fitness skills may include: 4.1 Active Games 4.2 Sports 4.3 Exercises 4.4 Setting up venue/environment 4.5 Range of environments and equipment 4.6 Socio dramatic play 4.7 Play with construction materials 4.8 Art activities 5. Opportunities to develop relevant physical skills will vary according to the age/disability of the child - 5.1 For infants 5.1.1 Equipment and toys such as cradle toys, objects to explore by mouth, swinging toys, rattles, toys to poke, squeeze and push along 5.2 For Toddlers 5.2.1 Opportunities provided to practice new skills of walking, climbing, balancing and pushing and pulling wheeled toys 5.3 For 3 to 5 years old",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 13 - VARIABLE RANGE 5.3.1 Opportunities to develop fine motor skills such as puzzles, peg boards, beads to string, construction sets, crayons, brushes, scissors 5.3.2 Opportunities to practice large muscle skills such as running, jumping, catching a ball etc. 5.4 For 6 to 12 years old 5.4.1 Opportunities for development of balance, skilled climbing, riding, skating opportunities to develop skills in running kicking, catching, skipping, throwing, writing, drawing, gluing etc. 6. Opportunities provided to develop skills may be needed to adapt to factors such as: 6.1 Indoor and Outdoor Facilities 6.2 Environment 6.3 Venue/Location 6.4 Type of Service 6.5 Workers own physical capabilities 6.6 The desire for children to set up equipment themselves 6.7 Safety considerations 6.8 Peer group pressure 7. Advice may be sought from: 7.1 Physiotherapist 7.2 Occupational Therapist 7.3 Other Staff 7.4 Parents",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 14 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Demonstrated ability to engage children in a range of developmental opportunities which are matched to their developmental stage and specific needs 2. Underpinning knowledge and attitudes 2.1 Knowledge and understanding of children’s physical development and skill development 2.2 Acceptance of each child’s rate of development, needs, interests and strengths 2.3 Experiences that will target specific areas of physical development 2.4 Needs of children with a sensory/physical disability 2.5 Equipment, toys and resources that can be used to stimulate physical development 2.6 Knowledge of interaction between physical development and other areas of development – especially social and psychological development 2.7 Relevant organizational standards, policies and procedures 3. Underpinning Skills 3.1 Planning 3.2 Interpersonal Skills 3.3 Motivational Skills 4. Resource implications The following resources MUST be provided: 4.1 A childcare workplace 4.2 Facilities, equipment and materials relevant to the unit of competency 5. Method of assessment Competency MUST be assessed through: 5.1 Interview/oral questioning 6. Context of assessment 6.1 Competency may be assessed either in the workplace or in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 15 - UNIT OF COMPETENCY: PROVIDE CARE AND SERVICES TO ELDERLY UNIT CODE: HCS3233 05 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required in providing support and assistance to maintain quality care for the elderly to meet his/her daily needs including nourishment, mobility, personal hygiene and other support within the plan of care. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Establish and maintain an appropriate relationship with the elderly 1.1 Self introduction by the caregiver to the elderly client is done based on established procedures. 1.2 Appropriate attitudes such as confidentiality, privacy, courtesy and respect are adhered to and demonstrated towards the elderly based on established procedures. 1.3 The elderly’s own interest, rights, freedom and decision-making are supported and respected based on established procedures. 1.4 Short interpersonal exchanges with the elderly in establishing, developing and maintaining rapport are encouraged. 2. Provide appropriate support to the elderly 2.1 All support is provided to the elderly in accordance with the elderly’s needs, rights, self-determination and individual differences. 2.2 The elderly is encouraged and supported to participate in ceremonial, cultural, educational, recreational, religious, social, and spiritual activities as appropriately planned. 2.3 Assistance is provided at all times in order to maintain a safe and healthy environment, including minimizing physical dangers and risk of infections based on established procedures. 2.4 Proper response to situations of risks to health and safety is provided and maintained based on established procedures. 3. Provide assistance with elderly’s personal care needs 3.1 Personal preferences are identified in consultation with the elderly and a plan for execution is mapped out based on established procedures. 3.2 The elderly is supported and encouraged in exercising their rights and personal preferences without compromising their safety and those of others and in accordance with established procedures. 3.3 Short interpersonal exchanges, clarifying meaning and maintaining interaction to identify the elderly’s preferences are conducted based on established procedures. 3.4 Time is scheduled to effectively listen to the elderly’s preferences to maximize his/her well-being.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 16 - ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 4. Provide assistance with the elderly’s personal care needs 4.1 The elderly’s personal care needs (aids to daily living) are identified and assistance provided. 4.2 Specific concerns and difficulties in meeting some personal care needs are identified, clarified and modified with the elderly in order to effectively address such concerns and problem needs. 4.3 Assistive devices for providing assistance for the elderly are identified and used as appropriate. 4.4 Organizational policies and practices for reporting are followed as appropriate. 4.5 The elderly’s self-esteem and confidence are enhanced. 4.6 Provisions for interaction between the elderly and the community are researched and developed. 4.7 Developmental and progressing personal care needs are identified, acknowledged and provided for as appropriate. 4.8 Empathy is demonstrated in supporting and caring for the elderly’s feelings of grief and loss.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 17 - RANGE OF VARIABLES VARIABLE RANGE 1. Elderly rights may be detailed in: 1.1 Service/outcomes standards documents 1.2 Legislation 1.3 Organizational policies and practices 2. Short interpersonal exchanges 2.1 Chatting in friendly manner 2.2 Inquiring about the elderly’s health 2.3 Short casual exchanges 2.4 Effective communication 2.5 Dialogue 2.6 Question and answer/interview techniques 3. Needs of the elderly 3.1 Physical, sexual 3.2 Financial 3.3 Household assistance and maintenance 3.4 Religious 3.5 Cultural 3.6 Spiritual 3.7 Recreational 3.8 Social and emotional 3.9 Intellectual 4. Factors contributing to individual difference 4.1 Culture 4.2 Age 4.3 Economic 4.4 Social 4.5 Gender 4.6 Physical 4.7 Intellectual 4.8 Language 4.9 Spiritual 4.10 Marital Status 5. Assistance 5.1 Providing information and advice 5.2 Accompanying or providing specific services 5.3 Encouragement and support for decisions and actions 5.4 Companionship 6. Maximum well being 6.1 Independent living 6.2 Observation of own customs and cultural practices coming and going from environment with safety 6.3 Belonging to social groups 6.4 Frequent visits to and from family, relatives and friends 6.5 Companionship 6.6 Efficient care from caregiver 7. Personal care needs 7.1 Daily living including: 7.1.1 Maintaining personal safety 7.1.2 Communication (speech, writing, non-verbal communication) 7.1.3 Eating and drinking 7.1.4 Eliminating 7.1.5 Breathing 7.1.6 Mobilizing and transferring (moving from place to place and position to position) 7.1.7 Attending to personal hygiene (bathing, laundering personal linen)",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 18 - VARIABLE RANGE 7.1.8 Dressing and undressing 7.1.9 Attending to own spiritual needs 7.1.10 Grooming and expressing sexuality 7.1.11 Toileting 7.1.12 Keeping appointments (Doctors, Dentists, Bankers, Lawyers) 7.1.13 SPICE (Spice, Physical, Intellectual, Creative and Emotional) activities 7.2 Daily Routine 7.2.1 Accessing education and employment 7.2.2 Accessing financial resources and allowances 7.2.3 Paying bills and regular outgoings 7.2.4 Shopping 7.2.5 Preparing meals 7.2.6 Climbing stairs 7.2.7 Maintaining household (cleaning, laundry, décor, repair) 7.2.8 Traveling by private and public transport 7.2.9 Interacting with others and socializing 7.2.10 Accessing leisure, recreational and sporting activities 7.3 Assisting with self-administration of medication according to: 7.3.1 Organizational practice and policy 7.3.2 Government regulation, policy and legislation 7.3.3 Instructions from the elderly, their trustees, medical team and significant others 7.4 Physical comfort and rest 7.4.1 Appropriate rest 7.4.2 Proper clothing 7.4.3 Fit dentures 7.4.4 Aids (wheelchairs, braces, walker, reading glasses) 7.4.5 Comfortable bed and chair 7.5 Privacy 7.6 Confidentiality 7.7 To be treated in a dignified, safe and comfortable manner 7.8 To express success, satisfied or own feelings 8. Assistive Devices 8.1 Wheelchair 8.2 Walker 8.3 Cane 8.4 Crutches 8.5 Parallel Bars 8.6 Feeding Utensils 8.7 Handrails 8.9 Commode 8.10 Reading Materials 9. Appropriate communication and relationship building processes 9.1 Courtesy 9.2 Empathy 9.3 Non-judgmental manner 9.4 Listening 9.5 Treating the elderly person as an individual 9.6 Respect for difference 9.6.1 Cultural 9.6.2 Physical 9.6.3 Emotional",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 19 - VARIABLE RANGE 9.6.4 Beliefs 9.6.5 Customs 9.6.6 Values 9.6.7 Religions 10 Assistance may vary according to: 10.1 The ability of the worker 10.2 Mental well being 10.3 Physical well being 10.4 Social well being 10.5 Emotional well being 10.6 Creative well being 11. Factual information to identify the elderly’s preferences may be gathered by: 11.1 Asking questions 11.2 Observing the elderly 11.3 Asking for clarification from the elderly 11.4 Asking other significant people such as relatives, friends, staff 11.5 Listening for relevant information concerning the elderly’s preferences 11.6 Offering choices and suggestions 11.7 Consulting professionals’ opinions and suggestions for the elderly to consider 12. Assistance may vary according to: 12.1 The ability of the worker 12.2 Mental well being 12.3 Physical well being 12.4 Social well being 12.5 Emotional well being 12.6 Creative well being 13. Processes and aides may include: 13.1 Meals on wheels 13.2 All equipment and aids 13.3 Transport services 13.4 Around the clock caregiver 13.5 Occasional caregiver 13.6 Senior lodges accommodation 13.7 Trips to or visits from medical team 14. Reporting may include: 14.1 Changes in appearance and behavior in accordance with reporting instructions 14.2 Medicine chart 14.3 Observation log book 14.4 Incident and Accident Reports 15. Reporting may be to: 15.1 Supervisors 15.2 Colleagues 15.3 Health workers 15.4 Administrator 15.5 Health care services 15.6 Emergency services 15.7 Community care 15.8 Social services 15.9 Relatives 16. Reporting may be via: 16.1 Telephone 16.2 Hand over reports 16.3 Face to face 16.4 Written",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 20 - VARIABLE RANGE 17. Social and personal well being may include: 17.1 Being independent 17.2 Maintenance of personal contacts 17.3 Control of financial affairs 17.4 Coming and going from environment within safety requirements 17.5 Observation of own customs and cultural practices 17.6 Exercising legal, social and other obligations and responsibilities 17.7 Keeping and maintaining personal possessions 17.8 Privacy 17.9 Access and entitlement to respite and other services 17.10 Maintaining community participation 17.11 Participation in programs and activities 17.12 Sharing knowledge and skills 18. Well being may vary according to: 18.1 Service provision environment e.g. independent living, residential care facility, day center 18.2 Health Status 18.3 Worker’s Role 18.4 SPICE Status 19. Provision of aids may include: 19.1 Referral to advisory centers 19.2 Information 20. Spiritual needs may include: 20.1 Formal and informal religious observance 20.2 Need for private time and space for contemplation 20.3 Ceremonial Observances 21. Aids may include: 21.1 Mobility 21.2 Hearing 21.3 Speech 21.4 Vision 22. The elderly’s self esteem and confidence may be encouraged by: 22.1 Assisting the elderly with difficult tasks 22.2 Clarifying and discussing the elderly’s abilities and disabilities 22.3 Encouraging the elderly to try new activities 23. Psychological needs 23.1 Freedom from undue stress 23.2 Self-esteem 23.3 Purpose 23.4 Personal identity 23.5 Life stage development",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 21 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Worked within roles and responsibilities in a manner which accommodates and accepts individual differences of the elderly 1.2 Established and maintained appropriate relationship with the elderly 1.2 Provided appropriate support and assistance with the elderly’s personal care needs 1.3 Understood and adhered to own roles and responsibilities 1.4 Understood accountability and responsibility of supervisors and colleagues 1.5 Consulted with the elderly, including asking questions, observing, listening and suggesting 1.6 Recognized and understood the elderly’s rights and personal preferences including the ability to list the elderly’s preferences. 1.7 Demonstrated a non-judgmental attitude to the different emotional, psychological and spiritual needs of the elderly in all communications 2. Underpinning Knowledge and Attitudes 2.1 Types, uses, specifications and maintenance of bathing paraphernalia 2.2 Procedures of bathing and dressing the elderly 2.3 Proper care of elders 2.4 Principles and procedures in taking vital signs 2.5 Common signs and symptoms of common illnesses 2.6 Principles and procedures of medicine administration 2.7 Relevant plan of care, roles and responsibilities of caregiver 4.3 Relevant policies, protocols and practices of the certain organizations in relation to services to the elderly 2.9 Process of ageing 2.10 Different religious, cultural, spiritual, physical and ceremonial perspectives 2.11 Causes, implications and treatment of dementia and other elderly related conditions 2.12 Depending on the work, roles or services provided, specific knowledge of particular groups or issues may be required like: 2.12.1 Alcohol and other drugs 2.12.2 Cultural and linguistic diversity 2.12.3 Risk of self-harm 2.12.4 Women 2.12.5 Men 2.12.6 Community education 2.12.7 Mental health 2.13 Common problems of the elderly and their ramifications 2.14 Different cultural requirements and preferences 2.15 Factors giving rise to grief and loss in the elderly 2.16 Safety risks to the elderly 2.17 Major systems of the body",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 22 - 3. Underpinning skills 3.1 Ability to establish and maintain a relationship that takes into account the elderly’s individual differences (e.g. age, abilities, disabilities, cultural background) 3.2 Oral communication skills (language skills) and non-verbal communication skills (e.g. touch, smiling, etc.) necessary to develop a trusting relationship with an elderly. Language skills may be English, mother language or technical language (medical terms) as required by employment service or organization 3.3 Oral communication skills (language competence) required to fulfill job roles as specified by the employment organization/service. Oral communication skills include asking questions, clarifying understanding of the elderly’s preferences and expressing encouragement in oral communication. Service/organization may require competence in English or native language, as required by the elderly. 3.4 Reading and writing skill (literacy competence) required to fulfill job roles as specified by employment organization/service. The level of skills may range from the ability to write short messages or a shopping list, to assist the elderly with banking, reading of mail, answering the phone, receiving messages etc. the employment service/organization may require competence in a language other than English, depending on job request 3.5 Basic counseling 4. Resource implications The following resources MUST be provided 4.1 A childcare workplace 4.2 Facilities, equipment, supplies and materials relevant to the unit of competency 5. Method of assessment Competency MUST be assessed through: 5.1 Demonstration with questioning 5.2 Interview 6. Context of assessment 6.1 Competency may be assessed in the workplace or in a simulated work setting.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 23 - UNIT OF COMPETENCY: PROVIDE CARE AND SUPPORT TO PEOPLE WITH SPECIAL NEEDS UNIT CODE: HCS323306 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required in providing support and assistance to maintain quality care for people with special needs to be able to enhance their abilities to communicate and be independent; responding to the physical, medical, health and safety, personal care and home maintenance requirements of people with disabilities. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Establish and maintain appropriate relationship with people with special needs 1.1 All dealings with people with special needs are aimed at generating a trusting relationship which include protecting confidentiality, privacy, individual choices and the right to decision making. 1.2 Respect for individual differences is demonstrated in all dealings with people with special needs. 1.3 Support for the interests, rights and decision making of people with special needs is demonstrated in all dealings. 1.4 People with special needs are actively encouraged and supported to communicate ideas, feelings and preferences. 2. Provide appropriate support to people with special needs 2.1 All support to people with special needs are provided in accordance with their needs, rights and self determination. 2.2 Assistance is provided to people with disabilities according to the employment organization guidelines. 2.3 Information required by people with special needs are identified and provided. 2.4 Reactions and limitations regarding differences are recognized and appropriate assistance is sought to ensure that the rights of people with special needs are upheld. 3. Assist in maintaining well being of people with special needs. 3.1 People with special needs are provided with support in maintaining a clean, safe and comfortable environment. 3.2 Situations of risk to health and safety are responded to in accordance with established and approved health and safety procedures. 3.3 People with special needs are actively encouraged to practice self expression. 3.4 Rights and responsibilities of people with special needs are discussed with them professionally and in a non-threatening and non-critical ways. 3.5 Strategies are developed for people with special needs to assert self terms of accomplishments and achievements.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 24 - ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 4. Assist people with special needs to identify and meet their needs 4.1 The dignity, privacy and personal choice of people with special needs in relation to needs are upheld. 4.2 People with special needs are assisted to identify, select and prioritize their specified nursing needs. 4.3 People with special needs are assisted to identify, select, prioritize and fulfill or implement their social, physical, intellectual, creative and emotional activities. 4.4 People with special needs are assisted to select and develop strategies to meet their requirements in order to achieve their nursing needs. 5. Assist people with special needs in maintaining an environment that enables maximum independent living 5.1 The types, frequency and triggers of challenging behaviors of a person with special needs are identified, assessed and researched. 5.2 Strategies for the prevention and management of challenging behavior/s are planned and implemented according to approved safety procedures. 5.3 People with special needs are encouraged and supported to express self. 5.4 Independent thinking (such as decision, opinion and preferences) by people with special needs are encouraged and supported. 5.5 Strategies that would promote independence of people with special needs are developed and implemented.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 25 - RANGE OF VARIABLES VARIABLE RANGE 1. Tools and equipment 1.1 Bed with side rails 1.2 Night Light 1.3 Handrails 1.4 Assistive device (wheelchair, cane, walker and crutches 1.5 Commode 1.6 Feeding Utensils 1.7 Clock 1.8 Reading Materials 1.9 Activity Kit 2. Individual differences 2.1 Daily living such as: 2.1.1 Culture 2.1.2 Age 2.1.3 Economic 2.1.4 Social 2.1.5 Gender 2.1.6 Physical 2.1.7 Emotional 2.1.8 Intellectual 2.1.9 Language 2.2 Rights may be detailed in: 2.2.1 Service/outcomes standards 2.2.2 Legislation 2.2.3 Organizational policies and practice 2.3 Support will be in the Context for services offered including: 2.3.1 Personal support 2.3.2 Employment support 2.3.3 Community access 2.3.4 Accommodation support 2.3.5 Lifestyle support 3. Assistance 3.1 Providing information 3.2 Assistance with mobility or providing specific support such as transport 3.3 Encouragement and support for decisions and actions 3.4 General household assistance and maintenance 4. Differences 4.1 Individual (age, gender, ability, history, personal preferences) 4.2 Cultural 4.3 Spiritual 4.4 Sexual preference 5. Rights 5.1 Choose for oneself",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 26 - VARIABLE RANGE 5.2 Have meaningful work 5.3 Privacy 5.4 Dignity 5.5 Confidentiality 5.6 Self determination 5.7 Appropriate support 5.8 Skill development 5.9 Advocacy 5.10 Being treated as a valued individual 5.11 Fair treatment 5.12 Right to enter into a relationship 5.13 Right to express sexuality 6. Responsibilities 6.1 Act within the law 6.2 Treat others with consideration and respect 6.3 Abide by family obligations 6.4 Abide by the policies and procedures of the services being used 7. Personal needs may include providing assistance with: 7.1 Daily living including: 7.1.1 Maintaining personal safety 7.1.2 Communication (speech, writing, non-verbal communication) 7.1.3 Eating and drinking 7.1.4 Eliminating 7.1.5 Breathing 7.1.6 Mobilizing and transferring (moving from place to place and position to position) 7.1.7 Attending to personal hygiene (bathing, laundering personal linen) 7.1.8 Dressing and undressing 7.1.9 Attending own spiritual needs 7.1.10 Grooming and expressing sexuality 7.2 Physical/instrumental activities of daily living: 7.2.1 Accessing education and employment 7.2.2 Accessing financial resources and allowances 7.2.3 Paying bills and regular outgoings 7.2.4 Shopping 7.2.5 Preparing meals 7.2.6 Climbing stairs 7.2.7 Maintaining household (cleaning, laundry, décor, repairs) 7.2.8 Traveling by private and public transport",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 27 - VARIABLE RANGE 7.2.9 Interacting with others and socializing 7.2.10 Accessing leisure, recreational and sporting activities 7.3 Assisting with self-administration of medication according to: 7.3.1 Organizational practice and policy 7.3.2 Government regulation, policy and legislation 7.4 Physical comfort and rest 7.5 Pain management 7.6 Maximization of independence and personal preferences 7.7 Empowerment e.g. Enhancing of clients ability to communicate, act independently and uphold rights and responsibilities 8. Strategies to meet needs 8.1 Responding to requirements arising from differences 8.2 Utilizing personal support equipment e.g. chair lifts, wheelchairs, hearing impaired phones, etc. 8.3 Enlisting specialist skills 9. Support may be provided: 9.1 In the client's home 9.2 At residential or other services 10. Relevant legislation and policies on health and safety 10.1 Occupational health and safety 10.2 State health acts 10.3 EEO legislation 10.4 Organizational policies and guidelines 10.5 Daily living 10.6 Medications 10.7 Dealing with changes in physical or mental well-being 10.8 Occupational Health and Safety 10.9 Sexual Harassment 10.10 Abuse prevention 11. Prevention and management of challenging behavior 11.1 Recognizing triggers and deflecting them 11.2 Using active listening and observation skills 11.3 Ensuring effective communication 11.4 Seeking expert assistance",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 28 - EVIDENCE GUIDE 1. Critical aspects of competency: Assessment requires evidence that the candidate: 1.1 Established and maintained appropriate relationship with people who have special needs 1.2 Provided appropriate support to people with special needs 1.3 Assisted in maintaining the well being of people with special needs 1.4 Assisted people with special needs to identify and meets their needs 2. Underpinning knowledge and attitudes 2.1 Relevant organizational policies and procedures and responsibilities within it 2.2 Relevant policies, protocols and practices of the organization in relation to own work activities 2.3 Basic knowledge of different types of disabilities and their effects on clients need 2.4 Understanding of support requirements for people with special needs 2.5 Different religious, cultural, spiritual, physical, specific knowledge of particular groups or issues may be required like the following: 2.5.1 Alcohol and other drugs 2.5.2 Cultural and linguistic diversity 2.5.3 Risk of self harm 2.5.4 Women 2.5.5 Men 2.5.6 Community education 2.5.7 Mental health 2.6 Organizational philosophy and goals 2.7 Legislative provision in relation to the rights of people with disabilities 2.8 Basic knowledge of human, social, psychological, cognitive and physical development 4.4 Role and responsibility of self and others in the organization 4.5 Organization’s definition of challenging behavior 4.6 Relevant support equipment (and technologies) and related occupational health and safety requirements regarding their use 2.10 Impact of particular types of disability 2.11 Principles of empowerment/disempowerment in relation to people with special needs 2.12 Occupational health and safety guidelines 2.13 Cultural factors affecting people with special needs requirements",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 61
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 29 - 2.14 Understanding of regulations and guidelines governing the handling of medication 3. Underpinning skills 3.1 Interpersonal skills appropriate to work with people with special needs 3.2 Oral communication skills (language skills) necessary to develop a trusting relationship with people with special needs. Language may be English or community language as required by service or organization 3.3 Communication 3.4 Team work 3.5 Negotiation 3.6 Use of equipment 3.7 Interpersonal communication 3.8 Observation as required by job role 3.9 Assessment as required by job role 4. Resource implications The following resources MUST be provided: 4.1 A child care workplace 4.2 Facilities, equipment, tools, supplies and materials relevant to the unit of competency. 5. Method of assessment Competency MUST be assessed through: 5.1 Demonstration with questioning 5.2 Interview 6. Context of assessment 6.1 Competency may be assessed in the workplace or in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 62
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 30 - UNIT OF COMPETENCY: MAINTAIN A HEALTHY AND SAFE ENVIRONMENT UNIT CODE: HCS323307 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to maintain various aspects in home maintenance taking into consideration health and safety environment. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Maintain a clean and hygienic environment 1.1 Cleaning occurs as an ongoing process as per regulations. 1.2 Appropriate cleaning agents, tools and equipment are used in accordance with established procedures. 1.3 Infection control procedures are followed according to established procedures. 1.4 Ventilation, lighting and heating/cooling are adequately maintained. 1.5 Personal hygiene/health procedures are adhered to at all times. 1.6 Beds and bedding are cleaned to conform to health, hygiene and safety requirements as relevant. 2. Provide a safe environment 2.1 Organizational policies and procedures on safety are implemented as required. 2.2 Environment protection policy is implemented. 2.3 Tools, equipment, toys and games are appropriate to the age of the child. 2.4 Equipment is selected, checked and maintained to ensure safety. 2.5 The environment is set up to ensure safety of the client. 2.6 Area is checked for hazards and risks reduction strategies are implemented 2.7 Fire exits are kept unobstructed 2.8 Disposal of waste materials is conducted in a safe and hygienic way 2.9 Cleaning materials are stored safely 3. Supervise the safety of clients 3.1 Clients are supervised in accordance with legal requirements and regulations. 3.2 Rules for safe play are explained, modeled and implemented. 3.3 Direct contact with individuals/group is maintained. 3.4 Potential risks are identified and acted upon to prevent/minimize risks. 3.4 Hazards and potential hazards in the environment are identified and clients are informed accordingly. 3.5 Emergencies and evacuation procedures are discussed and practiced with clients. 3.6 Supervision is used as an opportunity to interact with clients.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 63
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 31 - RANGE OF VARIABLES VARIABLE RANGE 1. Tools and equipment 1.1 Cleaning materials (e.g. detergent soap, brush, broom, mop, rags, glass wiper) 1.2 Vacuum Cleaner 1.3 Play area with appropriate toys and padding 2. Legal requirements and regulations regarding supervision 2.1 Staff/children ratios 2.2 Babies are never left unattended in the bath or on change table 3. Cleaning 3.1 Disinfecting nappy change areas 3.2 Washing floor 3.3 Vacuuming 3.4 Disinfecting toilet areas 4. Disposal of waste materials 4.1 Nappies 4.2 Soiled tissues/wipes 4.3 Alternative Method for rest e.g. Hammocks 5. Organizational procedures implemented for safety 5.1 Legal/legislative requirements 5.2 Organizational policies regarding excursions 6. Checking area for hazards may include checking for: 6.1 Needles/sharp implements in outdoor areas 6.2 Animal droppings in outdoor areas 7. Maintaining direct contact with child will vary according to: 7.1 Child’s age 7.2 Child’s level of independence/dependence 7.3 Child’s safety/risk taking behaviors 7.4 Activity child is involved in 7.5 Ability of child 8. Contact can include: 8.1 Sight 8.2 Sound 8.3 Glass viewing windows 8.4 Line of Sight 8.5 Within physical reach 9. Potential risk may be: 9.1 Babies learning to eat solid foods 9.2 Children learning new skills such as walking, balancing 9.3 Particular “combinations” of children playing together 9.4 Babies going to sleep with a bottle 9.5 Risk of dehydration on very hot days 9.6 SIDS 9.7 When children are attempting an activity that may be beyond their previous ability 10. Rules for safe play 10.1 Use of equipment 10.2 How children play together 11. Providing a safe environment and risk reduction strategies will vary according to whether the location is: 11.1 A purpose designed and built center 11.2 Non purpose built center 11.3 A home 11.4 Appropriate for the age range of children 12. Hazards may be identified to children in a range of ways: 12.1 Verbally 12.2 By signs 12.3 By symbols",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 64
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 32 - VARIABLE RANGE 13. Risk reduction/strategies 13.1 Gates on stairs 13.2 Covers on electrical sockets 13.3 Removal/locking away of dangerous substances 13.4 Close supervision of any children in kitchens 13.5 Fences and gates, locking mechanisms 13.6 Out of bounds areas 13.7 Vacuuming/sweeping floors to remove small dangerous objects 13.8 Particularly close supervision in some areas 13.9 Placing babies/infants to sleep in positions recommended for prevention of SIDS",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 65
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 33 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Demonstrated ability to provide a clean and safe environment for children 1.2 Observed personal hygiene/health procedures 1.3 Implemented environment protection policy 1.4 Explained and implemented rules for safe play 1.5 Identified potential risks and hazards and explained to clients 1.6 Discussed and practiced with clients the emergencies and evacuation procedures. 2. Underpinning knowledge and attitudes 2.1 Up to date knowledge of regulations are understood 2.2 Regulations on safety, health and hygiene 2.3 Potential hazards to children 2.4 Hazards of traffic for children 2.5 Risk minimization strategies and risk reduction strategies 2.6 The spread of infectious diseases and cross infection 2.7 Strategies to minimize the spread of infectious diseases 2.8 Developmental stage 2.9 Appropriate toys and equipment – safety and risks 2.10 Legal requirements for supervision including worker and child ratios 2.11 Organizational standards, policies and procedures 2.11 Hazards in the home environment 3. Underpinning skills 3.1 Risk minimization strategies and risk reduction strategies 3.2 Strategies to minimize the spread of infectious diseases 3.3 Interpersonal safe use of equipment and materials 4. Resource implications The following resources MUST be provided: 4.1 A childcare workplace 4.2 Facilities, equipment, supplies and materials relevant to the unit of competency 5. Method of assessment Competency MUST be assessed through: 5.1 Demonstration with questioning 5.2 Interview 6. Context of assessment 6.1 This unit could be assessed either in the workplace or in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 66
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 34 - UNIT OF COMPETENCY: RESPOND TO EMERGENCY UNIT CODE: HCS323308 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to respond to emergencies which include various aspects of disease control and prevention and emergency measures that can be administered effectively. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Implement procedures for infection control and prevention 1.1 Exclusion guidelines for children and others suffering from an infectious condition are followed. 1.2 Hygiene and health principles are implemented in care practice. 1.3 Infection control guidelines are followed. 2. Recognize and respond to signs of potential illness 2.1 Signs of potential illness are reported. 2.2 Medical assistance is sought as necessary according to policies and procedures. 2.3 Clients and relatives are informed as soon as possible. 2.4 Client is comforted and settled. 3. Respond to emergencies and accidents 3.1 The safety of self and others is ensured. 3.2 Immediate First Aid is provided as required. 3.3 Strategies to calm, reassure and comfort clients are implemented. 3.4 Details of emergency are recorded and reported accurately. 3.5 Information is provided to others according to established policies. 3.6 Emergencies and accidents are responded to according to the established guidelines and legislative requirements. 4. Administer medication within guidelines 4.1 Medication is administered according to organizational policies and legislative requirements. 4.2 Medication is stored according to requirements. 4.3 Medication is checked for name, instructions and use by date. 6.2 All administered medications are documented in accordance with requirements. 5. Respond to threats and situations of danger 5.1 Remove client from threat/danger or remove danger/threat from client. 5.2 The level of immediate danger is assessed and the situation is reported to an appropriate person. 5.3 Appropriate emergency procedures are implemented to ensure the safety of children and workers.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 67
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 35 - RANGE OF VARIABLES VARIABLE RANGE 1. Tools and Equipment 1.1 Dummies (baby and adult) 1.2 Vital signs kit (thermometer, BP) 1.3 Bed Board 1.4 Disposable Gloves 1.5 Cleaning equipment 1.6 Utensils 1.7 Soft toys 1.8 Protective Aprons 2. Hygiene and Health Principles 2.1 Hand Washing 2.2 Use of disposable gloves when cleaning up body wastes 2.3 Removal and disposal of infected articles 2.4 Cleaning equipment 2.5 Disposal of unused foods/milk 2.6 Cleaning of utensils after use 2.7 Regular disinfecting of soft toys 2.8 Removal of body waste products (e.g. feces, urine, saliva, vomit) and disinfection of affected area 2.9 Use protective aprons when changing babies 2.10 Disinfection of nappy change areas after each use 3. Medication Requirements for storage of medication may include but not limited to the following: 4.1 Legislative guidelines 4.2 Organization procedures",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 68
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 36 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Demonstrated ability to respond quickly to emergencies and implement correct procedures including administering first aid 1.2 Implemented procedures for infection control and prevention 1.3 Recognized and responded to signs of potential illness 1.4 Responded to emergencies and accidents 1.5 Responded to threats and situations of danger. 2. Underpinning knowledge and attitudes 2.1 Disease spread and transmission 2.2 Guidelines for infection control 2.3 Indicators of child abuse 2.4 Different types of child abuse 2.5 Child protection policy of service 2.6 State/territory requirements about responding to indications of abuse and reporting process 2.7 Organizational standards, policies and procedures 3. Underpinning skills 3.1 Common childhood illnesses – recognition, management strategies 3.2 Writing incident records 3.3 Making decision under pressure 4. Resource implications The following resources MUST be provided: 4.1 A childcare workplace 4.2 Facilities, equipment, supplies and materials relevant to the unit of competency 6. Method of assessment Competency MUST be assessed through: 6.1 Demonstration with questioning 6.2 Interview 7. Context of assessment 7.1 Competency may be assessed in the workplace or in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 69
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 37 - UNIT OF COMPETENCY: CLEAN LIVING ROOM, DINING ROOM, BEDROOMS, TOILETS, BATHROOMS AND KITCHEN UNIT CODE: HCS323309 UNIT DESCRIPTOR: This unit covers the knowledge, skills, and attitudes required to perform home management by providing clean, secure and safe environment. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Clean surfaces and floors 1.1 Appropriate removal/cleaning equipment, supplies, materials, procedures and techniques are used in accordance with soil and litter types and established procedures. 1.2 All wastes are removed from surface based on procedures. 1.3 Suitable maintenance procedures is selected and applied based on identified floor types and surface textures. 1.4 Cleaning, polishing and sweeping are performed according to standard operating procedures. 1.5 Cleaning, polishing and sweeping equipment, supplies and materials are used following safety procedures and manufacturer’s specifications. 1.6 Cleaning/polishing equipment are cleaned after use in accordance with relevant safety procedures and manufacturer’s instructions. 1.7 All cleaning, polishing, sweeping materials and equipment are stored as per standard operating procedures (SOPs). 1.8 Routine maintenance is carried out as per SOPs. 2. Clean furnishing and fixtures 2.1 Furnishings and fixtures are cleaned in accordance with standard operating procedures. 2.2 Furniture positioned based on comfort and convenience and room layout. 2.3 Equipment is cleaned after use in accordance with relevant safety and manufacturer’s instructions. 2.4 All cleaning materials and equipment are stored following SOPs. 2.5 Routine maintenance is carried out or arranged as per standard operating procedures. 3. Make up beds and cots 3.1 Mattress is aired, freed from and vacuumed in accordance with SOPs. 3.2 Soiled linens and pillowcases are replaced in accordance with SOPs. 3.3 Linens are centered and mitered when replaced as per SOPs. 3.4 Beds and cots are made-up according to prescribed procedure. 4. Clean toilet and bathroom 4.1 Ceilings and walls are cleaned in accordance with standard operating procedures and techniques. 4.2 Window edges and sills are wiped clean in accordance with standard operating procedures. 4.3 Bathtub, lavatory and toilet bowls are scrubbed and disinfected in accordance with standard operating procedures and techniques. 4.4 Accessories are washed and cleaned in accordance with standard operating procedures and techniques.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 70
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 38 - ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 4.5 Bathroom supplies are replenished and defective accessories replaced as per SOPs. 4.6 Equipment is cleaned after use in accordance with manufacturer’s instruction. 4.7 All cleaning materials and equipment are stored in a safe place as per SOPs. 4.8 Routine maintenance is carried out or arranged as per standard operating procedures. 5. Sanitize rooms 5.1 Sanitizing agents are 100% accurately measured and mixed in accordance with relevant safety regulations. 5.2 Excess mixtures of sanitizing agents are disposed according to environmental requirements. 5.3 Rooms are sanitized in accordance with standard operating procedures. 5.4 Equipment is cleaned after use in accordance with manufacturer’s instructions. 5.5 All cleaning materials and equipment are stored in a safe place as per SOPs. 5.6 Routine maintenance is carried out or arranged as per standard operating procedures. 6. Maintain clean room environment 6.1 All equipment and cleaning paraphernalia are checked and maintained according to manufacturer’s instructions. 6.2 All wastes are removed and disposed of in accordance with employer’s requirements. 6.3 All movable furniture and fittings are shifted to allow access to hidden dust/waste/dirt and as per SOPs. 6.4 Rooms are checked regularly for orderliness/tidiness in accordance with employer’s requirements. 7. Clean kitchen 7.1 Soiled dishes, pots, pans and linen are washed in accordance with standard operating procedures. 7.2 Cleaned/dried dishes, pots and pans are stored as per standard operating procedures. 7.3 Kitchen appliances are cleaned in accordance with standard operating procedures. 7.4 Kitchen fixtures, tables and chairs are wiped in accordance with standard operating procedures. 7.5 Floor is mopped and dried in accordance with standard operating procedures. 7.6 Kitchen supplies are inspected and replenished in accordance with standard operating procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 71
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 39 - RANGE OF VARIABLES VARIABLE RANGE 1. Cleaning Equipment, Supplies and Materials 1.1 Brooms 1.2 Dust pan and brush 1.3 Cleaning implements 1.4 Vacuum cleaner 1.5 Floor Carpet 1.6 Water Hoses 1.7 Bucket 1.8 Bed 1.9 Dining Table 1.10 Water Pitcher 1.11 Table Cloth 1.12 Flowers 1.13 Bed Cover 1.14 Spoon 1.15 Fork 1.16 Knife 1.17 Plate 1.18 Wine Glass 1.19 Serving Utensils 1.20 Table Napkin 1.21 Paper Towel 1.22 Flower Vase 1.23 Drinking Water 1.24 Serving Tray 1.25 Soiled Table 1.26 Cleaning Detergent 1.27 Liquid Detergent 1.28 Cleaning Solution 1.29 Scrubbing Foam 1.30 Flat Sheets 1.31 Fitted Sheet 1.32 Pillow 1.33 Pillow Case 1.34 Bed Mattress 1.35 Dish Pan 1.36 Dish Sponge/Dish Cloth 1.37 Pan with Hot Water 1.38 Rolled Newspaper 1.39 Cleaning Rag 1.40 Wax Paper/Aluminum Foil 1.41 Talcum Powder 1.42 Bowl Cleaner 1.43 Toilet Disinfectant 1.44 Acid Cleaner 1.45 Cup 1.46 Soup Plate 1.47 Soup Bowl 1.48 Drinking Glass/Goblet 1.49 Serving Dish 1.50 Rubber Spatula 1.51 Floor Mop",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 72
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 40 - VARIABLE RANGE 1.52 Toilet Bowl Swab 1.53 Toilet Caddy 1.54 Spray Bottle 1.55 Guess Model 1.56 Antistatic Duster/Cleaning Cloth 1.57 Vacuum Cleaner with Circular Brushes 1.58 Sponges 1.59 Scourer 1.60 Glass Cleaning Equipment 1.61 Drop Sheets 1.62 ‘A” Frame Ladders 1.63 Cobwebber 1.64 Lint Free Cleaning Cloths 1.65 Squeegees (Various Sizes) 1.66 Extension Poles 1.67 Hoses 2. Floor Types/Surface Textures 2.1 Concrete 2.2 Terrazzo 2.3 Vinyl 2.4 Slate 2.5 Ceramic Tile 2.6 Wood 2.7 Marble 2.8 Brick 2.9 Parquetry 2.10 Rubber 2.11 Polished Wood 3. Waste (Wet or Dry) 3.1 Dust 3.2 Paper 3.3 Food 3.4 Stones 3.5 Gravel 4. Furnishings/Fixtures 4.1 Desks 4.2 Tables 4.3 Chairs 4.4 Computers 4.5 Filing Cabinets 4.6 Clocks 4.7 Stoves 4.8 Lamps 4.9 Railing 4.10 Window Sills 4.11 Skirting 4.12 Doors 4.13 Door Handles 4.14 Light Switches 4.15 Telephone Handsets 4.16 Air Conditioning Vents 4.17 Lights 4.18 Ceiling Fans 4.19 Blinds 4.20 Curtains 4.21 Grilles",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 73
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 41 - VARIABLE RANGE 4.22 Refrigerators 4.23 Picture Frames 4.24 Shelves 4.25 Compactus 4.26 Work Stations 4.27 Showcases 4.28 Bars 4.29 Beds 4.30 Bedside Cupboards 5. Ceiling Fittings 5.1 Recessed Lights 5.2 Ornamental Hanging Lights 5.3 Projected Lights 5.4 Ceiling Fans 5.5 Televisions 5.6 Speakers 5.7 Smoke Detectors 5.8 Sprinkler Systems 5.9 Vents and Grilles 5.10 Skylights 5.11 Cameras 5.12 Chandelier 6. Ceiling 6.1 Flat 6.2 Suspended 6.3 Hard 7. Bathroom Supplies/ Accessories 7.1 Liquid and Bar Soap 7.2 Toilet Paper 7.3 Bathroom Deodorizer 7.4 Cloth/Paper Towels 7.5 Personal Toiletries 7.6 Bathroom Slippers 7.7 Floor Towel 7.8 Trash Can 8. Sanitizing Agents 8.1 Solvent Spray 8.2 Anti-Static Solution 8.3 Anti-Static Spray 9. Sanitizing Equipment, Supplies and Materials 9.1 Ladders 9.2 Vacuum Unit 9.3 Dust Mop 9.4 Lint Free Clothing Cloths 9.5 Mop Head and Bucket 9.6 Dust Pan 9.7 Broom 10. Linens 10.1 Napkins 10.2 Tablecloths 10.3 Serving Cloths 10.4 Tea Towels 10.5 Clothing 10.6 Cleaning Cloths 11. Kitchen Appliances 11.1 Food Processor 11.2 Grill 11.3 High Pressure Steamer 11.4 Microwave Oven",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 74
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 42 - VARIABLE RANGE 11.5 Oven (Electric/Gas) 11.6 Range 11.7 Refrigerator 11.8 Tilting Skillet 11.9 Toaster 11.10 Electric Knife 11.11 Juice Maker 11.12 Rice Cooker 12. Kitchen Supplies and Materials 12.1 All-Purpose Detergent 12.2 All-Purpose Soap 12.3 Coffee, Tea, Cream 12.4 Condiments 12.5 Disinfectants 12.6 Drain Solvent 12.7 Food Items (dairy, vegetable, bread, meat and fruits) 12.8 Garbage Bag 12.9 Scouring Pad 12.10 Cooking Oil 12.11 Ingredients",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 75
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 43 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Cleaned surfaces and floors. 1.2 Cleaned furnishings and fixtures. 1.3 Made-up beds and cots. 1.4 Cleaned toilets and bathrooms. 1.5 Sanitized rooms. 1.6 Maintained clean room environment. 1.7 Cleaned kitchen. 2. Underpinning knowledge and attitudes 2.1 Procedures in Cleaning, Polishing, Disinfecting and Sanitizing Rooms (Living Room, Dining Room, Bedrooms, Toilets and Kitchen) 2.2 Types and Characteristics of Floors 2.3 Method of Removing Suitable Dirt/Stain 2.4 Types/Uses/Functions of Cleaning Equipment, Supplies and Materials 2.5 Glass Types, including defects 2.6 Method of Identifying Stains, Mud, Dirt and Grease 2.7 Stain Removal Techniques 2.8 Effects of Pre-Existing Conditions on Safe Work Practices 2.9 Procedures in Arranging Furniture 2.10 Types and Characteristics of furniture and Furnishing 2.11 Procedures in Bed Making 2.12 Knowledge on Different Linen and Fabric 2.13 Procedures in Cleaning and Maintaining Room Furniture and Furnishings 2.14 Knowledge on Different Areas Where Dirt and Dust Can Easily Accumulate 2.15 Schedule of House Chores 2.16 Types of Ancillary Rooms 2.17 Types of Home Set-Up 2.18 Types of Living Room Appliances and Ornament 3. Underpinning skills 3.1 Cleaning Rooms – Living Room, Bedroom, Bathroom and Kitchen 3.2 Making-Up the Bed 3.3 Arranging the Furniture 3.4 Maintaining In-Door Plants 3.5 Chemical Handling and Disposal Techniques 3.6 Manual Handling Techniques 3.7 Reporting and Recording Information 3.8 Planning and Organizing Work 3.9 Communication with Others 3.10 Equipment Operation and Cleaning 3.11 Work Planning and Organization 3.12 Waste Minimization 3.13 Decanting Chemicals",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 76
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 44 - 4. Resource implications The following resources MUST be provided: 4.1 Copies of Relevant Standards, Training Books and Assessment Planning Guides 4.2 Accident Report Forms 4.3 Job Specifications and Reporting Forms 4.4 Access to a Suitable Venue 4.5 Manufacturer/Enterprise Product Specifications 4.6 A range of equipment, including personal protective equipment and relevant cleaning or spot removing chemicals 4.7 Material safety data sheets and equipment operating manuals, if relevant 4.8 Access to a registered provider of assessment services 4.9 Chemical Color Charts 5. Method of assessment Competency may be assessed through: 5.1 Written Test/Examination 5.2 Demonstration with questioning 5.3 Observation with questioning 6. Context of assessment 6.1 Competency may be assessed in the workplace or in a simulated work setting.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 77
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 45 - UNIT OF COMPETENCY: WASH AND IRON CLOTHES, LINEN AND FABRIC UNIT CODE: HCS323310 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to perform home management by providing clean, safe environment. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Check and sort clothes, linens and fabrics 1.1 Soiled clothes, linen and fabrics are sorted according to texture, color, size and defects. 1.2 Sorted items are prioritized according to the cleaning process required and the urgency of the item. 1.3 Defective clothing, linen and fabric are sewn/darned using appropriate threads and stitches. 2. Remove stains 2.1 Personal protective paraphernalia are worn in accordance with standard operating procedures (SOPs). 2.2 Stain removing agents and chemicals are used in accordance with manufacturer’s instruction. 2.3 Stains are treated and removed using correct chemicals or agents. 2.4 All stain removing agents and chemicals are stored following safety procedures. 3. Prepare washing equipment and supplies 3.1 Laundry area is cleaned and made ready at all times. 3.2 Laundry supplies and materials are prepared and made available at all times. 3.3 Washing machine is checked and prepared for operation per manual procedures. 4. Perform laundry 4.1 Correct laundry method is selected as per SOPs. 4.2 Clothes, linen and fabric are washed according to the labeling codes and washing instructions. 4.3 Laundry equipment is used in accordance with manufacturer’s instruction. 4.4 Clothing, linen and fabric are freed from stain, dirt and unpleasant odor after washing based on procedures. 4.5 Washed clothes, linen and fabric are sun-dried/machine dried as per instructions. 4.6 Dried clothes, linen and fabric are freed from unpleasant odor and static cling. 4.7 Washing area is cleaned in accordance with safety and health procedures. 4.8 Equipment is cleaned after use in accordance with",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 78
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 46 - ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables manufacturer’s instructions. 4.9 All cleaning materials and equipment are stored following safety procedures. 4.10 Routine maintenance is carried out or arranged as per standard operating procedures. 5. Dry clothes, linen and fabric 5.1 Washed clothes, linen and fabric are dried according to procedures. 5.2 Drying machine is prepared according to procedure. 5.3 Dried clothes, linen and fabric are removed when dryer bell rings or stops to prevent wrinkles and to minimize need for ironing. 5.4 Clothes, linen and fabric are dried without wrinkles according to procedures. 6. Iron clothes, linens and fabrics 6.1 Ironing is done in accordance to the standard procedures 6.2 Ironed clothes, linens and fabrics are folded, placed in a hanger and stored in designated cabinets as per instructions. 6.3 Ironing equipment and materials are stored in the appropriate area following safety procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 79
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 47 - RANGE OF VARIABLES VARIABLE RANGE 1. Sorted Items 1.1 Soiled/Defective Clothes 1.2 Linen 1.3 Fabrics 2. Personal Protective Paraphernalia 2.1 Gloves 2.2 Apron 3. Stains 3.1 Coffee 3.2 Cola 3.3 Cordial 3.4 Chewing Gum 3.5 Food 3.6 Mud/Dirt 3.7 Grease 3.8 Blood 3.9 Fruit Stains 3.10 Wine 4. Stain 4.1 Acid Cleaners 4.2 Alkali Cleaners 4.3 Chlorine Bleach 4.4 All-Purpose Detergent 5. Laundry Area 5.1 Washers 5.2 Dryers 5.3 Clothesline 5.4 Clothes Pins 5.5 Clothespin Bag 5.6 Clothes Rack for Indoor Drying 6. Laundry Supplies and Materials 6.1 Sorting Baskets/Shelves 6.2 Hangers 6.3 Stain Removing Agents 6.4 Fabric Softener 6.5 Chlorine Bleach 6.6 Laundry Bag 6.7 Laundry Basket",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 80
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 48 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Checked and sorted soiled clothes, linen and fabric. 1.2 Removed stains. 1.3 Prepared washing equipment and supplies 1.4 Performed laundry. 1.5 Dried clothes, linen and fabric. 1.6 Ironed clothes, linen and fabric. 2. Underpinning knowledge and attitudes 2.1 Procedures in Sorting Laundry 2.2 Principles and Procedures in Darning Holes and Tears 2.3 Hygiene, Health and Safety issues Specific to Laundry Operations 2.4 Types/Uses and Handling of Laundry Chemicals 2.5 Principles and Procedures in Removing Stains 2.6 Types/Uses of Stain Removing Agents 2.7 Language Label (Fabric and Garments Labels) 2.8 Types and Characteristics of Clothes, Linen and Fabric 2.9 Standard Procedures in Checking and Preparing Washing Machine 2.10 Procedures in Preparing Laundry Supplies and Materials 2.11 Preparing Mixtures or Bleaching Solutions 2.12 Types and Uses of Washing Machines and Dryers 2.13 Principles and Procedures in Washing, Drying and Ironing Clothes, Linen and Fabric 2.14 Hygiene, Health and Safety Issues of Specific Relevance to Laundry Operations 2.15 Maintenance of Laundry Area 2.16 Procedures in Drying Clothes, Linen and Fabric 2.17 Procedures in Ironing Clothes, Linen and Fabric 2.18 Types/Uses of Ironing Equipment, Tools and Paraphernalia 2.19 Procedures in Storing Clothes, Linen and Fabric 2.20 Basics of Pressing 2.21 Types and Uses of Irons, Ironing Boards and Ironing Accessories 2.22 Types and Use of Hangers 2.23 Folding Method and Techniques 2.24 Pressing Procedures 3. Underpinning Skills 3.1 Checking and sorting soiled clothes, linen and fabric 3.2 Removing Stains 3.3 Preparing washing equipment and supplies 3.4 Performing laundry 3.5 Drying clothes, linen and fabric 3.6 Ironing clothes, linen and fabric 4. Resource Implications The following resources MUST be provided: 4.1 Facilities, equipment, supplies and materials relevant to the unit of competency 5. Method of Assessment Competency maybe assessed through: 5.1 Written Test 5.2 Demonstration with questioning 5.3 Observation with questioning 6. Context of Assessment 6.1 Competency may be assessed in the workplace or in a simulated work setting.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 81
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 49 - UNIT OF COMPETENCY: PREPARE HOT AND COLD MEALS/FOOD UNIT CODE: HCS323311 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in cooking basic hot food and cold meals. It includes preparation of ingredients, cooking meals and dishes according to recipes, present, prepare cooked dishes/sauces, preparation of appetizers, butter designs, desserts, salads, sandwiches, sauces, dressing garnishes and preparing centers pieces. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare ingredients according to recipes 1.1 Ingredients are purchased in accordance with purchase list. 1.2 \"Mise en place\" is checked as per SOPs. 1.3 Thawing is prepared according to thawing procedures. 1.4 Meat are prepared according to procedures and prescribed recipe. 1.5 Vegetables are prepared according to the manner of preparation. 1.6 Seafood are prepared according to method of preparation. 2. Cook meals and dishes according to recipes 2.1 Soup is cooked as per menu. 2.2 Vegetable dishes are cooked according to recipe. 2.3 Meat dishes are cooked according to culinary Method. 2.4 Poultry and game dishes are cooked according to recipe. 2.5 Seafood dishes are cooked according to recipe 2.6 Egg dishes are cooked according to client's preference 2.7 Pasta grain and farinaceous dishes are cooked according to recipe 3. Present cooked dishes 3.1 Serving portion is standardized. 3.2 Presentation of cooked dishes are developed and corrected in accordance with SOPs. 3.3 Food quality is maintained and checked as per SOPs. 3.4 Time and temperature condition of foods is ensured before serving based on freezing temperature. 4. Prepare sauces, dressings and garnishes 4.1 Materials, equipment/utensils are prepared prior to preparation of sauces, dressings and garnishes as per SOPs. 4.2 Sauces, garnishes, hot and cold dressing are prepared as per SOPs. 5. Prepare Appetizers 5.1 D'oeuvres are prepared according to requirement and preference of client. 5.2 Canape's are prepared according to requirement for preference of client. 5.3 Finger foods are prepared according to requirement or preference of client.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 82
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 50 - ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 6. Prepare desserts and salads 6.1 Materials, equipment/utensils used for cooking are prepared as per SOPs. 6.2 Sherbets, ices and ice cream are prepared in accordance with prescribed procedures. 6.3 Fruit desserts are prepared as per prescribed procedures. 6.4 Pastry desserts are prepared as per prescribed procedures. 6.5 Mousse is prepared as per prescribed procedures. 6.6 Cold salads and molded salads are prepared as per prescribed procedures. 7. Prepare sandwiches 7.1 Hot sandwiches are prepared as per SOPs. 7.2 Cold dressings are prepared as per SOPs. 7.3 Hot sauces are prepared as per SOPs. 7.4 Cold sauces are prepared as per SOPs. 8. Store excess foods and ingredients 8.1 Unconsumed food are stored according to procedures. 8.2 Excess ingredients are stored according to client’s requirement. 8.3 Proper method of refrigeration and proper storing of dry food is implemented as per SOPs. 8.4 Wet and dry food ingredients are properly stored as per SOPs. 9. Convert unconsumed cooked food 9.1 Unconsumed cooked food is converted/transformed into new dishes as per SOPs. 9.2 Unconsumed cooked food is stored/frozen at a temperature of zero degrees and in accordance with SOPs. 9.3 Packed/wrapped uncooked food are frozen at zero degrees F temperature and in accordance with SOPs. 9.4 Packed/wrapped food for storage is prepared as per SOPs. 9.5 Uncooked food is maintained at the proper temperature and as per SOPs.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 83
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 51 - RANGE OF VARIABLES VARIABLE RANGE 1. Ingredients May include but not limited to the following: 1.1 Meat 1.2 Vegetable 1.3 Seafood 1.4 Poultry and Game 1.5 Stock 1.6 Cold Food 1.7 Condiments 1.8 Milk 1.9 Dairies 1.10 Cereals 1.11 Flour 1.12 Butter Sauces 1.13 Fruits 2. Mis en Place 2.1 Ingredients 2.2 Pans 2.3 Utensils 2.4 Plates/Serving Pieces 3. Thawing 3.1 Soaking 3.2 Unfreezing 4. Vegetable Ingredient Preparation 4.1 Skin, Peel, Pare 4.2 Chop, Slice, Shred, Cube 4.3 Wedge, Grate, Pure 4.4 Core, Quarter 5. Vegetable Dishes Preparation 5.1 Boiling, Blanching 5.2 Sauteing 5.3 Braising 5.4 Gratinating 5.5 Roasting/Baking 6. Seafood Ingredient Preparation 6.1 Chop, Slice 6.2 Fillet 6.3 Mince, Shred 6.4 Peel, Dice, Blanch 6.5 Marinate, Poach 7. Seafood Dishes Preparation 7.1 Boiling, Steaming 7.2 Sauteing 7.3 Deep Frying, Pan Frying 7.4 Poaching 7.5 Grilling 7.6 Baking 8. Soup Preparation 8.1 Sauteing 8.2 Simmering 9. Meat Ingredient Preparation 9.1 Slice, Chop 9.2 Debone 9.3 Dice, Mince 9.4 Marinate 10. Meat Dishes Preparation 10.1 Boiling, Steaming, Simmering, Stewing 10.2 Frying (deep, pan, stir) 10.3 Sauteing 10.4 Roasting, Baking, Browning",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 84
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 52 - VARIABLE RANGE 10.5 Pressurize Cooking 10.6 Poaching, Blanching, Braising 10.7 Broiling, Grilling 11. Poultry Ingredient Preparation 11.1 Deboned 11.2 Chop, Slice 11.3 Dice, Shred, Cube 11.4 Mince, Skin 11.5 Marinate 12. Poultry Dishes Preparation 12.1 Boiling, Simmering, Stewing 12.2 Frying (deep, pan, stir) 12.3 Sauteing 12.4 Braising, Grilling, Roasting 12.5 Barbecuing, Baking 13. Egg Dishes Preparation 13.1 Boiling 13.2 Frying 13.3 Poaching 13.4 Basting 13.5 Baking 14. Pasta Grain and Farinaceous Dishes Preparation 14.1 Boiling 14.2 Steaming 14.3 Poaching 14.4 Sauteing 14.5 Gratinating 14.6 Baking 15. Hors D’oeuvres Preparation 15.1 Peel, Pare, Slice, Shred, Cubes 15.2 Blanch, Boiled, Steam 15.3 Marinate, Seasoned 16. Sweet Sauces 16.1 Sugar Syrups 16.2 Fruit Syrups 16.3 Fruit Purees, Sauces and Coulis 16.4 Chocolate - Based Sauces 16.5 Custard and Cremes 16.6 Flavoured Butters and Creams",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 85
                },
                "type": "Document"
            },
            {
                "page_content": "TR Caregiving NC II - 53 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Prepared ingredients according to recipes. 1.2 Cooked meals and dishes according to recipes. 1.3 Presented cooked dishes. 1.4 Prepared appetizers. 1.5 Prepared sauces, dressings and garnishes. 1.6 Prepared desserts and salads. 1.7 Prepared sandwiches. 1.8 Stored excess foods and ingredients. 1.9 Converted unconsumed cooked and uncooked food. 2. Underpinning knowledge and attitudes 2.1 Food Theory 2.2 Materials Specifications and Uses 2.3 Tools and Equipment: Uses and Specifications 2.4 Codes and Regulations 2.4.1 Pertinent food and drink sanitation laws, rules and regulations 2.5 Maintenance Operation 2.6 Balance Diet 2.7 Nutrition 2.8 Serving 2.9 Safe Work Practices and First Aid Regulations 2.10 Personal Hygiene 2.11 Providing Safe Food 2.12 Food and Safety Hazard 2.13 Safe Food Handling 2.14 Food Costing and Portioning 2.15 Food Storage 2.16 Method of Preparing Salad 2.17 Handling of Kitchen Equipment 3. Underpinning skills 3.1 Cooking Method 3.2 Handling of Kitchen Equipment 3.3 Proper Storing 3.4 Food Costing and Portioning 4. Resource implications The following resources MUST be provided: 4.1 Facilities, equipment, supplies and materials relevant to the unit of competency 5. Method of assessment Competency may be assessed through: 5.1 Written Test 5.2 Demonstration with questioning 5.3 Observation with questioning 6. Context of assessment 6.1 Competency may be assessed in the workplace or in a simulated work setting.",
                "metadata": {
                    "source": "datasets\\raw\\Caregiving NC II.pdf",
                    "page": 86
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Carpentry NC II",
        "core_competencies": [
            {
                "page_content": "TR CARPENTRY NC II 29 CORE COMPETENCIES UNIT OF COMPETENCY: PREPARE / STAKE-OUT BUILDING LINES UNIT CODE CON712317 UNIT DESCRIPTOR: This unit covers the knowledge, skills, and attitude for preparing stake-out materials and fixing stake-out building lines. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare materials for stake-out building lines 1.1 Appropriate PPE is selected and used according to job requirements and OSHC standards. 1.2 Related plans and details are correctly interpreted according to job requirements. 1.3 Materials, hand tools and equipment is prepared consistent with job requirements. 1.4 Materials are properly staged and freed from defects. 1.5 Unexpected situations are responded to in line with company rules and regulations. 1.6 Housekeeping is performed according to safety regulations. 2. Set batterboards 2.1 Batterboards are set away from the building line excavation. 2.2 Batterboards are properly secured with tolerances for dimensions at ± 5 mm, and levelness of ± 3 mm. 2.3 Unexpected situations are responded to in line with company rules and regulations. 2.4 Housekeeping is performed according to safety regulations. 3. Fix stake-out building lines 3.1 Stake-out building lines are properly secured for reference in excavating building foundation. 3.2 Marking lines are squared and plumbed from the batterboard lines with tolerance of ± 3 mm on all measurement, plumbness, squareness and rigid. 3.3 Worksite is cleaned and kept in safe state according to OSHC regulations. 3.4 Daily work report is accomplished in accordance with company rules and regulations.",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 30
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 30 RANGE OF VARIABLES VARIABLE RANGE 1. PPE May include but are not limited to: 1.1 Hard hat 1.2 Safety shoes 1.3 Gloves 1.4 Working clothes 2. Plans and details 2.1 Exact location 2.2 Dimensions 2.3 Symbols and abbreviations 2.4 Elevations 2.5 Quality and quantity of materials 3. Materials, hand tools and equipment May include but are not limited to: 3.1 Lumber 3.2 Nails 3.3 G.I. Wires 3.4 Saw 3.5 Claw/Hammer 3.6 Chalk line 3.7 Pencil 3.8 Fishing line/nylon cord 3.9 Plumb bob 3.10 3 - 4 - 5 square/plywood/transit 3.11 Sledge hammer 3.12 Pull - push tape/zigzag rule 3.13 Crew bar 3.14 Pickmatch/pickmatok 3.15 Bolo 3.16 Framing square 3.17 Try - square 3.18 Level hose 4. Unexpected situations May include but not limited to: 4.1 Injury to personnel 4.2 Damage to materials",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 31
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 31 EVIDENCE GUIDE 1. Critical aspects of competency Competency assessment requires evidence that the candidate: 1.1 Interpreted related plans and details according to job requirements. 1.2 Selected and prepared materials, hand tools and equipment, and PPE according to specifications and job requirements. 1.3 Set and aligned dimension of work accurately according to job requirements. 1.4 Applied organizational quality procedures and processes in staking-out building lines 1.5 Complied with safety regulations for worksite operation. 1.6 Identified faults and problems and reported to immediate supervisor/foreman for necessary action. 2. Underpinning Knowledge 2.1 Types and uses of PPE 2.2 Mensuration 2.3 Related plans and details interpretation 2.4 Materials, hand tools and equipment uses and specifications 2.5 5-S 2.6 Knowledge of building layouts 2.7 Company rules and regulations 3. Underpinning Skills 3.1 Using PPE 3.2 Interpreting related plans and details 3.3 Preparing stake materials 3.4 Cutting/setting batter boards 3.5 Aligning stake-out of building lines and excavation 3.6 Metering tape reading 3.7 Communicating effectively 3.8 Following company rules and regulations 4. Resource implications The following resources must be provided: 4.1 Workplace location 4.2 Plans and details relevant to the task 4.3 Hand tools and equipment appropriate for preparing building lines 4.4 Materials relevant to the proposed activity 4.5 Appropriate PPE",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 32
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 32 5. Methods of Assessment Competency must be assessed through: 5.1 Direct observation/practical demonstration of application to tasks 5.2 Questioning related to underpinning knowledge 6. Context for Assessment 6.1 Competency may be assessed in the workplace or in a simulated workplace setting 6.2 Assessment shall be done while tasks are undertaken individually under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 33 \nUNIT OF COMPETENCY: FABRICATE FORMWORKS \nUNIT CODE: CON7123 18 \nUNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in fabricating formworks. It includes preparing materials, lay - outing, fabricating and assembling formworks. \nELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables \n1. Prepare materials for fabricating formworks \n1.1 Appropriate PPE is selected and used according to job requirements and OSHC specifications. \n1.2 Related plans and details are interpreted according to job requirements. \n1.3 Materials, hand and power tools and equipment are selected and prepared consistent with job requirements. \n1.4 Materials are re - checked and properly staged according to job requirements otherwise defective materials or not in specifications are reported to immediate superior. \n1.5 Unexpected situations are responded to in line with company rules and regulations. \n1.6 Housekeeping is performed according to safety regulations. \n2. Lay - out dimension of form sheating and stiffeners \n2.1 Form sheating and stiffeners are measured and marked according to job specifications. \n2.2 Form sheating and stiffeners are laid out and cut with tolerances of  3 mm for all measurements and squareness. \n2.3 Form sheating and stiffeners for column, beam, wall, slab and stairs are consistent with standard spacing for studs or nailer with tolerance of + 10 mm. O.C. \n2.4 Unexpected situations are responded to in line with company rules and regulations. \n2.5 Housekeeping is performed according to safety regulations.",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 34 3. Assemble form panels 3.1 Materials and/or fabricated form sheathing and stiffeners are correctly positioned for assembly. 3.2 Assembled form panels are checked for squareness, levelness and alignment to specified tolerance 3.3 Temporary fixing and/or permanent assembly techniques are applied to hold form panels together as per job requirements. 3.4 Assembled form panels are checked for compliance with job requirements. 3.5 Unexpected situations are responded to in line with company rules and regulations. 3.6 Clean up worksite according to safety regulations and OSHC specifications. 3.7 Daily work report is accomplished in accordance with company rules and regulations.",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 35 RANGE OF VARIABLES VARIABLE RANGE 1. Personal protective equipment (PPE) May include but are not limited to: 1.1 Goggles 1.2 Dust mask 1.3 Gloves 1.4 Safety shoes 1.5 Working clothes 1.6 Hard hats 2. Plans and details 2.1 Exact location 2.2 Dimensions 2.3 Symbols and abbreviations 2.4 Elevations 2.5 Sections and details 2.6 Quality and quantity of materials 3. Materials May include but not limited to: 3.1 Plywood 3.2 Lumber 3.3 Nails 3.4 Tie-rods 3.5 Tubular scaffolds 3.6 H-frame scaffold 3.7 Formwork braces",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 36 4. Power and hand tools and equipment May include but are not limited to: 4.1 Power tool/equipment 4.1.1 Circular saw 4.1.2 Electric drill 4.1.3 Table saw 4.1.4 Hole saw 4.1.5 Jig saw 4.2 Hand tools 4.2.1 Hammer 4.2.2 Chalk lines 4.2.3 Pencil 4.2.4 Push - pull/zigzag rule 4.2.5 Chisel 4.2.6 Steel square 4.2.7 Hand saw 4.2.8 Plumb bob 4.2.9 Level hose 4.2.10 Spirit level 4.2.11 Adjustable wrench 4.2.12 Try square 4.2.13 Marking gauge 4.2.14 Crew bar 5. Unexpected situations May include but not limited to: 5.1 Injury to personnel 5.2 Damage to materials 6. Formworks May include but not limited to: 6.1 Plate 6.2 Pipe 6.3 Section 6.4 Sheet 6.5 By panel 6.6 Steel form",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 37 EVIDENCE GUIDE 1. Critical aspects of competency Competency assessment requires evidence that the candidate: 1.1 Interpreted related plans and details 1.2 Selected and prepared materials, power and hand tools, equipment and PPE consistent with job requirements 1.3 Used safe and effective power and hand tools. 1.4 Laid out and cut form sheating and stiffeners according to specified tolerances 1.5 Assembled form panels are checked for compliance with the job requirements and specified tolerances 1.6 Applied organizational quality procedures and processes 1.7 Completed work without damage to materials or injury to personnel. 2. Underpinning knowledge 2.1 Types and uses of PPE 2.2 Mensuration 2.3 Related plans and details interpretation 2.4 Materials, power and hand tools and equipment uses and specifications 2.5 5 - S 2.6 Knowledge of formworks fabrication procedures 2.7 Economic use of material 2.8 Safe and effective use of power and hand tools 2.9 Company rules and regulations 3. Underpinning skills 3.1 Using PPE 3.2 Applying mensuration 3.3 Interpreting related plans and details 3.4 Following fabrication procedures 3.5 Following safe and effective use of power and hand tools 3.6 Following 5 - S 3.7 Using materials economically 3.8 Communicating effectively 3.9 Following company rules and regulations",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 38 4. Resource implications The following resources must be provided: 4.1 Work place location 4.2 Materials, power and hand tools and equipment appropriate for formworks fabrication 4.3 Plans and details and specifications relevant to the task 4.4 Appropriate PPE 5. Methods of assessment Competency must be assessed through: 5.1 Direct observation of application to tasks 5.2 Questions related to underpinning knowledge 5.3 Demonstration 6. Context for assessment 6.1 Competency may be assessed in the work place or in a simulated work place setting 6.2 Assessment shall be done while tasks are undertaken individually under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 39 UNIT OF COMPETENCY: INSTALL FORMWORKS COMPONENTS UNIT CODE CON712319 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in installing/stripping formworks components for concrete work. It includes preparing materials, lay-outing/assembling scaffolds and braces and removing of shoring. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare materials, tools and equipment for installing formworks 1.1 Appropriate PPE is selected and used according to job requirements and OSHC specifications. 1.2 Related plans and details are correctly interpreted according to job requirements. 1.3 Formworks components/materials, power and hand tools and equipment are selected and prepared consistent with job requirements. 1.4 Materials are re-checked and properly staged according to job requirements otherwise damaged materials are reported to immediate superior. 1.6 Unexpected situations are responded to in line with company rules and regulations. 1.7 Housekeeping is performed according to safety regulations. 2. Lay-out/assemble scaffolds and braces 2.1 Appropriate PPE is selected and used according to job requirements and OSHC specifications. 2.2 Work area is cleared for safe lay-outing and assembling of scaffolds and braces. 2.3 Scaffolds and braces are laid-out and assembled with tolerance of + 3mm for all measurements and squareness. 2.4 Connectors, braces, locks and screws are properly secured according to job requirements. 2.5 Unexpected situations are responded to in line with company rules and regulations. 2.6 Housekeeping is performed according to safety regulations.",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 40 3. Set/fix form panels of building components 3.1 Appropriate PPE is selected and used according to job requirements and OHSA specifications. 3.2 Formworks components are laid-out with tolerance of  3 mm for measurement, alignment, squareness, levelness, plumbness and with form oil. 3.3 Form panels are set/fixed for components with tolerance to reference structure of +3mm 3.4 Connectors, braces, locks and screws are properly secured according to job requirements. 3.5 Unexpected situations are responded to in line with company rules and regulations. 3.6 Daily report is accomplished according to company rules and regulations. 3.7 Housekeeping is performed according to safety regulations.",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 41 RANGE OF VARIABLES VARIABLE RANGE 1. Personal protective equipment (PPE) May include but are not limited to: 1.1 Gloves 1.2 Safety shoes 1.3 Dust mask 1.4 Safety hat 1.5 Safety belt 1.6 Overalls/working clothes 2. Plans and details 2.1 Exact location 2.2 Dimensions 2.3 Symbols and abbreviations 2.4 Elevations 2.5 Sections and details 2.6 Quality and quantity of materials 3. Formwork components 3.1 Stiffener/frame 3.2 Steel 3.3 Composite construction 3.4 Polyvinyl/plastic 4. Materials May include but are not limited to: 4.1 Form panels 4.2 Lumbers 4.3 Scaffolds 4.4 Shoring 4.5 Nails 4.6 Plywood 4.7 Steel channel",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 42 5. Power and hand tools and equipment May include but are not limited to: 5.1 Saw 5.2 Hammer 5.3 Tool holster 5.4 Spanners 5.5 Measuring tool 5.6 Impact gun 5.7 Brooms 5.8 Chalk line 5.9 Pencil 5.10 Plumb bob 5.11 Level hose 5.12 Fishing line 5.13 Spirit level 5.14 Crow bar 5.15 Try-square 6. Unexpected situations May include but not limited to: 6.1 Damage to materials 6.2 Injury to personnel",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 43 EVIDENCE GUIDE 1. Critical aspects of competency Competency assessment requires evidence that the candidate: 1.1 Interpreted related plans and details according to job requirements. 1.2 Selected and prepared materials, power and hand tools, equipment and PPE are consistent with job requirements. 1.3 Laid-out/assembled scaffolds/braces and form components/panels according to job requirements and specified tolerances. 1.4 Complied with safety regulations for worksite operations 1.5 Followed safe and effective operational use of power and hand tools and equipment 1.6 Communicated interactively with others to ensure safe and effective workplace operations 1.7 Completed work without injury to personnel or damage to equipment. 2. Underpinning knowledge 2.1 Types and uses of PPE 2.2 Mensuration 2.3 Materials, power and hand tools and equipment uses and specifications 2.4 Interpretation of related plans and details 2.5 5-S 2.6 Safe and effective use of power and hand tools 2.7 Economic use of material 2.8 Knowledge of assembling and fixing procedures 2.9 Company rules and regulations 3. Underpinning skills 3.1 Using PPE 3.2 Applying mensuration 3.3 Interpreting plan and details 3.4 Preparing materials, power and hand tools and equipment 3.5 Following assembling and fixing procedures 3.6 Following 5-S 3.7 Following safe and effective use of power and hand tools 3.8 Using materials economically 3.9 Communicating effectively 3.10 Following company rules and regulations",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 44 4. Resource implications The following resources must be provided: 4.1 Work place location 4.2 Hand and power tools and equipment appropriate for installation of formwork components 4.3 Materials relevant to the proposed activity 4.4 Plans and details relevant to the task 4.5 Appropriate PPE 5. Methods of assessment Competency must be assessed through: 5.1 Direct observation of application to tasks 5.2 Questions related to underpinning knowledge 5.3 Demonstration 6. Context for assessment 6.1 Competency may be assessed in the work place or in a simulated work place setting. 6.2 Assessment shall be done while tasks are undertaken individually under limited supervision.",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 45 UNIT OF COMPETENCY: STRIP FORMWORKS COMPONENTS UNIT CODE CON712320 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in stripping formworks components and accessories for concrete work. It includes preparing tools, equipment and staging of materials and shoring and re-shoring operations. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare staging area, tools and equipment 1.1 Work instruction is secured from immediate superior according to company rules and regulations. 1.2 Appropriate PPE is selected and used according to job requirements and OSHC specifications. 1.3 Formwork components and accessories staging area is identified and prepared based on job requirements. 1.4 Formwork components power, hand tools and equipment are selected and prepared consistent with job requirements. 1.5 Unexpected situations are responded to in line with company rules and regulations. 1.6 Housekeeping is performed according to safety regulations. 2. Strip formworks of building components 2.1 Formwork components and accessories are removed carefully, safely and sequentially. 2.2 Formwork components and accessories are sorted, arranged and properly staged according to company rules and regulations/manufacturer's recommendations. 2.3 Formwork components and accessories are cleaned, oiled and stored according to company rules and regulations/manufacturer's recommendations. 2.4 Formwork components and accessories, which are beyond repair, are discarded otherwise repaired in accordance with company rules and regulations. 2.5 Unexpected situations are responded to in line with company rules and regulations. 2.6 Housekeeping is performed according to safety regulations.",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 46 3. Shore or/and re-shore and removal 3.1 Appropriate PPE is selected and used according to job requirements and OHSA specifications. 3.2 Formworks components are shored and re-shored in accordance with stripping procedures. 3.3 Shores are removed in accordance with standard dismantling procedures. 3.4 Shores, tools and equipment are cleaned, maintained and stored properly according to company rules and regulations. 3.5 Unexpected situations are responded to in line with company rules and regulations. 3.6 Daily report is accomplished according to company rules and regulations. 3.7 Housekeeping is performed according to safety regulations.",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 47 RANGE OF VARIABLES VARIABLE RANGE 1. Personal protective equipment (PPE) May include but are not limited to: 1.1 Gloves 1.2 Safety shoes 1.3 Dust mask 1.4 Safety hat 1.5 Safety belt 1.6 Overalls/working clothes 2. Power and hand tools and equipment May include but are are not limited to: 2.1 Hammer 2.2 Tool holster 2.3 Spanners 2.4 Brooms 2.5 Crow bar 3. Unexpected situations May include but are not limited to: 3.1 Damage to formwork components 3.2 Injury to personnel 4. Formwork components and accessories 4.1 Form panels 4.1.1 Beams 4.1.2 Columns 4.1.3 Slabs 4.1.4 Walls 4.1.5 Stairs 4.2 Scaffolds 4.2.1 Frame 4.2.2 Tubular",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 48 EVIDENCE GUIDE 1. Critical aspects of competency Competency assessment requires evidence that the candidate: 1.1 Followed work instructions. 1.2 Selected and prepared power and hand tools, equipment and PPE are consistent with job requirements 1.3 Performed stripping, shoring and removal of shoring procedures 1.4 Complied with safety regulations for worksite operations. 1.5 Followed safe and effective operational use of power and hand tools and equipment. 1.6 Communicated interactively with others to ensure safe and effective workplace operations. 1.7 Completed work without injury to personnel or damage to materials. 2. Underpinning knowledge 2.1 Types and uses of PPE 2.2 Formwork components power and hand tools and equipment use and specification 2.3 Interpretation of instruction, 2.4 Safety rules and regulations 2.5 5 - S 2.6 Safe and effective use of power and hand tools 2.7 Proper storing and maintenance of formwork components 2.8 Knowledge of stripping, shoring and removal of shoring procedures 2.9 Company rules and regulations 3. Underpinning skills 3.1 Using PPE 3.2 Interpreting instructions 3.3 Following safety rules and regulations 3.4 Preparing formwork components 3.5 Following stripping, shoring and removal of shoring procedures 3.6 Following 5 - S 3.7 Following safe and effective use of power and hand tools 3.8 Following proper storing and maintenance of formwork components and accessories 3.9 Communicating effectively 3.10 Following company rules and regulations",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 49 4. Resource implications The following resources must be provided: 4.1 Work place location 4.2 Hand and power tools and equipment appropriate for stripping of formwork components 4.3 Appropriate PPE 5. Methods of assessment Competency must be assessed through: 5.1 Direct observation of application to tasks 5.2 Questions related to underpinning knowledge 5.3 Demonstration 6. Context for assessment 6.1 Competency may be assessed in the work place or in a simulated work place setting 6.2 Assessment shall be done while tasks are undertaken individually under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 50 \nUNIT OF COMPETENCY: INSTALL FRAMING WORKS \nUNIT CODE: CON712321 \nUNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in installing framing works. It includes preparing materials, lay-outing/erecting and assembling supports. \nELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables \n1. Prepare materials for framing works \n1.1 Appropriate PPE is selected and used according to job requirements OSHC specifications. \n1.2 Related plans and details are correctly interpreted according to job requirements. \n1.3 Materials, power and hand tools and equipment are selected and prepared consistent with job requirements. \n1.4 Materials are re-checked and properly staged according to job requirements. \n1.5 Defective materials are reported to immediate supervisor following standard operating procedures. \n1.6 Unexpected situations are dealt with according to company rules and regulations. \n1.7 Housekeeping is performed according to safety regulations. \n2. Lay-out/erect and assemble post, girts and supports \n2.1 Appropriate PPE is used according to job requirements and OSHC specifications. \n2.2 Posts and girts are laid-out according to working drawings and specifications with tolerance of  3mm on all measurements, plumbness and levelness. \n2.3 Post, girts and support are erected/assembled based on plans and specifications. \n2.4 Unexpected situations are dealt with according to company rules and regulations. \n2.5 Housekeeping is performed according to safety regulations.",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 51 3. Lay-out/install floor joists 3.1 Appropriate PPE is used according to job requirements and safety regulations. 3.2 Floor joists are set out, cut and fixed, and laterally supported in accordance with working drawings and specifications. 3.3 Floor joists are trimmed for floor openings and fixed with fastenings according to working drawings and specifications. 3.4 Floor joists are laid-out/installed with tolerance of ± 3mm on all measurements and levelness. 3.5 Unexpected situations are dealt with according to company rules and regulations. 3.6 Housekeeping is performed according to safety regulations. 4. Lay-out/install wall studs 4.1 Appropriate PPE is used according to job requirements and safety regulations. 4.2 Wall studs are identified and installed based on working drawings and specifications with tolerance of ± 3mm on all measurements, plumbness, levelness and squareness. 4.3 Unexpected situations are dealt with according to company rules and regulations. 4.4 Housekeeping is performed according to safety regulations. 5. Lay-out/fabricate/install roof frames 5.1 Appropriate PPE is used according to job requirements and safety regulations. 5.2 Types of roofs and other components are fabricated, laid out and installed according to working drawings and specifications with tolerance of ± 3mm maximum on all dimensions, plumbness, levelness and squareness. 5.3 Roof components are installed according to working drawings and specifications. 5.4 Unexpected situations are dealt with according to company rules and regulations. 5.5 Housekeeping is performed according to safety regulations.",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 52 6. Lay-out/install ceiling joists/frames 6.1 Assessment PPE is used according to job requirements and safety regulations 6.2 Ceiling joists/frames are laid out/installed according to working drawings and specifications with ± 3 mm tolerance on all dimensions, levelness and squareness. 6.3 Unexpected situations are dealt with according to company rules and regulations. 6.4 Daily report is accomplished according to company rules and regulations. 6.5 Housekeeping is performed according to safety regulations.",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 53 RANGE OF VARIABLES VARIABLE RANGE 1. PPE May include but not limited to: 1.1 Gloves 1.2 Safety shoes 1.3 Safety hat 1.4 Safety belt 1.5 Dust mask 1.6 Working clothes 2. Plans and details 2.1 Exact location 2.2 Dimensions 2.3 Symbols and abbreviations 2.4 Elevations 2.5 Sections and details 2.6 Quality and quantity of materials 3. Materials 3.1 Lumber 3.2 Nails 3.3 Bolts and nuts 3.4 Hanger ceiling (expansion bolts) 3.5 Metal bracket 4. Power and hand tools and equipment May include but not limited to: 4.1 Saw 4.2 Hammer 4.3 Chalk line 4.4 Pencil 4.5 Plumb bob 4.6 Level hose 4.7 Push-pull/zigzag rule 4.8 Fishing line 4.9 Spirit level 4.10 Crow bar 4.11 Chisel 4.12 Try square 4.13 Framing square",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 54 VARIABLE RANGE 5. Defective materials 5.1 Natural 5.2 Manufacturer 6. Unexpected situations May include but not limited to: 6.1 Damage to materials, tools or equipment 6.2 Injury to personnel 7. Types of roofs May include but not limited to: 7.1 Flat roof 7.2 Shed or lean-to 7.3 Gable roof 7.4 Hip roof 7.5 Gable roof and dormer 7.6 Gable and valley roof 7.7 Hip and valley roof 8. Other components May include but not limited to: 8.1 Trusses 8.2 Brace 8.3 Cleat 8.4 Rafter 8.5 Purlins 8.6 Fascia board",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 55 EVIDENCE GUIDE 1. Critical aspects of competency Competency assessment requires evidence that the candidate: 1.1 Interpreted related plans and details according to job requirements. 1.2 Selected and prepared materials, hand and power tools, equipment and PPE are consistent with job requirements 1.3 Performed installing framing works procedures 1.4 Complied safety regulations for worksite operations. 1.5 Followed safe and effective operational use of tools and equipment. 1.6 Completed work operations without injury to personnel and damage to materials. 1.7 Communicated interactively with others to ensure safe and effective workplace operations. 2. Underpinning knowledge 2.1 Types and uses of PPE 2.2 Mensuration 2.3 Working drawings and specifications interpretation 2.4 Materials, power and hand tools, equipment use and specification 2.5 5 - S 2.6 Principles of framing 2.5 Procedures for installing framing works 2.6 Safe and effective use of power and hand tools 2.7 Economic use of material 2.8 Staging and storing procedure of materials 2.9 Company rules and regulations 3. Underpinning skills 3.1 Using PPE 3.2 Applying mensuration 3.3 Interpreting working drawings and specifications 3.4 Using materials economically 3.5 Following 5S 3.6 Following procedures for installing framing works 3.7 Following safe and effective use of power and hand tools 3.8 Following staging and storing procedure 3.9 Following company rules and regulations",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TR CARPENTRY NC II 56 4. Resource implications The following resources must be provided: 4.1 Work place location 4.2 Power and hand tools and equipment appropriate to installation of frames 4.3 Materials relevant to the proposed activity 4.4 Drawings and specifications relevant to the task 4.5 Appropriate PPE 5. Methods of assessment Competency must be assessed through: 5.1 Direct observation of application to tasks 5.2 Questions related to underpinning knowledge 6. Context for assessment 6.1 Competency may be assessed in the workplace or in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Carpentry NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            }
        ]
    }
]