[
    {
        "name": "Driving (Passenger BusStraight Truck) NC III",
        "core_competencies": [
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 39 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM MINOR MAINTENANCE AND SERVICING ON VEHICLES CLASSIFIED UNDER LTO RESTRICTION CODES 3 UP TO 5 CODE NO.: ALT723349 UNIT DESCRIPTOR: This unit involves the skills, knowledge and attitudes required to carry out basic servicing and maintenance on vehicles classified under LTO Restriction codes 3 - 5. It also includes the action to implement the vehicle manufacturer’s specific ations for routine cleaning checks and maintenance and ensure that the vehicle is operational to the requirements of both the workplace and the relevant road and traffic authority. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Clean vehicle unit 1.1 Vehicle is cleaned as per prescribed procedures using appropriate cleaning supplies, tools/equipment and according to occupational health and safety (OHS) rules. 1.2 Wastes are disposed of as per relevant ordinance, rules or law. 2. Maintain and service the vehicle system 2.1 Minor routine checks are undertaken based on manufacturer's manual. 2.2 Minor routine repair and servicing are undertaken in accordance with occupational health and safety procedures and manufacturer's manual. 2.3 Brakes are inspected and appropriate action is undertaken in accordance with manufacturer's specifications. 2.4 Complex repair and service requirements are identified and referred following workplace procedures. 2.5 Records of routine servicing, maintenance and repairs are kept and updated in accordance with workplace procedures",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 40 RANGE OF VARIABLES VARIABLE RANGE 1. Vehicle Vehicle may include but are not limited to: 1.1 Passenger bus 1.2 Straight Truck 2. Cleaning supplies Cleaning supplies may include but are not limited to: 2.1 Soap 2.2 Rags 2.3 Oil 2.4 Air freshener 2.5 Polish 2.6 Water 3. Cleaning Tools and Equipment 3.1 Vacuum cleaner 3.2 Steam cleaner 3.3 Mop and basket 3.4 Pail 3.5 Broom 3.6 Hose 3.7 Pressure Washer 4. Routine Check Routine checks include but are not limited to the following vehicle components: 4.1 Battery 4.2 Tire air pressure 4.3 Water level 4.4 Lights 4.5 Horn 4.6 Mirrors 4.7 Propeller 4.8 Bolts and nuts tightness 4.9 Brake fluid 4.10 Oil level 4.11 Fan belt 5. Minor routine repairs Minor routine repairs include but are not limited to the replacement of: 5.1 Blown bulbs in vehicle lights 5.2 Broken fan belt 5.3 Blown fuse 5.4 Broken side mirrors 5.5 Rear tail-light lens 5.6 Tires 5.7 Broken coolant hose 6. Minor routine servicing Minor routine servicing may include but are not limited to the following: 6.1 Topping up of water/coolant levels and brake fluid 6.2 Change/topping of engine oils 6.3 Air pressure set of tires 6.4 Addition of gear oil 6.5 Cleaning of battery terminals 7. Occupational Health and Safety 7.1 Use of personal protective equipment such as:  Gloves  Gas mask  Brush 7.2 Appropriate space with ventilation 7.3 Provision of fire extinguisher in work area",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 41 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate 1.1 Diagnosed basic vehicle faults and made adjustment/repairs 1.2 Carried out routine servicing and maintenance of vehicle system 1.3 Identified complex servicing and maintenance problems 1.4 Demonstrated safety, environmental and hazard control precautions and procedures during routine maintenance operations 1.5 Communicated effectively with others in carrying out vehicle maintenance 2. Underpinning Knowledge and Attitudes 2.1 Relevant OHS and pollution control procedures 2.2 Procedure for checking and routine service and maintenance of a vehicle 2.3 Problems that may occur during routine servicing and maintenance of a vehicle and appropriate actions and solutions 2.4 Faults and irregularities that may occur in vehicles. 2.5 Principles of operation of vehicle system such as electrical system, fuel system, cooling system, steering system, exhaust system, tires, brakes 2.6 Basic fault finding procedures required during routine servicing and maintenance of vehicles 2.7 Uses of tools materials, and parts for routine servicing and maintenance 2.8 Positive Work Values (Honesty, Quality, Common Sense Patience, Concern for Safety) 2.9 5 S (Sort, Systematize, Sweep, Standardize, Self Discipline) 3. Underpinning Skills 3.1 Recognizing and diagnosing vehicle faults and irregularities 3.2 Performing housekeeping 3.3 Writing and documenting simple report 3.4 Communicating skills 3.5 Handling of tools and materials 4. Resource Implications The following resources must be provided: 4.1 Passenger Bus or Straight Truck 4.2 Supplies and materials relevant to the task 4.3 Workplace for conducting routine servicing and maintenance 4.4 Room for written examination 5. Method of Assessment Competency must be assessed through 5.1 Observation with Questioning 5.2 Demonstration with Questioning 5.3 Interview 5.4 Written examination 6. Context for Assessment Practical assessment must be conducted at TESDA accredited assessment centers and/or in an appropriate work situation",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 42 UNIT OF COMPETENCY: PERFORM PRE- AND POST OPERATION PROCEDURES ON VEHICLES CLASSIFIED UNDER LTO RESTRICTION CODES 3 UP TO 5 UNIT CODE: ALT832305 UNIT DESCRIPTOR: This unit describes the outcomes required in performing procedures before operating vehicles classified under LTO restriction codes 3 up to 5. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Perform visual check vehicle 1.1 Vehicle serviceable parts are checked in accordance with vehicle checklist and manufacturer’s procedures. 1.2 Walk-around check is performed with vehicle checklist and with engine stopped/not running. 1.3 Electrical terminal is checked in accordance with manufacturer’s procedures. 2. Perform “BLOWAF” check 2.1 “BLOWAF” check is performed in accordance with standard operating procedures. 2.2 Deficiencies or findings in BLOWAF check are identified and appropriate corrective measures are undertaken in accordance with manufacturer’s specification. 2.3 Abnormal conditions are noted in checklist and reported to authorized person. 3. Perform operation check 3.1 Starting/running check is performed in accordance with manufacturer’s specifications. 3.2 Operating condition of instruments, gauges, indicators and controls are performed in accordance with manufacturer’s recommendation. 3.3 Operating condition of air brake and steering controls are checked in accordance with manufacturer’s recommendation. 3.4 Walk-around check, with engine running, is performed in accordance with manufacturer’s recommendation. 3.5 Safety devices and accessories are checked for proper functions in accordance with safe operating procedures. 4. Perform post-operation procedures 4.1 Vehicle is parked and engine turned off after productive operation in accordance with company rules and regulations. 4.2 Vehicle controls are set into neutral position and parking brakes are engaged according to manufacturer’s operations manual. 4.3 Safety locks and brakes are all set/engaged in accordance with operator’s manual. 4.4 Walk-around inspection check is re-conducted while doing engine cool down 4.5 Daily vehicle time record/report/inspection is accomplished/submitted according to company rules and regulations",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 43 RANGE OF VARIABLES VARIABLE RANGE 1. Vehicle serviceable parts 1.1 Air cleaner 1.2 Battery terminals/Connection 1.3 Belt 1.4 Tires 1.5 Grease/lube points 1.6 Fuel water separator 1.7 Air tank 1.8 Radiator 1.9 Mirrors 1.10 Lights (signal, back, tail, head) 1.11 Air hose and connectors 2. Walk-around check 2.1 Tires 2.2 Leaks (oil, water, air, fluid) 2.3 Worn out/damaged parts 2.4 Fluid levels 2.5 Loose parts/connections 2.6 Missing parts 2.7 Gauges and controls 2.8 Safety devices (seat belt, EWD, blinkers) 2.9 Unusual sounds 2.10 Window glass 2.11 Passenger’s seat condition 2.12 Curtains 2.13 Baggage compartment 3. B L O W A F check 3.1 Battery (starting and charging system) 3.2 Light (lighting system) 3.3 Oil (lubricating system) 3.4 Water (cooling system) 3.5 Air (intake and exhaust system) 3.6 Fuel (fuel system) 4. Deficiencies 4.1 Fluid level (oil, coolant, electrolyte/distilled water) 4.2 Air pressure (tire and brake) 4.3 Defective light bulbs, lens and reflector 4.4 Malfunctioning air-conditioning system 5. Authorized person 5.1 Supervisor 5.2 Dispatcher 5.3 Maintenance personnel 5.4 Conductor 6. Safety devices and accessories 6.1 Blinkers 6.2 Safety belt 6.3 Windshield guard 6.4 Warning light siren 6.5 Early Warning Device (EWD) 7. Safety locks 7.1 Power Door and lock 7.2 Maxi Brake 7.3 Differential lock 7.4 Steering lock 7.5 Parking Brakes 8. Vehicle 8.1 Passenger Bus 8.2 Straight Truck",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 44 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1 Performed visual check of articulated vehicle 1.2 Performed “BLOWAF” inspection 1.3 Performed operation check 1.4 Performed post operation procedures 2. Underpinning Knowledge and Attitude 2.1 Kinds of Articulated vehicle and capacity 2.2 Kinds of Busses and capacity 2.3 Types of Straight Trucks and capacity 2.4 Kinds of Passengers and Loads 2.5 Controls, instruments, indicators and their usage 2.6 Principle of operation of electrical, pneumatics and hydraulic systems 2.7 Lubricants and oils 2.8 Basic mathematics (MDAS) 2.9 Local and national road traffic regulations 2.10 Starting and shutdown procedures 2.11 Manufacturer’s operation manual 2.12 Job site and work conditions 2.13 Documentation (tickets, forms, checklists, receipts, reports) 2.14 Pre- and post-operation procedures 2.15 Positive work values (honesty, courtesy, cost/time/quality consciousness, etc.) 3. Underpinning Skills 3.1 Communication skills 3.2 Performing pre- and post-operation procedures on vehicle with standard or special attachments 3.3 Accomplishing pre- and post-operation checklist 3.4 Handling Passengers 3.5 Computation skills on fare, distances and time 4. Resource Implications The following resources must be provided: 4.1 Passenger Bus or Straight truck 4.2 Appropriate work area for the activity 4.3 Tools, materials and equipment 4.4 Vehicle operator’s manual 5. Method of Assessment Competency must be assessed through: 5.1 Written examination 5.2 Observation with questioning 5.3 Demonstration with questioning 5.4 Portfolio 6. Context for Assessment Competency must be assessed in the workplace or in a simulated workplace environment accredited by TESDA.",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 45 UNIT OF COMPETENCY: OBEY AND OBSERVE TRAFFIC RULES AND REGULATIONS CODE: ALT832303 UNIT DESCRIPTOR: This unit involves the skills, knowledge and attitudes required in following traffic rules and regulations while driving articulated vehicle. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Observe traffic signs and road markers 1.1 Traffic signs and road markers are identified and followed in accordance with concerned traffic authorities. 2. Obey traffic rules and regulations 2.1 Traffic rules and regulations are identified and followed in accordance with concerned traffic authorities. 2.2 License and registrations are maintained as prescribed by law. 2.3 Driver outfit/attire is worn as prescribed by law. 3. Practice courtesy 3.1 Positive work values are demonstrated as per code of ethics of drivers 3.2 Complaints are responded and handled with respect based on driver's code of ethics 4. Respect traffic enforcers and other traffic management personnel 4.1 Traffic authority instructions are complied with as prescribed by law. 4.2 Traffic violation tickets/receipts issued by Traffic enforcers are accepted and appropriate action is taken.",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 46 RANGE OF VARIABLES VARIABLE RANGE 1. Traffic signs Traffic signs include but are not limited to: 1.1 No blowing of horns 1.2 Yield 1.3 No Parking 1.4 One way 1.5 No U-turn 2. Road Markers 2.1 Merging traffic 2.2 No overtaking 2.3 Pedestrian lane 2.4 Total stop 3. Traffic rules and regulations Traffic rules and regulations include: 3.1 Stalled vehicle 3.2 Illegal parking 3.3 Wearing of safety belts 3.4 Observing the Truck Ban Rules 3.5 Driving license/registration/franchise/Official receipt and certificate of registration (ORCR) 3.6 No using of cellphone while driving 3.7 Avoiding driving under the influence of drugs or alcohol 4. Prescribed Attire/Outfit Proper attire or outfit prescribed by law include but are not limited to: 4.1 Company-prescribed attire 4.2 Shoes appropriate for driving",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 47 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate 1.1 Followed traffic signs and road markers 1.2 Obeyed traffic rules and regulations 1.3 Practiced courtesy and good communication 1.4 Respected traffic enforcers and other traffic management units. 2. Underpinning Knowledge and Attitude 2.1 Traffic signs and symbols 2.2 Road markers 2.3 Traffic rules and regulations 2.4 Defensive driving techniques 2.5 Positive work values 2.6 Driver's Code of ethics 2.7 Different Traffic Enforcers 2.8 Traffic violations and penalties 2.9 Good grooming 3. Underpinning Skills 3.1 Communication skills 3.2 Interpersonal skills 3.3 Managing conflict 4. Resource Implications The following resources must be provided: 4.1 Articulated vehicle with appropriate tools/instruments for actual performance of works 4.2 Ample space for driving including traffic signs and symbols for driving and maneuvering the articulated vehicle 4.3 Well lighted and ventilated room with table and chairs for written/oral assessment 5. Method of Assessment Competency must be assessed through: 5.1 Observation with questioning 5.2 Demonstration with questioning 5.3 Interview 5.4 Written or Oral examination 6. Context for Assessment 6.1 Competency must be assessed in actual workplace or simulated environment 6.2 Assessment of competence must comply with the assessment requirements of the relevant Road and traffic control Authority",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 48 UNIT OF COMPETENCY: OBSERVE ROAD HEALTH AND SAFETY PRACTICES UNIT CODE: ALT832308 UNIT DESCRIPTOR: This unit covers the outcomes required to comply with regulatory and organizational requirements for occupational health and safety while driving. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Identify and evaluate hazards and risks 1.1 Safety regulations and workplace safety and hazard control practices and procedures are clarified and explained based on organization procedures 1.2 Effects of driving environment hazards/risks and their corresponding indicators are identified to minimize or eliminate risk to passengers, co-workers, workplace and environment in accordance with organization procedures 1.3 Contingency measures during emergencies are recognized and established in accordance with organization procedures 1.4 OHS issues and/or concerns and identified safety hazards are reported to designated personnel in accordance with workplace requirements and relevant workplace OHS legislation 2. Control hazards and risks 2.1 Occupational Health and Safety (OHS) procedures for controlling hazards/risks in workplace are consistently followed 2.2 Procedures for dealing with accidents, fire and emergencies are followed in accordance with organization OHS policies 2.3 Space management and defensive driving techniques are practiced to avoid accidents. 2.4 Appropriate assistance is provided in the event of an emergency in accordance with established protocol 3. Maintain fitness for driving 3.1 Standards of health, fitness and well-being for driving on the road are maintained and adhered to at all times 3.2 LTO/LTFRB and company policies related to smoking, alcohol and prohibited drug use are complied with 3.3 Fatigue management strategies are applied to ensure concentration and alertness while driving",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 49 RANGE OF VARIABLES VARIABLE RANGE 1. Regulations May include but are not limited to: 1.1 Registration, driving license and other relevant permits 1.2 Use of safety belt 1.3 Availability of EWD 1.4 Observance of franchise route 1.5 Company uniform 1.6 Compliance with vehicle emission standards 2. Driving environment hazards/risks May include but are not limited to: 2.1 overhead cables 2.2 stalled vehicles and other road obstruction 2.3 excavation and road repairs 2.4 flood 2.5 heavy traffic volume 2.6 accidents 2.7 heavy rains and typhoons 2.8 Fog/smog 2.9 uneven loads 2.10 slippery roads 2.11 winding and zigzag roads 2.12 blind corners 2.13 humps 2.14 unattended children along streets 2.15 stray animals 2.16 reckless and uncooperative drivers 2.17 fire on vehicle 2.18 loose stones 2.19 mental and physical fatigue 3. Emergencies May include but are not limited to: 3.1 Vehicle collision and crash 3.2 Crime incident (hold-up, kidnapping and related crimes) 3.3 Hit-and-run 3.4 Fire caused by engine overheating or faulty electric wiring 4. Standards of health, fitness and well-being 4.1 health testing at intervals 4.2 drugs and alcohol use 4.3 stress 4.4 communicable diseases 4.5 adverse personal hygiene 4.6 vision, peripheral (70⁰) color blindness 4.7 hearing ability (hear whisper from 5 ft.) 5. Fatigue management strategies 5.1 assessment and planning of routes and schedules to minimize fatigue 5.2 making of lifestyle choices which promote the effective long-term fatigue management 5.3 avoiding multiple jobs 5.4 monitoring and taking action to minimize fatigue due to: 5.4.1 lifestyle factors such as: sleep patterns, alcohol and drug use, quantity and timing of food and drink, and opportunities for relaxation with family and friends 5.4.2 personal or biological factors such as: state of mental and/or physical health, inadequate sleep, sleep disorders, emotional stress, family responsibilities, relationship difficulties, inadequate competence to complete work tasks, and circadian rhythms",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 50 EVIDENCE GUIDE 1. Critical aspects of Competency Assessment requires evidence that the candidate: 1.1 Explained clearly established safety and hazard control practices and procedures 1.2 Identified driving hazards/risks in the workplace its effects and corresponding indicators 1.3 Recognized contingency measures during emergencies 1.4 Followed Occupational Health and Safety (OHS) procedures for controlling hazards/risks in workplace 1.5 Applied procedures in dealing with emergencies 1.6 Applied space management and defensive driving techniques 1.7 Maintained fitness for driving 2. Underpinning Knowledge 2.1 Relevant road rules, regulations, permit and license requirements 2.2 Relevant OHS and environmental procedures, practices and regulations 2.3 Driving hazards and related defensive driving techniques 2.4 Road signs and symbols 2.5 Space management 2.6 Defensive driving techniques 2.7 Organization safety and health protocol 2.8 Procedure to be followed in the event of a driving emergency 2.9 Causes and effects of fatigue on drivers 2.10 Fatigue management strategies 2.11 Personal hygiene practices 3. Underpinning Skills 3.1 Reading and interpreting instructions, procedures, information and signs relevant to driving 3.2 Practice of personal hygiene 3.3 Hazards/risks identification and control skills 3.4 Interpersonal skills 3.5 Communication skills 4. Resource Implications The following resources must be provided: 4.1 Workplace or assessment location 4.2 OHS personal records 4.3 PPE 4.4 Health records 5. Methods of Assessment Competency may be assessed through: 5.1 Portfolio Assessment 5.2 Interview 5.3 Case Study/Situation 6. Context for Assessment Competency may be assessed in the workplace or in a simulated workplace setting",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 51 UNIT OF COMPETENCY: IMPLEMENT AND COORDINATE ACCIDENT - EMERGENCY PROCEDURES UNIT CODE: ALT832304 UNIT DESCRIPTOR: This unit involves the skills, knowledge and attitudes required in responding to emergency incidents, follow-up support and assistance and communicate to concerned individual during emergency. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Respond to emergencies 1.1 Emergency and potential emergency situations are identified and assessed based on emergency procedure. 1.2 Actions are prioritized and provided based on the criticality of the emergency situation. 1.3 Incident reports are prepared in accordance with regulatory and workplace procedures 1.4 Responsibilities are fulfilled in accordance with emergency procedures and/or regulatory requirements 2. Arrange follow-up support and assistance 2.1 Medical assistance and support is arranged in accordance with workplace procedures 2.2 First aid is applied in accordance with medical procedure 2.3 Passenger needs are identified and provided based on emergency situation.",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 52 RANGE OF VARIABLES VARIABLE RANGE 1. Emergency Emergency situation and incidents may include the following but not limited to: 1.1 Vehicle collision 1.2 Crime incidents (hold-up, kidnapping and related crimes) 1.3 Hit and run 1.4 Fire resulted from engine overheating or faulty electric wiring 2. Responsibilities 2.1 Reporting to police authority 2.2 Facilitate Insurance claim 2.3 Informing victim’s relatives 2.4 Respond to investigation and authority inquiry 3. Action 3.1 Facilitating medical assistance 3.2 Transporting of injured passenger to the nearest medical facility 3.3 Transporting of road crime victim to police station 3.4 Giving reminders to passengers while on board the public transport vehicle 3.5 Providing assistance in controlling the site both prior to and following arrival of emergency services",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 53 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate 1.1 Responded to emergency situations 1.2 Arranged follow-up support and assistance 2. Underpinning Knowledge and Attitudes 2.1 Relevant OHS and environmental procedures and regulations 2.2 Kinds of emergency situations 2.3 Procedure to be followed in the event of emergency 2.4 Problem that may arise during emergency situations 2.5 First aid practices 2.6 Kinds of body injury and how to deal with them 2.7 Positive work values (Honesty, Presence of mind, Compassion, etc.) 3. Underpinning Skills 3.1 Appropriate reporting and preparing of necessary documentation to authority and medical personnel 3.2 Handling injured person 3.3 Transporting injured persons 3.4 Handling and use of fire extinguishers 3.5 Following emergency procedures 3.6 Handling crime situations 4. Resource Implications The following resources MUST be provided: 4.1 Simulation equipment and materials used for demonstrating emergency situation 4.2 Vehicle unit 4.3 A well-ventilated and lighted room with table and chairs for written/oral examination 5. Method of Assessment Competency must be assessed through: 5.1 Demonstration of the task in implementing and coordinating accident-emergency procedures 5.2 Interview 5.3 Written/oral exam 6. Context for Assessment 6.1 Competency must be assessed in actual workplace or simulated environment 6.2 Assessment of competence must comply with the assessment requirements of the relevant Road and traffic control Authority",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 54 UNIT OF COMPETENCY: DRIVE PASSENGER BUS CODE NO.: ALT832306 UNIT DESCRIPTOR: This unit involves the skills, knowledge and attitudes required to drive a passenger bus safely including handling of passengers, systematic and efficient control of all vehicle functions, monitoring of traffic/road conditions, management of vehicle condition, and effective management of hazardous situations. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Perform passenger bus pre-starting and warm-up 1.1 Passenger bus inspection is performed as per manufacturer’s specification 1.2 Safety harness/devices and tools are checked according to LTO/LTFRB requirements 1.3 Warm up of passenger bus is performed as per manufacturer's manual 2. Drive passenger bus 2.1 Passenger bus is driven in accordance with traffic rules and regulations and manufacturer’s instruction 2.2 Driving hazards are identified and/or anticipated and avoided or controlled through defensive driving as per standard operating procedures. 2.3 The passenger bus is parked, shut down and secured in accordance with manufacturer’s specifications, traffic regulations and workplace procedures 2.4 Passengers and loads are transported up to the route assigned and fares are collected as per LTFRB regulations 2.5 Driving is performed according to the restriction and condition stated in the official receipt license and within the occupational health and safety standards (OHS). 2.6 Out-of-line/anti carnapping clearance/special permit is secured as per traffic rules and regulations 3. Monitor and maintain passenger bus performance 3.1 Defective or irregular performance or malfunctions are monitored and reported to the appropriate person/authority. 3.2 Minor vehicle maintenance is performed in accordance with manufacturer's instruction 3.3 Vehicle records are maintained/updated in accordance with workplace procedures",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 55 RANGE OF VARIABLES VARIABLE RANGE 1. Passenger bus 1.1 Tourist 1.2 Public utility 1.3 Shuttle or company 1.4 School 1.5 Single or double decker 2. Passenger bus inspection 2.1 Lights (headlight, park light, signal lights, hazard, etc.) 2.2 Mirrors (rear view, side view, windshields, etc.) 2.3 Under hood 2.4 Under chassis 2.5 Passenger seats 2.6 Spare tires 2.7 Air conditioning system 3. Fares 3.1 Tickets 3.2 Fare matrix 4. Safety harness/devices & tools 4.1 Seat belt 4.2 Early Warning Device 4.3 Hand tools (Wrench, pliers, screwdriver, early warning device, jack, spare tires) 4.4 Flashlights or emergency lighting device 4.5 Fire extinguisher 4.6 Passenger Hand straps 4.7 Emergency exit door 4.8 Consumable materials and spare parts such as • Rags • Fan belt • Wheel cap • Fuse • Electrical tapes • Brake fluid • Motor oil 5. Traffic regulations 5.1 Registration, driving license and other relevant permits 5.2 Use of seat belt 5.3 Availability of EWD 5.4 Observance of franchise route 5.5 Use of uniform 5.6 Compliance with vehicle emission standards 5.7 Observance of city ordinances",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 56 VARIABLE RANGE 6. Driving hazards 6.1 Stalled vehicles and other road obstruction 6.2 Excavation and road repairs 6.3 Flood 6.4 Heavy traffic volume 6.5 Accidents 6.6 Heavy rains and typhoons 6.7 Fog/smog 6.8 Uncentered force of gravity or inertia 6.9 Slippery roads 6.10 Rock/Land slides 6.11 Check points 6.12 Slow moving vehicles 6.13 No tail light vehicles 6.14 Undisciplined pedestrians 6.15 Winding and zigzag road 6.16 Blind corners 6.17 Humps 6.18 Unattended children along streets 6.19 Stray animals 6.20 Open manhole 6.21 Reckless and uncooperative drivers 6.22 Loose stones 6.23 Mental and physical fatigue 7. Occupational Health & Safety 7.1 Safety in handling vehicle and passengers while driving 7.2 Safety on road and traffic management including management of pedestrians 7.3 Use of personal protective equipment and devices such as uniform, gas mask, gloves, sunglasses, shoes, cap 7.4 Use of seat belt and early warning devices",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 57 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate 1.1 Performed pre-operational and warm up 1.2 Drove passenger bus according to traffic rules and regulations 1.3 Transported cargoes/loads to destination. 1.4 Monitored and maintained vehicle performance 1.5 Followed OHS and environmental protection procedures and regulations 1.6 Followed emergency procedures 2. Underpinning Knowledge and Attitudes 2.1 Relevant OHS and environmental procedures and regulations 2.2 Parts of Passenger bus and its functions 2.3 Types of load or cargo 2.4 Procedure on how to drive the Passenger bus 2.5 Procedure to be followed in the event of emergency and road related crimes 2.6 Engine power management and safe driving strategies 2.7 Fatigue management techniques 2.8 Principle of stress management when driving a vehicle 2.9 Traffic rules and regulations 2.10 Kinds of traffic violations 2.11 Positive work values (Honesty, Patience, Perseverance, Courtesy, etc.) 3. Underpinning Skills 3.1 Computing fares, distances and travel time 3.2 Managing fatigue while driving 3.3 Reading/Interpreting traffic signs and symbols and road advisory 3.4 Maintaining proper distance and speed 3.5 Responding to road-related accidents and crimes encountered 4. Resource Implications The following resources must be provided: 4.1 Passenger bus with appropriate tools/instruments for actual performance of works 4.2 Driver's Manual 4.3 Ample space for driving including traffic signs and symbols for driving and maneuvering the Passenger bus 5. Method of Assessment Competency must be assessed through 5.1 Written test 5.2 Observation with Questioning 5.3 Demonstration with Questioning 5.4 Interview 5.5 Portfolio 6. Context for Assessment 6.1 Competency may be assessed in actual workplace or simulated environment accredited by TESDA. 6.2 Assessment of competence must comply with the assessment requirements of the relevant Road and traffic control Authority",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 58 UNIT OF COMPETENCY: DRIVE STRAIGHT TRUCK CODE NO.: ALT832307 UNIT DESCRIPTOR: This unit involves the skills, knowledge and attitudes required to drive a straight truck safely including handling of cargo, systematic and efficient control of vehicle functions, monitoring of traffic and road conditions, management of vehicle condition and effective handling management of hazardous materials and situations. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Perform straight truck pre-starting and warm-up 1.1 Straight truck inspection is performed as per manufacturer’s specification 1.2 Safety harness/devices and tools are checked according to LTO/LTFRB requirements 1.3 Warm up of straight truck is performed as per manufacturer's manual 2. Drive straight truck 2.1 Straight truck is driven in accordance with traffic rules and regulations and manufacturer’s instruction 2.2 Driving hazards are identified and/or anticipated and avoided or controlled through defensive driving as per standard operating procedures. 2.3 The straight truck is parked, shut down and secured in accordance with manufacturer’s specifications, traffic regulations and workplace procedures 2.4 Cargoes/loads are secured and transported up to the route assigned per LTFRB regulations 2.5 Driving is performed according to the restriction and condition stated in the official receipt license and within the occupational health and safety standards (OHS). 2.6 Trip ticket/way bill is secured during the trip as per company procedure 2.7 Accidents and emergencies encountered are reported as per company procedure 2.8 Information on road and travel condition is disseminated to the company as per standard operating procedures 2.9 Dumping of truck load is performed as per standard operating procedures. 3. Monitor and maintain straight truck performance 3.1 Defective or irregular performance or malfunctions are monitored and reported to the appropriate person/authority. 3.2 Minor vehicle maintenance is performed in accordance with manufacturer's instruction 3.3 Vehicle records are maintained/updated in accordance with workplace procedures",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 61
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 59 RANGE OF VARIABLES VARIABLE RANGE 1. Straight truck 1.1 Dump truck 1.2 Cement Mixer 1.3 Concrete pump 1.4 Tanker with no pivotal pin 1.5 Bulk Carrier 1.6 Any Vehicle from 6 to 12 wheelers 2. Straight Truck inspection 2.1 Battery (starting and charging system) 2.2 Light (lighting system) 2.3 Oil (lubricating system) 2.4 Water (cooling system) 2.5 Air (intake and exhaust system) 2.6 Fuel (fuel system) 3. Cargoes 3.1 Container van 3.2 Loose Cargoes 3.3 Tanker 3.4 Soil, Gravel or Sand 3.5 Bulk 4. Safety harness/devices tools materials and spare parts 4.1 Seat belt 4.2 Early Warning Device 4.3 Handtools (Wrench, pliers, screwdriver, early warning device, jack, spare tires) 4.4 Flashlights or emergency lighting device 4.5 Nylon/wire/chain with binder 4.6 Canvass cover 4.7 Permit to dump materials (environmental/municipal) 4.8 Consumable materials and spare parts such as  Rags  Fan belt  Fuse  Electrical tapes  Brake fluid  Motor oil 4.9 Chain with binder 4.10 Strap belt 4.11 Wooden wedge 4.12 Pole",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 62
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 60 VARIABLE RANGE 5. Traffic regulations 5.1 Registration, driving license and other relevant permits 5.2 Use of seat belt 5.3 Availability of EWD 5.4 Observance of franchise route 5.5 Company uniform 5.6 Compliance with vehicle emission standards 6. Driving hazards 6.1 Overhead cables 6.2 Stalled vehicles and other road obstruction 6.3 Excavation and road repairs 6.4 Flood 6.5 Heavy traffic volume 6.6 Accidents 6.7 Heavy rains and typhoons 6.8 Fog/smog 6.9 Uneven loads 6.10 Slippery roads 6.11 Winding and zigzag road 6.12 Blind corners 6.13 Humps 6.14 Unattended children along streets 6.15 Stray animals 6.16 Reckless and uncooperative drivers 6.17 Loose stones 6.18 Mental and physical fatigue 7. Occupational Health & Safety 7.1 Safety in handling vehicle and cargoes while driving 7.2 Safety on road and traffic management including management of pedestrians 7.3 Use of personal protective equipment and devices such as uniform, gas mask, gloves, sunglasses, safety shoes 7.4 Use of seat belt and early warning devices",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 63
                },
                "type": "Document"
            },
            {
                "page_content": "TR – DRIVING (Passenger Bus/Straight Truck) NC III Promulgated January 14, 2011 61 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate 1.1 Performed pre-operational and warm up 1.2 Drove straight truck 1.3 Transported cargoes/loads to destination. 1.4 Monitored and maintained vehicle performance 1.5 Followed OHS and environmental protection procedures and regulations 1.6 Followed emergency procedures 2. Underpinning Knowledge and Attitudes 2.1 Relevant OHS and environmental procedures and regulations 2.2 Kinds of straight truck and its functions 2.3 Types of load or cargo 2.4 Procedure on how to drive the straight truck 2.5 Procedure to be followed in the event of emergency and road related crimes 2.6 Engine power management and safe driving strategies 2.7 Fatigue management techniques 2.8 Principle of stress management when driving a vehicle 2.9 Traffic rules and regulations 2.10 Kinds of traffic violations 2.11 Positive work values (Honesty, Patience, Perseverance, Courtesy, etc.) 3. Underpinning skills 3.1 Computing distances and travel time 3.2 Managing fatigue while driving 3.3 Reading/Interpreting traffic signs and symbols and road advisory 3.4 Maintaining proper distance and speed 3.5 Responding to road-related accidents and crimes encountered 4. Resource implications The following resources must be provided: 4.1 Straight truck with appropriate tools/instruments for actual performance of works 4.2 Driver's Manual 4.3 Ample space for driving including traffic signs and symbols for driving and maneuvering the straight truck 5. Method of assessment Competency must be assessed through 5.1 Written test 5.2 Observation with Questioning 5.3 Demonstration with Questioning 5.4 Interview on previous work experiences 5.5 Portfolio 6. Context for assessment 6.1 Competency may be assessed in actual workplace or simulated environment accredited by TESDA 6.2 Assessment of competence must comply with the assessment requirements of the relevant Road and traffic control Authority",
                "metadata": {
                    "source": "datasets\\raw\\Driving (Passenger BusStraight Truck) NC III.pdf",
                    "page": 64
                },
                "type": "Document"
            }
        ]
    }
]