[
    {
        "name": "Electrical Installation and Maintenance NC II",
        "core_competencies": [
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 31 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM ROUGHING-IN ACTIVITIES, WIRING AND CABLING WORKS FOR SINGLE-PHASE DISTRIBUTION, POWER, LIGHTING AND AUXILIARY SYSTEMS UNIT CODE: ELC 74 1 3 01 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes on installing electrical metallic and non-metallic conduit, wire ways and cable clamp, auxiliary terminal cabinet and distribution frame panel board/safety switch and used in roughing-in based on the required performance standards. This unit also covers the outcomes required in preparing for cable pulling and installation, performing wiring and cabling layout and notifying completion of work for single-phase distribution, power, lighting and auxiliary systems. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Install electrical metallic / non-metallic (PVC conduit) 1.1 Correct drawings are interpreted based on job requirements 1.2 Correct quantities of conduit, fittings and accessories are determined as per job requirements 1.3 Tools and equipment are selected as per job requirements 1.4 Conduit is assembled ensuring that fittings are fully inserted and tightened as per job requirements 1.5 Conduit is bent with bends not exceeding 90° as per job requirements 1.6 Conduit couplings and elbows are installed as per job requirements 1.7 Conduit is threaded in line with job requirements 1.8 Safety procedures are followed in line with standard operating procedures (SOPs)  Interpretation of electrical wiring diagrams  mechanical drawings  Types of electrical conduits  Proper uses and installation of conduits  Techniques in installing and bending of conduits and fittings  Proper Installation for maintenance accessibility  Safe use of adhesives  Proper use of safety harness (PPE)  Reading skills required to interpret work instructions  Handling of materials and tools and equipment  Laying out conduits  Bending electrical metallic conduits  Cutting conduits  Performing the installation  economically",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 32 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Install wire ways and cable tray 2.1 Correct drawings are interpreted to determine job requirements 2.2 Correct quantities of materials are selected as per job requirements 2.3 Tools and equipment are selected as per job requirements 2.4 Wire ways and cable trays are installed as per job requirements. 2.5 Safety procedures are followed in line with SOPs  Mensuration  Blue print reading  Materials specification  Use of materials, tools and equipment  Interpretation of an electrical and mechanical drawing.  Proper uses and installation of wire ways and cable trays  Suitability for installation and used of bus way, cable tray, fittings and panels in conformity with the provision of the PEC.  Proper use of safety harness (PPE)  Interpreting technical plan  Effective communication skills (written and oral)  Effective use of measuring devices  Installing wire ways and cable tray 3. Install auxiliary terminal cabinet and distribution panel 3.1 Correct drawings are interpreted to determine job requirements 3.2 Correct quantities of materials are selected as per job requirements 3.3 Tools and equipment are selected as per job requirements 3.4 Auxiliary terminal cabinet is installed as per job requirements 3.5 Auxiliary main distribution frame is installed as per job requirements 3.6 Safety procedures are followed in line with SOPs  Mensuration  Blue print reading and materials specification  Use of wires and cables and tools,  Interpretation of electrical and mechanical drawing  Proper procedure in installation of auxiliary terminal cabinet and distribution panels.  Proper use of safety harness and PPE  Interpreting technical plan  Effective communication skills (written and oral)  Effective use of measuring devices  Installing different types of panel/frame 4. Prepare for cable pulling and installation 4.1 Necessary tools, equipment, materials and personal protective equipment (PPE) are prepared in line with job requirements. 4.2 Cable pulling & installation requirements and constraints from plan and site inspection are identified as per job requirements. 4.3 Cable layout & installation equipment is set up in accordance with  Mensuration  Blue print reading and materials specification  Use of wires, cables and tools  Preparation of required size of cable based on PEC Wire Table  Cable pulling and installation requirements  Cable layout and  Interpreting technical plan  Effective communication skills (written and Oral)  Effective use of measuring devices  Interpreting plans and drawings  Handling of",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 33 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS manufacturer's and job requirements. 4.4 Site is made safe and secure for cable installation. 4.5 Suitable protective clothing is selected and required safety devices are used 4.6 Support structure is assessed as safe for normal working conditions. installation materials, tools and equipment  Applying methods and techniques in various type of wiring wires and cables  Pulling of conductors 5. Perform wiring and cabling layout 5.1 Safety procedures are followed based on safety regulations PPE are identified and selected in line with safety requirements 5.2 Tools, equipment, pulling compound and safety requirements are identified and obtained for the layout and installation. 5.3 Pulling materials is properly installed and tensioned to required specifications 5.4 Cable is secured permanently to support structure in accordance with standard installation procedures 5.5 Bending radius and loops tolerance is observed for cable materials at all times 5.6 Schedule of wire cutting lists is followed based on estimates, quantity and sizes to avoid wastage. 5.7 Further instructions are sought if unplanned events or conditions occur 5.8 Checking of quality of work is done in accordance with instructions and requirements.  DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry  Wiring procedure such as cable lay-out, pulling splicing and termination of wire.  Uses of different type of wires and cables and its applications  Markings of Circuit homeruns.  Application of pulling compound  Bundling of wire size as per job requirement.  Applying methods and techniques in various type of wiring wires and cables  Wiring-up the required electrical control based on the standard.  Connecting and terminating of motor terminal/ leads out and the control devices.  Checking for continuity test or ohmmeter test of motor terminal.  Terminating wires  Performing the installation economically.",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 34 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 6. Notify completion of work 6.1 Final checks are made to ensure that work conforms with instructions and job requirements 6.2 Supervisor is notified upon completion of work 6.3 Tools, equipment and any surplus resources and materials are, where appropriate, cleaned, checked and returned to storage in accordance with established procedures 6.4 Work area is cleaned up and made safe according to OHSA regulations  Processes, Operations, Systems o Maintenance of tools o Storage of tools  Checking and Conforming procedures in installation based on job requirement  Good housekeeping  Skills in continuity test or ohmmeter test of motor terminal.  Commissioning skills  Documentation and reporting skills",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 35 RANGE OF VARIABLES VARIABLE RANGE 1. Metallic conduits / non-metallic conduit 1.1 Rigid Steel Conduits (RSC) 1.2 Intermediate Metallic Conduit (IMC) 1.3 Electrical Metallic Tubing (EMT) 1.4 Polyvinyl Chloride Pipe (PVC) 2. Fittings 2.1 Condulets and Reducers 2.2 lock nut and bushing 2.3 Entrance cap 2.4 Nipple 2.5 Elbow 3. Accessories 2.1 Boxes  Utility Box  Junction Box  Pull box/Splice box 2.2 Conduit supports (e.g. hangers) 2.3 Conduit Strap 2.4 Connectors (straight and angle) 4. Tools and equipment Including but not limited to: 3.1 Spirit level, hack saw, pipe cutter, plumb bob, pipe reamer, pipe threader, pipe bender, bolt cutter, electric drill 3.2 Electrical power tools - Power drills - Portable grinder 4. Installation 4.1 Electrical Metallic conduit - Fitting/coupling/connector fully inserted and tightened - Elbows with clamps/supports for mounting - Conduit rigidly anchored to building structure - Smooth field off-set bends - Conduit bend not to exceed 90° - Standard distance between supports - Conduit ends reamed and without sharp edges - Conduit cut to length requirement 4.2 Wire ways and cable tray - Boxes plumb to ground and rigidly anchored to walls building structure - Conduit rigidly clamp to building structure - Couplings fully inserted - Ground wire bonding jumper each joint. 4.3 Auxiliary terminal cabinet and distribution panel. - Conduit ends reamed and cleaned of burrs and rough edges - Fitting fully inserted and applied with adhesive solvent - Conduit cut to length requirement - PVC coupling with adhesive solvent",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 36 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Installed electrical metallic /non-metallic (PVC conduit) 1.2 Installed wire ways and cable tray 1.3 Installed auxiliary terminal cabinet and distribution panel 1.4 Prepared for cable pulling and installation 1.5 Performed wiring and cabling layout 1.6 Notified completion of work 2. Resource Implications The following resources MUST be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate to roughing-in, wiring and cabling works and installation processes 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3. Methods of Assessment Competency must be assessed through: 3.1 Direct observation of application to tasks. 3.2 Questions related to underpinning knowledge 3.3 Demonstration 3.4 Written test 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in a simulated workplace setting 4.2 Assessment shall be done while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 37 UNIT OF COMPETENCY: INSTALL ELECTRICAL PROTECTIVE DEVICES FOR DISTRIBUTION, POWER, LIGHTING, AUXILIARY, LIGHTNING PROTECTION AND GROUNDING SYSTEMS UNIT CODE: ELC 741302 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes on planning and preparing work, installing electrical protective devices, lightning fixture and auxiliary outlet and notifying completion of work for distribution, power, lighting, auxiliary, lightning protection and grounding systems. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Plan and prepare work 1.1 Instructions for the preparation of the work activity are communicated and confirmed to ensure clear understanding 1.2 Tools, equipment and PPE needed to install electrical wiring are identified, checked to ensure they work correctly as intended and are safe to use in accordance with established procedures 1.3 Materials needed for work are obtained in accordance with established procedures.  Types of protective devices and its applications/applications  Identification of standard drawing based on standard (ANSI or IEC)  Protective devices specifications  Electrical protection system components  Interpreting plans and details drawing.  Handling of materials, tools and equipment 2. Install electrical protective devices 2.1 Safety procedures are followed in line with job requirements 2.2 Correct procedures for installation of electrical protective devices are performed in line with job requirements and PEC 2.3 Schedule of work is followed to ensure work is completed in an agreed time, to a quality standard and with a minimum waste 2.4 Further instructions are sought from a supervisor if unplanned events or conditions occur 2.5 On-going checks of quality of work are done in accordance with instructions and requirements  DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry  Philippine Electrical Code (PEC) requirements regarding installation of electrical protection devices  Uses of different protective devices - o panelboard; o circuit breaker; o safety switch; o ground fault current interrupting device (GFCI); and o conventional atmospheric lightning protection and grounding system  Interpreting plans and details drawing.  Applying methods and techniques in installation of various type of protective devices and lightning protection and grounding systems  Performing the installation economically.",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 38 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Install lighting fixture and auxiliary outlet. 3.1 Safety procedures are followed 3.2 Correct procedures for installation of lighting fixture and auxiliaries are performed in line with job requirements 3.3 Schedule of work is followed to ensure work is completed in an agreed time, to a quality standard and with a minimum waste 3.4 Further instructions are sought from a supervisor if unplanned events or conditions occur. 3.5 On-going checks of quality of work are undertaken in accordance with instructions and requirements.  DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry  Philippine Electrical Code (PEC) requirements regarding installation of lighting fixture and auxiliary outlet  Types of lighting fixtures and installation technique  Ratings of lighting fixture  Interpreting plans and details  Handling of materials, tools and equipment  Interpreting product technical brochure  Applying methods and techniques in installation of various type of lighting fixture and auxiliary outlet 4. Notify completion of work. 4.1 Final checks are made to ensure the work conforms with instructions and requirements 4.2 Supervisor is notified upon completion of work 4.3 Tools, equipment and any surplus resources and materials are, where appropriate, cleaned, checked and returned to storage in accordance with established procedures 4.4 Work area is cleaned and made safe  Processes, Operations, Systems o Maintenance of tools o Storage of tools  Checking and conforming procedures for installation based on job requirement  Good housekeeping  Skills in continuity test or ohmmeter test of motor terminal.  commissioning skills  Documentation and reporting skills",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 39 RANGE OF VARIABLES VARIABLE RANGE 1. Tools and equipment Tools and equipment may include but not limited to: 5.1 Pliers 5.2 Screwdrivers 5.3 Wrenches 5.4 Wire splicers 5.5 Electrician knives 5.6 electric drill 5.7 Ball hammer 2. Personal protective equipment (PPE) 2.1 Working gloves 2.2 Safety shoes 2.3 Hard hat 3. Safety procedures Safety procedures included in: 3.1 Philippine Electrical Code 3.2 Safety standards 4. Installation 4.1 Horizontally and vertically aligned 4.2 Rigidly anchored to wall 4.3 Installed with clearance to wall/other boxes for cover to open freely 4.4 Enough clearance for cover opening for flush mounted 5. Electrical protection system component 5.1 Safety switch 5.2 Earth Leakage Circuit Breaker (ELCB) 5.3 Conventional atmospheric lightning protection 5.4 Grounding system 6. lighting fixture 6.1 Lamps 6.2 Spotlights 6.3 Track lights 6.4 Perimeter lighting",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 40 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Correctly interpreted work instructions 1.2 Selected appropriate tools, equipment and materials for installation of electrical protection system 1.3 Selected and used correct PPE 1.4 Demonstrated correct procedures on installation of electrical protective devices 1.5 Demonstrated correct procedures on installation of lighting fixture and auxiliary outlet 1.5 Followed safety procedures/protocol 1.6 Cleaned worksite, tools and equipment 1.7 Stored surplus materials 2. Resource Implications The following resources MUST be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate for installation of electrical protection systems 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3. Methods of Assessment Competency must be assessed through: 3.1 Direct observation of candidate's application of knowledge to tasks. 3.2 Questions related to underpinning knowledge 3.3 Demonstration/Practical activity 3.4 Written test 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in simulated workplace setting 4.2 Assessment shall be observed while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 41 UNIT OF COMPETENCY: INSTALL WIRING DEVICES OF FLOOR AND WALL MOUNTED OUTLETS, LIGHTING FIXTURE/SWITCHES AND AUXILIARY OUTLETS UNIT CODE: ELC 74130 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes on selecting and installing wiring devices, installing lighting fixtures/switches and notifying completion of work of floor and wall mounted outlets and auxiliary outlets. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Select wiring devices 1.1 Drawings are read and interpreted to determine job requirements 1.2 Correct type and quantity of wiring devices and consumable items are identified in line with job requirements 1.3 Tools and equipment are selected in line with job requirements 1.4 Correct PPE are identified and selected in line with safety requirements • Blue print reading • Materials specification • Types and uses of electrical wiring devices, tools and equipment • Proper PPEs • Interpreting plans and details • Handling of materials, tools and equipment • Communication (written and oral) • Selecting wiring devices 2. Install wiring devices 2.1 Safety procedures are followed based on safety regulations 2.2 Correct procedures for installation of wiring devices are performed in line with job requirements 2.3 Schedule of work is followed based on agreed time, quality standard and minimum wastage 2.4 Further instructions are sought if unplanned events or conditions occur 2.5 On-going checking of quality of work is done in accordance with instructions and requirements. • Installation procedures of various wiring devices • DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry • PEC requirement regarding installation of wiring devices • Applying methods and techniques in various type of wiring devices • Checking and conforming the installation based on job requirement",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 42 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Install lighting fixture/ switches 3.1 Safety procedures are followed 3.2 Correct procedures for installation of lighting fixtures/switches are performed in line with job requirements 3.3 Schedule of work is followed to ensure work is completed in an agreed time, to a quality standard and with a minimum waste 3.4 Further instructions are sought from a supervisor if unplanned events or conditions occur 3.5 On-going checks of quality of work are undertaken in accordance with instructions and requirements  Types of lighting fixtures and installation technique  Installation procedures of various lighting fixtures/switches  Ratings of lighting fixture  DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry  PEC requirement regarding installation of various lighting fixtures/switches  Applying methods and techniques in various type of lighting fixtures/switches  Checking and conforming the installation based on job requirement  Installing lighting fixture and switches 4. Notify completion of work 4.1 Final checks are made to ensure that work conforms with instructions and to requirements 4.2 Supervisor is notified upon completion of work 4.3 Tools, equipment and any surplus resources and materials are, where appropriate, cleaned, checked and returned to storage in accordance with established procedures 4.4 Work area is cleaned and made safe  Processes, Operations, Systems o Maintenance of tools o Storage of tools  Checked and conformed the installation based on job requirement  Good housekeeping  Performing commissioning activity",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 43 RANGE OF VARIABLES VARIABLE RANGE 1. Wiring devices and consumable items 1.1 Wiring devices 1.1.1 Floor outlet 1.1.2 Ground fault current interrupting device 1.1.3 Grounding type convenience outlet 1.1.4 Light switches 1.2 Consumable items 1.2.1 Wire nut 1.2.2 Electrical tape 1.2.3 rubber tape 2. Tools and equipment 2.1 Pliers 2.2 Screwdrivers 2.3 Wire splicers 2.4 Electrician knives 3. Personal protective equipment (PPE) May include but not limited to: 3.1 Working gloves 3.2 Safety shoes 3.3 Hard hat 4. Safety procedures Includes Safety procedures in: 4.1 Philippine Electrical Code 4.2 Safety standards 5. Installation of wiring devices 5.1 Horizontally and vertically aligned 5.2 No gap between plate cover and wall 5.3 Wire cut to requirement 5.4 All bolts tightened for rigid mounting 6 Installation of lighting fixtures/switches 6.1 Lamps - Horizontally aligned against wall - No gap between ceiling and lighting fixture base - Wiring at junction box cut to requirement as required - Lamps securely mounted 6.2 Spotlights - Horizontally aligned against wall - No gap between ceiling and lighting fixture base - Wiring at junction box cut to requirement as required - Floodlights/spotlights securely mounted 6.3 Track Lights - Wiring at junction box cut to requirement as required - Track light mounted securely 6.4 Perimeter Lighting - Perimeter lighting installed as per plan/shop - Foundation constructed as per plan - Fixture wired and tested - Fixture mounted to pole",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 44 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Correctly interpreted work instructions 1.1 Selected appropriate tools, equipment and materials for installing wiring devices and lighting fixtures/switches and auxiliary outlet 1.3 Selected and used correct PPE 1.2 Demonstrated correct procedures for installation of wiring devices and lighting fixtures/switches 1.5 Followed safety procedures/protocol 1.6 Cleaned worksite, tools and equipment 1.7 Stored surplus materials 2. Resource Implications The following resources MUST be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate for installation of wiring devices and lighting fixtures/switches 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3. Methods of Assessment Competency must be assessed through: 3.1 Direct observation of application of tasks 3.2 Questions related to underpinning knowledge 3.3 Demonstration/Practical activity 3.4 Written test 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in a simulated workplace setting 4.2 Assessment shall be observed while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Electrical Installation and Maintenance NC III",
        "core_competencies": [
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 40 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM ROUGHING-IN AND WIRING ACTIVITIES FOR THREE-PHASE DISTRIBUTION SYSTEM FOR POWER, LIGHTING AND MOTOR CONTROL PANEL UNIT CODE: ELC741304 UNIT DESCRIPTOR: This unit of Core Electrical Competencies covers the knowledge and attitudes on installing cable tray, power panel, lighting panel and motor control center (MCC), fittings, under the required performance standard. This also includes wiring and completion works. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variable REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Prepare for rough-in and wiring works 1.1 Technical drawings and plans are interpreted to determine job requirements 1.2 Correct type and quantity of cable trays, power and lighting panels and MCC are identified and selected in line with job requirements 1.3 Tools and equipment are selected in line with job requirements 1.4 Correct PPE are identified and selected in line with safety requirements  Types of wiring diagram based on ANSI or IEC Standard.  Types of enclosures, proofing and mounting configuration  Types and uses of tools, materials and equipment for roughing-in and wiring.  Proper use of safety harness.  Interpreting plan and details drawing.  Identifying the required proofing of the panel and enclosure.  Identifying the functional and defective tools, materials and equipment. 2. Install cable tray and panel 2.1 Safety procedures are followed 2.2 Correct procedures for installation of cable tray and panel are performed in line with job requirements 2.3 Schedule of work is monitored to ensure work is completed in an agreed time, to a quality standard and with a minimum of waste 2.4 Unplanned events or conditions occurred are responded to accordingly 2.5 Checks of quality of work are undertaken in accordance with instructions and requirements  Interpretation of electrical/mechanical drawings  Cable trays o Uses and specifications  Panel board o Uses and specifications o Circuit breaker o Types of mounting of protective device o Circuit home run requirements  Proper procedure in installation of cable tray, fittings and panels.  Installation techniques for maintenance accessibility  Blue Print reading skills required to interpret work instructions.  Performing installation economically and based on job specifications",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 41 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variable REQUIRED KNOWLEDGE REQUIRED SKILLS  Proper use of safety harness.  PEC requirements in cable tray and panel installation 3. Perform wiring works 3.1 Safety procedures are followed based on safety regulations PPE are identified and selected in line with safety requirements 3.2 Tools, equipment, pulling compound and safety requirements are identified and obtained for the layout and installation. 3.3 Pulling materials are properly installed and tensioned to required specifications 3.4 Cable is secured permanently to support structure in accordance with standard installation procedures 3.5 Bending radius and loops tolerance is observed for cable materials at all times 3.6 Schedule of wire cutting lists is followed based on estimates, quantity and sizes to avoid wastage. 3.7 Further instructions are sought if unplanned events or conditions occur 3.8 Checking of quality of work is done in accordance with instructions and requirements.  Wiring works provisions in DOLE Department Order No. 13 s. 1998 - Guidelines Governing Occupational Safety and Health in the Construction Industry  Wiring procedures such as cable lay-out, pulling splicing and wire termination.  Usage of different type of wires and cables and its applications  Markings of circuit homeruns  Application of pulling compound.  Bundling of wire size as per job requirement.  PEC requirements in wiring works  Interpreting plans and drawings  Handling of materials, tools and equipment  Applying methods and techniques in various type of wiring wires and cables  Splicing and terminating wires 4. Complete work activity 4.1 Final checks are made to ensure that work conforms with instructions and to requirements 4.2 Tools, equipment and any surplus resources and materials are checked/monitored in accordance with established procedures 4.3 Work area is checked as to cleanliness and safety. 4.4 Waste materials and hazardous substances are disposal of in accordance with environmental rules and procedures.  Processes, Operations, Systems o Maintenance of tools o Storage of tools  Procedures in checking and conforming the installation based on job requirement  Proper disposal of waste materials and hazardous substances  Principles of good housekeeping  Performing commissioning activities  Performing good housekeeping",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08   TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 42 RANGE OF VARIABLES VARIABLE RANGE 1. Tools and equipment Including but not limited to: 2.1 Pliers 2.7. Rivet 2.2 Screwdrivers 2.8 Mallet 2.3 Wrenches 2.4 Wire splicers 2.5 Knives 2.6 Face shield 2. Personal protective equipment (PPE) Including but not limited to: 3.1 Working gloves 3.2 Safety shoes 3.3 Hard hat 3. Safety procedures Includes safety procedures in: 4.1 Philippine Electrical Code 4.2 Industrial safety standards 4.3 Electrical safety standards 4. Correct procedures for Installation of bus ducts and cable tray 5.1 Bus ducts - Joints between sections and fittings are accessible for maintenance purposes - Bus ducts shall be securely supported - Vertically and horizontally aligned - Dead end of busway shall be closed 5.2 Cable tray - Properly supported, aligned and spaced - Measurements referred to center of insert holes 5. Installation procedures 5.1 Horizontally and vertically aligned 5.2 No gap between plate cover and wall 5.3 Wire cut to requirement 5.4 All bolts tightened for rigid mounting",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 43 EVIDENCE GUIDE 1. Critical aspects of competency Assessment required evidence that the candidate: 1.1 Interpreted technical drawings and plans to determine job requirements 1.2 Selected appropriate tools, equipment and materials for performing rough-in and wiring activities 1.3 Selected and used correct personnel protective equipment 1.4 Demonstrated correct procedures for performing rough-in activities such as installing bus ducts, cable tray and panel 1.5 Followed safety procedures 1.6 Performed wiring works 1.7 Made final checks to ensure work completion and conforms with the working plan 2. Resource Implications The following resources should be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate to building wiring electrical installation 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3. Methods of Assessment Competency in this unit must be assessed: 3.1 Direct observation/Demonstration of application of tasks. 3.2 Questions related to underpinning knowledge 3.3 Written Test 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in a simulated workplace setting 4.2 Assessment shall be observed while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 44 UNIT OF COMPETENCY: PERFORM INSTALLATION OF DATA MEASUREMENT AND CONTROL SYSTEM ON ELECTRICAL AND AUXILIARY EQUIPMENT UNIT CODE : ELC741305 UNIT DESCRIPTOR : This unit of Core Electrical Competency covers the knowledge, skills and attitudes in installing wiring devices for power supply of data measurement and control system on electrical and auxiliary equipment such as UPS, drytype, transformer, capacitor bank AVR and rectifier based on required performance standard. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variable REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Plan and prepare for installation work 1.1 Instructions for the preparation of work activity are communicated and confirmed to ensure clear understanding 1.2 Tools, equipment and personnel protective equipment needed to electrical system and auxiliary equipment are identified and checked to ensure usability and safety in accordance with established procedures 1.3 Materials needed to do the work are obtained and estimated in accordance with established procedures and plan  Types and specification of wiring devices for data measurement and control system.  Functions and uses of power supply on data measurement system and auxiliary equipment.  Identification of tools and materials for installation of data measurement and control system on electrical and auxiliary equipment  Interpreting plans and details drawing.  Handling of materials, tools and equipment  Checking and quantifying the item needed, in the job requirement. 2. Install electrical system and auxiliary equipment 2.1 Safety procedures are followed in line with job requirements 2.2 Correct procedures for installation of electrical system and auxiliary equipment are performed in line with job requirements 2.3 Schedule of work is followed to ensure work is completed in an agreed time, to a quality standard and with a minimum of waste 2.4 Unplanned events or conditions occurred are responded to accordingly 2.5 Ongoing checks of quality of work are undertaken in accordance with instructions and requirements 2.6 Conductors/wires are terminated/spliced in accordance with electrical standards  Procedures on installation of electrical system and auxiliary equipment.  Proper used of power tools and equipment in an installation.  Splicing, dressing and harnessing of wires.  Proper termination and mounting of devices.  Proper use of safety harness  Types and uses of: o UPS o Drytype Transformer o Capacitor bank o AVR  Installing AVR and UPS  Performing splicing, dressing and harnessing of wires.  Mounting of devices.  Performing the installation economically.  Applying active and non-active test to ensure its functionality.",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 45 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variable REQUIRED KNOWLEDGE REQUIRED SKILLS o Rectifier o other metering/ central aux. equipment  PEC requirements in installation of electrical system and auxiliary equipment 3. Notify completion of work 3.1 Final checks are made to ensure that work conforms with instructions and to requirements 3.2 Completion report is prepared and submitted to appropriate officer 3.3 Tools, equipment and any surplus resources and materials are checked and monitored in accordance with established procedures 3.4 Work area is monitored as to cleanliness and safety  Procedures in checking and conforming the installation based on job requirement  Procedures in report preparation and submission  Principles of good housekeeping  Performing commissioning activities  Performing good housekeeping",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08   TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 46 RANGE OF VARIABLES VARIABLE RANGE 1. Tools and equipment 1.1 Electrical power tools 1.2 Hand tools 1.3 Multi-testers, mega-ohmmeter, clamp-on meter 2. Personal protective equipment (PPE) Includes but is not limited to: 2.1 Working gloves 2.2 Safety shoes 2.3 Hard hat 2.4 Goggles/face shield 3. Electrical system and auxiliary equipment 3.1 UPS 3.2 Drytype 3.3 Transformer 3.4 Capacitor bank 3.5 AVR 3.6 Rectifier/Frequency converter 3.7 Fire alarm system 3.8 Intercom 3.9 Digital watt meter 4. Safety procedures 4.1 Philippine Electrical Code (PEC) 4.2 Industrial safety 4.3 Electrical safety 5. Installation of electrical system and auxiliary equipment 5.1 Installed and connected as per plan 5.2 Magnetic switches installed 5.3 Conducted preliminary testing prior to commissioning",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 47 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Correctly followed work instructions 1.2 Identified and checked appropriate tools, equipment and materials for installing electrical system and auxiliary equipment 1.3 Selected and used correct personal protective equipment 1.4 Performed correct procedures for installation of electrical system and auxiliary equipment 1.5 Terminated/Spliced conductors/wires in accordance with the existing electrical standards 1.6 Made final checks to ensure work conforms with the plan 1.7 Followed safety procedures 2. Resource Implications The following resources should be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate to installation of electrical and auxiliary equipment 2.3 Materials relevant to the activity 2.4 Wiring diagrams, layout/shop drawings and specifications relevant to the task 3. Methods of Assessment Competency in this unit must be assessed: 3.1 Direct observation/Demonstration of application of tasks. 3.2 Questions related to underpinning knowledge 3.3 Written Test 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in a simulated workplace setting 4.2 Assessment shall be observed while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 48 UNIT OF COMPETENCY: INSTALL, ASSEMBLE, TEST AND MAINTAIN MOTOR CONTROL SYSTEM UNIT CODE: ELC741306 UNIT DESCRIPTOR: This unit of Core Electrical Competency covers the knowledge, skills and attitudes in installing, assembling, testing and maintaining motor control system. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variable REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Check/Review type and purpose of motor control system. 1.1. Wiring diagrams and layout/shop drawings are obtained according to job requirements 1.2. Drawings are read and interpreted in accordance with job requirements 1.3. Correct rating, quantity, sizes and type of motor control components & wiring devices and other materials are identified in line with job requirements 1.4. Correct size and degree of protection of enclosures are verified in line with job requirements 1.5. Tools, equipment and testing instruments are properly selected in line with job requirements 1.6. Correct PPE are identified and selected in line with safety requirements  Interpretation of electrical drawing and wiring diagram.  Function of every devices used in the line/job requirements  Motor specification for the selection of control devices.  NEMA Standard in mounting of MCC.  Electrical control components and devices  Safe working habits/Safety procedures  Interpreting electrical drawing and wiring diagram  Checking and quantifying items needed in the job requirement  Checking the required rating based on its specification in accordance with standard. 2. Install and assemble motor control system 2.1 Safety procedures are followed according to enterprise or based on PEC standard and requirements. 2.2 Electrical components and wiring devices are laid-out, mounted or installed according to drawings, plans, specifications and PEC standards 2.3 Electrical motor control components are wired correctly in accordance with wiring diagrams and PEC standards 2.4 Preliminary checks/tests are conducted in line/job requirements. 2.5 Work schedule is followed to ensure job is completed on time in accordance to a quality standard and minimum wastage.  Layout and dimensions of electrical drawing or wiring diagram.  Types and operation of motor control system.  Types and uses of termination either point to point termination or terminal strip.  Correct procedures in assembling motor control system  Proper procedure mounting and installation of panels/MCC.  Proper terminal connection of motor leads outs.  Interpreting the electrical wiring diagram of motor control system.  Wiring-up the required electrical control based on the standard.  Connecting and Terminating of motor terminal/leads out and the control devices.  Checking for continuity test or ohmmeter test of motor terminal",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 49 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variable REQUIRED KNOWLEDGE REQUIRED SKILLS  PEC standards - Article 4.30  Performing the installation economically. 3. Notify completion of work 3.1 Immediate superior is notified upon completion of work. 3.2 Performance tests are made to ensure that work conforms to instructions and job requirements. 3.3 Tools, equipment and any surplus materials are cleaned, checked and returned to storage in accordance with established procedures. 3.4 Waste materials and hazardous substances are disposed of in accordance with environmental rules and regulations. 3.5 Work area is cleaned up and made safe in accordance with OSHA requirements  Checked and conformed the installation based on job requirement  Principles of 5S  Proper disposal of waste materials and hazardous substances  Good housekeeping  Performing commissioning activities  Storing excess materials  Checking quality of work  Communicating skills (both written & oral) 4. Maintain electrical motor control system. 4.1 Safety policies and procedures are followed in accordance with OSH and enterprise procedures. 4.2 Materials, tools, equipment, testing devices and PPE needed are prepared for the maintenance work requirements. 4.3 Potential hazards are identified for prevention and control measures are selected in accordance with the work plan and site procedures 4.4 Routine/visual/sensory inspection is regularly conducted in line with normal operation. 4.5 Maintenance work schedule is prepared in accordance with machine/equipment operating time/condition 4.6 Work instructions are prepared according to machine’s manual and established enterprise procedures 4.7 Concerned department/personnel are informed on the schedule of work according to standard operating procedure. 4.8 Availability of maintenance records are prepared in accordance with established procedure, or based on enterprise Quality Management System (QMS).  Safety Practices in the use of PPE, handling of tools, instrument and equipment.  Types and uses of lubricants and cleaning materials  Preventive Maintenance Methods and Techniques and Procedures.  Types of potential hazards  Maintenance and troubleshooting procedures  Good housekeeping of materials, tools and equipment  Selecting prevention and/or control measures  Handling of tools, instrument and equipment.  Performing basic troubleshooting skills  Identifying failures or defects  Implementing corrective and preventive actions based on root cause of trouble  Application of maintenance procedures",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08   TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 50 RANGE OF VARIABLES VARIABLE RANGE 1. Wiring diagrams 1.1 Power circuit 1.2 Control circuit 2. Motor control components & wiring devices May include but are not limited to: 2.1 Circuit breakers/Fuses 2.2 Magnetic Contactors 2.3 Overload heater 2.4 Power Cabinet or MCC 2.5 Power and Timers Relays 2.6 Terminal Blocks/Lugs 2.7 Pilot lamps and Buzzer 2.8 Actuators 2.9 Push buttons 2.10 Selector Switches 2.11 Cable duct 2.12 Din rail 2.13 Wire Strap 2.14 Wire Markers 2.15 Cable Tie 2.16 Tie Mount 2.17 Cable Glands/Grommet 2.18 Automotive wires/ Conductors 2.19 Insulators 3. Degree of Protection 3.1 Nema Standards - Nema 1 - Nema 2 - Nema 3/3R - Nema 4/4x - Nema 6 - Nema 11 - Nema 12 3.2 IEC Standards - International Protection (IP) 3.3 Bureau of Product Standards (BPS) 4. Tools, equipment & testing instruments May include but are not limited to: 4.1 Tools - Pliers - Screw drivers - Wrenches - Wire splicers/strippers - Electrician knives - Electric Hand drill - Hand or electric taping/threading - Hack saw - File - Manual/Hydraulic puncher - Measuring tools (e.g. Push-pull meter)",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 51 VARIABLE RANGE - Crimping tools - Soldering tools - Manual/Hydraulic pipe bender - Manual/Electrical Pipe Threader/Reamer - High-speed cutter 4.2 Testing Instruments - Multi-tester - Clamp ammeter - Insulation resistance tester - Ground resistance tester - Earth leakage tester - Harmonic meter - Phase Sequence Tester 4.3 Three-Phase Motor - SCRIM - WRIM - Synchronous Motor 4.4 Single Phase Motor 5. Personal protective equipment (PPE) May include but are not limited to: 5.1 Proper working clothes 5.2 Working gloves 5.3 Safety shoes 5.4 Gas/Dust mask 5.5 Hard hat 5.6 Safety goggles 6. Specifications 6.1 Brand/Make - Classification/Type 6.2 Rating - Voltage - Current - Power - Frequency - Temperature Rise - Service factor - Degree of protection - Utilization category - Harmonics 6.3 Phase 6.4 Range (Tools must be specific) 6.5 Needed accessories 7. PEC standard and requirements 7.1 Splicing and joining of electrical conductor 7.2 Soldering electrical conductors 7.3 Solderless electrical connectors 7.4 Creepage distances 7.5 Clearances",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 52 VARIABLE RANGE 8. Preliminary Check/Tests May include but are not limited to: 8.1 Mechanical - Board/Panel properly leveled - Doors can be opened/closed with ease. Paint not easily scratched/removed - Tightness of bolts and nuts - Type of protection - Cleanliness - Cable trays 8.2 Electrical - Conductor size or Cross-section - Conductor Color Coding - Cables laid to avoid risk of short circuit - Grounding busbar conductor - Voltage Clearances/Creepage Distances - Control Voltage - High Voltage Test - Insulation Test - Continuity Test/Contact Resistance Test - Correct use of wire markers & terminals 9. Performance Tests 9.1 Simulation Test/No Load Test 9.2 Phase sequence 9.3 Actual Operation 9.4 Temperature rise 9.5 Insulation Resistance Test 10. Materials May include but not limited to: 10.1 Contact cleaner 10.2 Insulating varnish/materials 10.3 Carbon brushes 10.4 Sand paper 10.5 Waste rugs 10.6 Electrical tapes 10.7 Warning tags 10.8 Signages 10.9 Lockout/tagout 10.10 Lubricants 10.11 Motor cleaner 10.12 Insulating oil 10.13 Coolant",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08   TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 53 VARIABLE RANGE 11. Tools, equipment and testing devices Including but not limited to: 11.1 Electrician’s hand tools - Pliers - Screwdrivers - Wrenches - Wire splicers - Knives - Bolt/Cable cutter - Knockout puncher - Torque wrench 11.2 Testing instruments/devices - Multi-tester (VOM) - Insulation resistance tester (Megger) - High potential tester - Low resistance tester - Phase sequence meter - Ammeter - Torque meter 11.3 Equipment - Labeling machine - Vacuum cleaner - Air blower - Dryer - Welding machine - Pressure washer - Vacuum pump 12. Personal protective equipment (PPE) Including but not limited to: 12.1 Working gloves 12.2 Safety shoes 12.3 Hard hat 12.4 Face shield 12.5 Insulating mat 12.6 Lockout tags 12.7 Safety goggles 12.8 Safety belt 12.1 Safety ladder 13. Potential hazards Including but not limited to: 13.1 Live wires 13.2 Oil spill 13.3 Chemical hazards 13.4 Flammable materials 13.5 Sources of energy 13.6 Moving machine parts 13.7 Sharp/pointed objects 13.8 Noise hazards 13.9 Confined space",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08   TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 54 VARIABLE RANGE 14. Maintenance records May include but are not limited to: 14.1 Electrical plans 14.2 Equipment electrical diagrams 14.3 Historical records - Job orders - Commissioning test record - Preventive Maintenance schedules - Corrective Maintenance records - Manufacturer’s maintenance guides - Equipment breakdown records - Periodic monitoring data - Service reports 14.4 Log book 15. Quality Management System 15.1 ISO 9001 15.2 QS 9000 15.3 TS 16949 15.4 ISO 14000 15.5 ISO14001",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 55 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Checked/Reviewed type and purpose of motor control system 1.2 Installed and assembled motor control system. 1.3 Notified completion of work 1.4 Maintained electrical motor control system 2. Resource Implications The following resources should be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate to assembly of electrical control system 2.3 Materials relevant to the activity 2.4 Wiring diagrams, layout/shop drawings and specifications relevant to the task 3. Methods of Assessment Competency in this unit must be assessed through: 3.1 Direct observation/demonstration of application of tasks 3.2 Questions or interview related to underpinning knowledge 3.3 Written Test (about symbols) 4. Context for Assessment 4.1 Competency may be assessed in the workplace – to observe/check workmanship, correct function of work, length of time in doing the work 4.2 Assessment shall be observed while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 58
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Electronics Products Assembly and Servicing NC II",
        "core_competencies": [
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 38 CORE COMPETENCIES UNIT OF COMPETENCY: ASSEMBLE ELECTRONIC PRODUCTS UNIT CODE: ELC724 335 DESCRIPTON: This unit covers the knowledge, skills and attitudes required to assemble electronic products and systems for consumer/industrial uses/applications. It consist of competencies in identifying and preparing electronic components and circuits, preparing/making printed circuit board (PCB) modules, mounting and soldering of components, assembling electronic products and performing mechanical and electrical/electronic tests. ELEMENTS PERFORMANCE CRITERIA (Italicized bold terms are elaborated in the range of variables) 1. Prepare to assemble electronic products 1.1 Assembly workplace is prepared in accordance with OH&S policies and procedures 1.2 Established risk control measures for work preparation are followed. 1.3 Work instructions are obtained and clarified based on job order or client requirements 1.4 Responsible person is consulted for effective and proper work coordination 1.5 Required materials, tools and equipment are prepared and checked in accordance with established procedures 1.6 Parts and components needed to complete the work are identified, prepared and obtained according to requirements 2. Prepare/Make PCB modules 2.1 PCB layout is verified for conformity with the schematic diagram in accordance with the layout rules 2.2 PCB layout is transferred to copper-cladded board following acceptable methods and standards 2.3 Visual inspection is performed based on standards procedures. 2.4 Thru-hole is drilled based on standards procedures 2.5 PCB is cleaned based on standards procedures 2.6 Functionality of PCB is tested and visual inspection is performed based on standards procedures 3. Mount and solder electronic components 3.1 Knowledge of lead and lead-free soldering characteristics and requirements are applied to mounting and soldering process in accordance with OH&S standards 3.2 Components are mounted and soldered in accordance with soldering principles. 3.3 Soldering/Desoldering techniques and procedures are applied in accordance with established standards and requirements. 3.4 Soldered products are checked and complied with international standards and task specifications 4. Perform electronic products assembly 4.1 Work instructions is followed based on job order or client requirements 4.2 Assembly procedures are performed in accordance with OH&S policies and work instructions 4.3 Modules and accessories are connected/integrated into the final product based on the client specifications",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 39 ELEMENTS PERFORMANCE CRITERIA (Italicized bold terms are elaborated in the range of variables) 4.4 Excess components and materials are disposed of based on WEEE directives and 3Rs waste management program. 5. Test and inspect assembled electronic products 5.1 Finished products are subjected to final visual/sensory inspection and testing in accordance with quality standards, procedures and requirements 5.2 Mechanical and electrical/electronic testing is performed in accordance with quality standards, procedures and requirements 5.3 Work completion is documented and responsible person is informed in accordance with established procedures 5.4 Housekeeping procedures are observed in accordance with 5S discipline and established procedures",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 40 RANGE OF VARIABLES VARIABLE RANGE 1. OH&S policies and procedures Arrangements of enterprise to meet their legal and ethical obligations in ensuring the workplace is safe and without risk to health. This may include: 1.1 Hazard and risk assessment mechanisms 1.2 Implementation of safety regulations 1.3 Safety training 1.4 Safety systems incorporating: 1.4.1 Work clearance procedures 1.4.2 Isolation procedures 1.4.3 Gas and vapor 1.4.4 Monitoring/testing procedures 1.4.5 Use of protective equipment and clothing 1.5 Use of codes of practice 1.5.1 Philippine Electronics Code 2. Responsible person 2.1 Immediate supervisor 2.2 Manager 3. Materials, tools and equipment May include: 3.1 Variable power supply 3.2 Variable transformer 3.3 Soldering iron 3.4 Hot air soldering station 3.5 Table top reflow oven 3.6 Desoldering tools 3.7 Screwdriver (assorted) 3.8 Wrenches (assorted) 3.9 Allen wrench/key 3.10 Function /Signal generator 3.11 Multi - testers (analog/digital) 3.12 Utility knife/stripper 3.13 Pliers (assorted) 3.14 ESD - free work bench with mirror 3.15 Oscilloscope, digital 3.16 High - grade magnifying glass with lamp 3.17 Flashlight/headlamp 3.18 Cleaning brush 3.19 Soldering wire 3.20 SMD soldering paste 3.21 Stranded/solid/hook - up wires 3.22 Assorted electronic components 3.23 Assorted electronic sensors 4. Layout rules 4.1 EMI 4.2 EMC 5. Acceptable methods 5.1 silk screen 5.2 photo transfer 6. Mounting of components 6.1 Surface mount 6.2 Thru - hole mount 6.3 Socket mount 7. Soldering principles The four key principles to producing a good joint are: 7.1 Ensure the joint surfaces are clean and free from grease. 7.2 Ensure the temperature of the solder when making the joint is correct. 7.3 Ensure the heat is applied to the joint for the correct amount of time 7.4 Ensure the correct amount of solder is used. 8. Soldering / Desoldering procedures 8.1 Hot iron soldering procedures 8.2 Hot air soldering procedures 9. Assembly procedures 9.1 Prepare supplies, materials and equipment 9.2 Familiarize with the diagram and the product 9.3 Perform assembly 9.4 Check the assembled product 10. Testing 10.1 Aging test 10.2 Substitution test 10.3 Mechanical testing",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 41 EVIDENCE GUIDE 1 Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Prepared electronics components for assembly 1.2 Prepared/Made printed circuit board modules 1.3 Mounted and soldered electronic components 1.4 Assembled electronic components 1.5 Tested and inspected assembled electronic products 1.6 Applied safety rules and procedures 2 Required knowledge and attitude 2.1 Mensuration/Mathematics 2.1.1 Conversion of Units 2.1.2 Applied Mathematics 2.2 Environmental Safety 2.2.1 Work Safety requirements and economy of materials with durability 2.2.2 Knowledge in 5S application and observation of required timeframe 2.2.3 Knowledge of proper handling and disposal of chemicals 2.2.4 Safety handling of hand tools 2.2.5 Practicing 3Rs – reduce, re-use, recycle/recover 2.2.6 Managing waste from electrical and electronic equipment (WEEE) 2.3 Materials, tools and equipment uses and specifications 2.3.1 Identification of hand and power tools 2.3.2 Proper care and use of tools 2.4 Theories and Principles 2.4.1 PCB problems and solutions 2.4.2 Surface mount components and devices 2.4.3 Through-hole mount components and devices 2.4.4 PCB characteristics 2.4.5 Methods of soldering 2.4.6 Design compliance with EMI / EMC 2.4.7 Component layout and grounding 2.4.8 Thermal and vibration theories 2.4.9 Environmental control 2.4.10 Manufacturing - PCB Manufacturing Information - PCB Layout and Artwork 2.4.11 Fabrication - Blanking, Cutting, Punching, Drilling - Laminating Techniques - Plating, Etching, Surface Finishing - Coatings 2.4.12 Assembly - Proper care and use of tools - Component - Soldering Technology i. Reflow soldering ii. Wave soldering iii. Hand soldering iv. RoHS and lead-free soldering - Nonsolder Connections (terminal block",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II\nPage 42\n- Cleaning\n- Repair and Rework\n- Safety\n- ESD protection\n2.4.13 Testing of electronic products\n2.5 3Rs waste management programs\n2.6 Rules and conventions\n2.6.1 Philippine Electronics Code\n2.6.2 RoHS/WEEE Directives\n2.6.3 RA 9292 – ECE Law\n3 Required skills\n3.1 assembling electronic products\n3.2 Using and maintaining test instruments, tools, & equipment\n3.3 splicing/joining wires\n3.4 PCB preparation skills\n3.5 Proper soldering/desoldering skills\n3.6 Component testing\n3.7 mounting various types of electronic components\n3.8 Work safety practices and time management\n3.9 interpreting schematic/block diagrams\n4 Method of assessment\nCompetency may be assessed through two or more of the following methods:\n4.1 Practical Demonstration w/ oral questioning\n4.2 Interview\n4.3 Portfolio\n5 Resource implications\nThe following resources must be provided:\n5.1 Tools and equipment (see range of variables)\n5.2 Working area/bench\n5.3 PC with computer-aided design (CAD) software and printer PCBs\n5.4 electronic components/supplies\n5.5 diagrams and other references\n5.6 Assessment rating sheet\n5.7 Reporting forms\n6 Context of assessment\n6.1 Assessment maybe conducted in the workplace or in a simulated workplace setting",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 43 UNIT OF COMPETENCY: SERVICE CONSUMER ELECTRONIC PRODUCTS AND SYSTEMS UNIT CODE: ELC724 336 DESCRIPTION: This unit covers the knowledge, skills and attitudes required to install and service consumer electronic products and systems. It includes competencies in installing, maintenance and repairing audio-video products/systems and domestic electronic appliances and home security system. ELEMENT PERFORMANCE CRITERIA (Italicized bold terms are elaborated in the range of variables) 1. Prepare unit, tools and workplace for installation and service 1.1 Complete check-up of consumer electronic products and systems is conducted and defects are identified, verified and documented against customer description. 1.2 Manuals and service information required for installation are acquired as per standard procedure. 1.3 Repair/maintenance history is verified in line with the company procedures. 1.4 Workplace is set/prepared for installation job in line with the client’s requirements. 1.5 Necessary tools, test instruments and personal protective equipment are prepared in line with job requirements 2. Install consumer electronic products and systems 2.1 Materials necessary to complete the work are obtained in accordance with job requirements. 2.2 Consumer electronic products and systems are installed in accordance with manufacturer’s instructions, requirements, and without damage to the surrounding place or environment 2.3 Devices are tested in accordance with standard procedures. 2.4 Final inspections are undertaken to ensure that the installed devices conform to technical requirements. 2.5 Unplanned events or conditions are responded to in accordance with established procedures 2.6 Work site is cleaned and cleared of all debris and left safe in accordance with the company requirements 2.7 Report on installation and testing of equipment is prepared according to company’s procedures/policies. 3. Diagnose faults and defects of consumer electronic products and systems 3.1 Systematic pre-testing procedure is observed in accordance with manufacturer’s instructions. 3.2 System defects/Fault symptoms are identified using appropriate tools and equipment and troubleshooting techniques and in accordance with safety procedures 3.3 Test instruments required for the job are used in accordance with user manuals. 3.4 Circuits are checked and isolated using specified testing procedures 3.5 Identified defects and faults are explained to the responsible person in accordance with enterprise or company policy and procedures 3.6 Control settings/adjustments are checked in conformity with service-manual specifications. 3.7 Results of diagnosis and testing are documented accurately and completely within the specified time. 3.8 Customers are advised/informed regarding the status and serviceability of the unit according to procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 44 ELEMENT PERFORMANCE CRITERIA (Italicized bold terms are elaborated in the range of variables) 4. Maintain/Repair consumer electronic products 4.1 Personal protective equipment is used in accordance with Occupational Health and Safety practices. 4.2 Electro-static discharge (ESD) protection procedure is followed in accordance with current industry standards. 4.3 Defective parts/components are replaced with identical or recommended appropriate equivalent ratings 4.4 Repaired or replaced parts/components are soldered/mounted in accordance with the current industry standards. 4.5 Control settings/adjustments are performed in conformity with service-manual specifications 4.6 Repair activity is performed within the required timeframe 4.7 Care and extreme precaution in handling the unit/product is observed as per procedures 4.8 Cleaning of unit is performed in accordance with standard procedures 4.9 Excess components and materials are disposed of based on WEEE directives and 3Rs waste management program 5. Re-assemble and test repaired consumer electronic product 5.1 Repaired units are reassembled according to procedures 5.2 Reassembled units are subjected to final testing and cleaning in conformity with manufacturer’s specifications 5.3 Service completion procedures and documentations are complied with based on manual. 5.4 Waste materials are disposed of in accordance with environmental requirements.",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 45 RANGE OF VARIABLES VARIABLE RANGE 1. Consumer electronic products and systems 1. Audio-Video products and systems include -- 1.1 Radio receivers 1.2 Audio recorders 1.3 Videoke systems 1.4 Electronic musical instruments/keyboards 1.5 DVD/VCD Player 1.6 Professional audio/Public-address (PA) systems 1.7 Television 1.7.1 Home 1.7.2 Portable 1.8 Home theater system 1.9 PC Monitors 2. Domestic Electronic Appliances include -- 2.1 Electronic-controlled Washing Machines 2.2 Home Food Processing equipment 2.3 Microwave Oven 2.4 Electronic Clock 2.5 Rechargeable Light 2.6 Electronic-controlled Light 2.7 Home security equipment 2.8 Induction stove 2.9 Solar-powered management system 2. Service manuals 2.1. Service manual/schematic diagram/parts list 2.2. Operating instructions/User’s/Owner’s manual 3. Service Information 3.1. Job Report Sheets 3.2. Job Order 3.3. Bill of materials 3.4. Customer index 3.5. Service flowchart 3.6. Stock and inventory record 3.7. Requisition slips (for acquisition of parts) 3.8. Supplier Index 4. Tools, Materials and Test Instruments May include: 4.1 Variable power supply 4.2 Variable transformer 4.3 Soldering iron 4.4 Hot air soldering station 4.5 Table top reflow oven 4.6 Desoldering tools 4.7 Screwdriver (assorted) 4.8 Wrenches (assorted) 4.9 Allen wrench/key 4.10 Function generator 4.11 Multi-testers (analog/digital) 4.12 Utility knife/stripper 4.13 Pliers (assorted) 4.14 ESD-free work bench with mirror 4.15 Test jigs 4.16 Oscilloscope, digital 4.17 High-grade magnifying glass with lamp 4.18 Flashlight/headlamp 4.19 Cleaning brush 4.20 Soldering wire 4.21 SMD soldering paste 4.22 Stranded/solid/hook-up wires 4.23 Assorted electronic components",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 46 VARIABLE RANGE 5. Pre-testing procedures 5.1. Visual inspection of the unit with power off 5.2. Interview of customer re history of unit 5.3. Operate the unit according to manual to confirm defects 6. Troubleshooting techniques May include: 6.1 sensory methods Visual checks Listening for telltale sounds Lookout for unusual smells Touching or feeling 6.2 Component substitution 6.3 Signal injection and tracing 6.4 Voltage and current measurement 6.5 Continuity/resistance testing 6.6 Waveform analysis 6.7 Display analysis (for video displays) 6.8 Circuit analysis 7. Responsible persons 7.1. Immediate supervisor 7.2. Service supervisor/manager 8. Environmental Requirements 8.1. Proper disposal of chemicals and components shall be based on existing requirements of the law and chemical waste management 8.2. Non-biodegradable parts or materials shall be packed and labeled properly for disposal. 8.3. WEEE requirements",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 47 EVIDENCE GUIDE 1 Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Prepared the unit and required materials, tools equipment and workplace properly for installation and service. 1.2 Installed consumer electronic products and systems 1.3 Diagnosed faults and defects 1.4 Maintained/Repaired consumer electronic products 1.5 Re-assembled and tested repaired consumer electronic product 1.6 Applied safety rules and procedures 2 Required knowledge and attitude 2.1 Mensuration/Mathematics 2.1.1 Conversion of units 2.1.2 Applied mathematics 2.2 Drawing and Schematic Diagram 2.2.1 Reading and interpreting orthographic projections and isometric views 2.2.2 Reading and interpreting electronic schematic symbols and diagram 2.3 Environmental Safety 2.3.1 Work Safety requirements and economy of materials with durability 2.3.2 Knowledge in 5S application and observation of required procedure 2.3.3 Practicing 3Rs – reduce, re-use, recycle/recover 2.3.4 Managing waste from electrical and electronic equipment (WEEE) 2.4 Materials, tools/instruments & equipment uses and specifications 2.4.1 Identification of hand and power tools 2.4.2 Proper care and use of tools 2.4.3 Identification of test and measuring instruments 2.4.4 Proper care and use of test and measuring instruments 2.5 System and Processes 2.5.1 Principles of electrical circuits 2.5.2 Fundamentals of direct current circuits 2.5.3 Fundamentals of alternating current circuits 2.5.4 Fundamentals of electronic components and circuits 2.5.5 Fundamentals of digital logics, components & circuits 2.5.6 Fundamentals of microprocessor circuits and programming 2.5.7 Analysis of troubles and isolation techniques 2.5.8 Principles of sound and acoustics 2.5.9 Fundamentals of audio amplifiers 2.5.10 Fundamentals of audio source & noise reduction system 2.5.11 Fundamentals of AM & FM Receivers 2.5.12 Principles of vision and color 2.5.13 Fundamentals of color television 2.5.14 Fundamentals of video sources & noise reduction system 2.6 Theories and Principles 2.6.1 AM transmission and reception 2.6.2 FM transmission and reception 2.6.3 Analog TV transmission and reception",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 48 2.6.4 Digital HDTV transmission and reception 2.6.5 Audio Video sources and formats 2.6.6 Pulse Code Modulation 2.6.7 Home theater system 2.6.8 Digital noise reduction system 2.6.9 CCTV system 2.6.10 Infrared remote control system 2.6.11 Motor and motor control system 2.6.12 LED and lighting system 2.6.13 Heat and heating control system 2.6.14 Solar cell and battery management system 2.6.15 Microcontroller 2.6.16 Microcontroller interfacing 2.7 Consumer electronic products and systems installation procedures 2.8 Systematic pre-testing procedures 2.9 System defects/Fault symptoms 2.10 Mechanical and electrical/electronic testing 2.11 Commissioning procedures 2.12 3Rs waste management programs 2.13 Rules and conventions 2.13.1 Philippine Electronics Code 2.13.2 RoHS/WEEE Directives 2.13.3 RA 9292 – ECE Law commissioning procedures 3 Required skills 3.1 Application of troubleshooting technique 3.2 Using and maintaining test instruments, tools, & equipment 3.3 Application of work safety practices and time management 3.4 Application of substitution technique 3.5 Soldering/desoldering and wiring/cabling techniques 3.6 Schematic diagram reading skills 4 Method of assessment Competency may be assessed through: 4.1 Practical Demonstration w/ oral questioning 4.2 Interview 4.3 Portfolio 5 Resource implications The following resources must be provided: 5.1 Tools, equipment and test instruments 5.2 Needed audio-video products and systems 5.3 Needed consumer appliances 5.4 Service manuals/schematics 5.5 ESD free working area/bench 5.6 Needed electronic spare parts/supplies 6 Context of assessment 6.1 Assessment maybe conducted in the workplace or in a simulated workplace setting",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 49 UNIT OF COMPETENCY: SERVICE INDUSTRIAL ELECTRONIC MODULES, PRODUCTS AND SYSTEMS UNIT CODE: ELC724 337 DESCRIPTION: This unit covers the knowledge, skills and attitudes required to install and service industrial electronic modules, products and systems. It consists of competencies in installing, troubleshooting, maintenance and repairing industrial electronic modules, products and systems. ELEMENT PERFORMANCE CRITERIA (Italicized bold terms are elaborated in the range of variables) 1. Prepare unit, tools and workplace for installation/servicing 1.1 Complete check-up of industrial electronic components, products and systems is conducted and defects are identified, verified and documented against customer description. 1.2 Repair/maintenance history is verified in line with the company procedures. 1.3 Service manuals and service information required for repair/maintenance are acquired as per standard procedure. 1.4 Workplace is set/prepared for repair job in line with the company requirements. 1.5 Necessary tools, test instruments and personal protective equipment are prepared in line with job requirements 2. Install industrial electronic modules/products/systems 2.1 Materials necessary to complete the work are obtained in accordance with job requirements. 2.2 Industrial electronic modules/products/systems are installed in accordance with manufacturer’s instructions, requirements, and without damage to the surrounding place or environment 2.3 Devices are tested in accordance with standard procedures. 2.4 Final inspections are undertaken to ensure that the installed devices conforms to technical requirements. 2.5 Unplanned events or conditions are responded to in accordance with established procedures 2.6 Work site is cleaned and cleared of all debris and left safe in accordance with the company requirements 2.7 Report on installation and testing of equipment is prepared according to company’s procedures/policies. 3. Diagnose faults and defects of industrial electronic modules/products/systems 3.1 Systematic pre-testing procedure is observed in accordance with manufacturer’s instructions. 3.2 System defects/Fault symptoms are identified using appropriate tools and equipment and troubleshooting techniques and in accordance with safety procedures 3.3 Test instruments required for the job are used in accordance with user manuals. 3.4 Circuits are checked and isolated using specified testing procedures 3.5 Identified defects and faults are explained to the responsible person in accordance with enterprise or company policy and procedures 3.6 Control settings/adjustments are checked in conformity with service-manual specifications. 3.7 Results of diagnosis and testing are documented accurately and completely within the specified time. 3.8 Customers are advised/informed regarding the status and serviceability of the unit according to procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 50 ELEMENT PERFORMANCE CRITERIA (Italicized bold terms are elaborated in the range of variables) 4. Maintain/Repair industrial electronic products 4.1 Personal protective equipment is used in accordance with Occupational Health and Safety practices. 4.2 Electro-static discharge (ESD) protection procedure is followed in accordance with current industry standards. 4.3 Defective parts/components are replaced with identical or recommended appropriate equivalent ratings 4.4 Repaired or replaced parts/components are soldered/mounted in accordance with the current industry standards. 4.5 Control settings/adjustments are performed in conformity with service-manual specifications 4.6 Repair activity is performed within the required timeframe 4.7 Care and extreme precaution in handling the unit/product is observed as per OHS procedures 4.8 Cleaning of unit is performed in accordance with standard procedures 4.9 Excess components and materials are disposed of based on WEEE directives and 3Rs waste management program. 5. Reassemble and test repaired industrial electronic products 5.1 Repaired units are reassembled according to procedures 5.2 Reassembled units are subjected to final testing and cleaning in conformity with manufacturer’s specifications 5.3 Service completion procedures and documentations are complied with based on manual. 5.4 Waste materials are disposed of in accordance with environmental requirements.",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 51 RANGE OF VARIABLES VARIABLE RANGE 1. Industrial electronics products and systems include -- 1.1 Industrial Electronic Components 1.2 Industrial Electronic Product * 1.2.1 Control boards and modules 1.2.2 Motor controllers and drives 1.2.3 Sensors and input devices 1.2.4 Actuators and output devices 1.2.5 Opto-electronics equipment and devices * NOTE: Only the electronics portion of the products and/or systems is covered in this unit of competency. 2. Service manuals 2.1 Service manual/schematic diagram/parts list 2.2 Operating instructions/User’s/Owner’s manual 3. Service Information 3.1 Job Report Sheets 3.2 Job Order 3.3 Bill of materials 3.4 Customer index 3.5 Service flowchart 3.6 Stock and inventory record 3.7 Requisition slips (for acquisition of parts) 3.8 Supplier Index 4. Tools, Materials and Test Instruments May include but not limited to: 4.1 Variable power supply 4.2 Step-down transformer 4.3 Soldering iron/gun 4.4 Desoldering tools 4.5 Screwdriver (assorted) 4.6 Wrenches (assorted) 4.7 Allen wrench/key 4.8 Signal generator - AF/RF 4.9 Multi-testers (analog/digital) 4.10 Utility knife/stripper 4.11 Pliers (assorted) 4.12 Test jig 4.13 ESD-free work bench with mirror 4.14 Oscilloscope 4.15 High-grade magnifying glass with lamp 4.16 Flashlight 4.17 Cleaning brush 4.18 High voltage probe 4.19 Ball peen hammer 4.20 Soldering lead 4.21 Wires 4.22 Assorted industrial electronic components 5. Personal protective equipment May include but not limited to: 5.1 Working clothes/Apron 5.2 Hand gloves 5.3 Face/Dust Mask 5.4 Goggles",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 52 VARIABLE RANGE 6. Pre - testing procedures 6.1 Visual inspection of the unit with power off 6.2 Interview of customer re history of unit 6.3 Operate the unit according to manual to confirm defects 7. Troubleshooting techniques May include: 7.1 Sensory methods  Visual checks  Listening for telltale sounds  Lookout for unusual smells  Touching or feeling 7.2 Component substitution 7.3 Signal injection and tracing 7.4 Voltage and current measurement 7.5 Continuity/resistance testing 7.6 Waveform analysis 7.7 Display analysis (for video displays) 7.8 Circuit analysis 8. Responsible persons 8.1 Immediate supervisor 8.2 Service supervisor/manager 9. OHS requirements in accordance with legislation & regulations 9.1 Use of proper tools and equipment 9.2 Observe workplace environment and safety 9.3 Adherence to safety requirements in handling the unit 9.4 Use of protective device/shields 9.5 Philippine Electronics Code 10. Environmental Requirements 10.1 Proper disposal of chemicals and components shall be based on existing requirements of the law and chemical waste management 10.2 Non - biodegradable parts or materials shall be packed and labeled properly for disposal.",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 53 EVIDENCE GUIDE 1 Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Prepared unit, tools and workplace for installation/servicing 1.2 Installed industrial electronics systems/products 1.3 Diagnosed faults of industrial electronics systems/products 1.4 Maintained/Repaired industrial electronics products 1.5 Reassembled and tested repaired industrial electronics products 1.6 Applied safety rules and procedures 2 Required knowledge and attitude 2.1 Mensuration/Mathematics 2.1.1 Conversion of units 2.1.2 Applied mathematics 2.2 Drawing and Schematic Diagram 2.2.1 Reading and interpreting orthographic projections and isometric views 2.2.2 Reading and interpreting electronic schematic symbols and diagram 2.3 Environment and Safety 2.3.1 Work Safety requirements and economy of materials with durability 2.3.2 Knowledge in 5S application and observation of required procedure 2.3.3 Practicing 3Rs – reduce, re-use, recycle/recover 2.3.4 Managing waste from electrical and electronic equipment (WEEE) 2.4 Materials, tools/instruments & equipment uses and specifications 2.4.1 Identification of hand and power tools 2.4.2 Proper care and use of tools 2.4.3 Identification of test and measuring instruments 2.4.4 Proper care and use of test and measuring instruments 2.5 Theories and Principles 2.5.1 Differential amplifiers 2.5.2 Analog to digital conversion 2.5.3 Digital to analog conversion 2.5.4 Solenoid Actuators 2.5.5 Solid state relay 2.5.6 LED 2.5.7 Light sensor 2.5.8 Lighting control system 2.5.9 Temperature control system 2.5.10 Temperature sensor 2.5.11 Voltage and current control system 2.5.12 Voltage/frequency and frequency conversion 2.5.13 Timers 2.5.14 Time control system 2.5.15 Liquid level control system 2.5.16 Optical sensor 2.5.17 Fiber optic cable 2.5.18 Fiber optic diode (tx and rx) 2.5.19 Optical and touch control system 2.5.20 Hall sensor 2.5.21 Encoder/decoder 2.5.22 DC/AC and brushless motor 2.5.23 Stepping and servo motor",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 54 2.5.24 Pulse Width Modulation 2.5.25 Rotation control system 2.5.26 Acoustic sensor 2.5.27 Acoustic control system 2.5.28 Teaching pendant 2.5.29 Basic Robotic principles 2.5.30 Ultrasonic sensor (tx and rx) 2.5.31 Ultrasonic control system 2.5.32 Infrared sensor 2.5.33 Motion sensor 2.5.34 Infrared control system 2.5.35 Strain gage 2.5.36 Pressure sensor 2.5.37 Pressure control system 2.5.38 Microcontroller 2.5.39 Microcontroller interfacing 2.6 3Rs waste management programs 2.7 Consumer electronic products and systems installation procedures 2.8 Systematic pre - testing procedures 2.9 System defects/Fault symptoms 2.10 Mechanical and electrical/electronic testing 2.11 Rules and conventions 2.11.1 Philippine Electronics Code 2.11.2 RoHS /WEEE Directives 2.11.3 RA 9292 – ECE Law Commissioning procedures 3 Required skills 3.1 Application of troubleshooting technique 3.2 Using and maintaining test instruments, tools, & equipment 3.3 Application of work safety practices and time management 3.4 Application of substitution technique 3.5 Soldering/desoldering and wiring/cabling techniques 3.6 Schematic diagram reading skills 4 Method of assessment Competency may be assessed through: 4.1 Practical Demonstration w/ oral questioning 4.2 Interview 4.3 Portfolio 5 Resource implications The following resources must be provided: 5.1 Tools, equipment and test instruments 5.2 Access to Industrial electronic products and systems and work environment, e.g. 5.2.1 Control boards and modules 5.2.2 Motor controllers and drives 5.2.3 Sensors and input devices 5.2.4 Actuators and output devices 5.2.5 Opto - electronics equipment and devices 5.2.6 Data communication systems 5.2.7 Microcontroller - based equipment 5.3 Service manuals/schematics 5.4 ESD free working area/bench 5.5 Complete electronic spare parts/supplies 6 Context of assessment 6.1 Assessment maybe conducted in the workplace or in a simulated workplace setting",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            }
        ]
    }
]