[
    {
        "name": "Electrical Installation and Maintenance NC II",
        "core_competencies": [
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 31 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM ROUGHING-IN ACTIVITIES, WIRING AND CABLING WORKS FOR SINGLE-PHASE DISTRIBUTION, POWER, LIGHTING AND AUXILIARY SYSTEMS UNIT CODE: ELC 74 1 3 01 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes on installing electrical metallic and non-metallic conduit, wire ways and cable clamp, auxiliary terminal cabinet and distribution frame panel board/safety switch and used in roughing-in based on the required performance standards. This unit also covers the outcomes required in preparing for cable pulling and installation, performing wiring and cabling layout and notifying completion of work for single-phase distribution, power, lighting and auxiliary systems. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Install electrical metallic / non-metallic (PVC conduit) 1.1 Correct drawings are interpreted based on job requirements 1.2 Correct quantities of conduit, fittings and accessories are determined as per job requirements 1.3 Tools and equipment are selected as per job requirements 1.4 Conduit is assembled ensuring that fittings are fully inserted and tightened as per job requirements 1.5 Conduit is bent with bends not exceeding 90° as per job requirements 1.6 Conduit couplings and elbows are installed as per job requirements 1.7 Conduit is threaded in line with job requirements 1.8 Safety procedures are followed in line with standard operating procedures (SOPs)  Interpretation of electrical wiring diagrams  mechanical drawings  Types of electrical conduits  Proper uses and installation of conduits  Techniques in installing and bending of conduits and fittings  Proper Installation for maintenance accessibility  Safe use of adhesives  Proper use of safety harness (PPE)  Reading skills required to interpret work instructions  Handling of materials and tools and equipment  Laying out conduits  Bending electrical metallic conduits  Cutting conduits  Performing the installation  economically",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 32 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Install wire ways and cable tray 2.1 Correct drawings are interpreted to determine job requirements 2.2 Correct quantities of materials are selected as per job requirements 2.3 Tools and equipment are selected as per job requirements 2.4 Wire ways and cable trays are installed as per job requirements. 2.5 Safety procedures are followed in line with SOPs  Mensuration  Blue print reading  Materials specification  Use of materials, tools and equipment  Interpretation of an electrical and mechanical drawing.  Proper uses and installation of wire ways and cable trays  Suitability for installation and used of bus way, cable tray, fittings and panels in conformity with the provision of the PEC.  Proper use of safety harness (PPE)  Interpreting technical plan  Effective communication skills (written and oral)  Effective use of measuring devices  Installing wire ways and cable tray 3. Install auxiliary terminal cabinet and distribution panel 3.1 Correct drawings are interpreted to determine job requirements 3.2 Correct quantities of materials are selected as per job requirements 3.3 Tools and equipment are selected as per job requirements 3.4 Auxiliary terminal cabinet is installed as per job requirements 3.5 Auxiliary main distribution frame is installed as per job requirements 3.6 Safety procedures are followed in line with SOPs  Mensuration  Blue print reading and materials specification  Use of wires and cables and tools,  Interpretation of electrical and mechanical drawing  Proper procedure in installation of auxiliary terminal cabinet and distribution panels.  Proper use of safety harness and PPE  Interpreting technical plan  Effective communication skills (written and oral)  Effective use of measuring devices  Installing different types of panel/frame 4. Prepare for cable pulling and installation 4.1 Necessary tools, equipment, materials and personal protective equipment (PPE) are prepared in line with job requirements. 4.2 Cable pulling & installation requirements and constraints from plan and site inspection are identified as per job requirements. 4.3 Cable layout & installation equipment is set up in accordance with  Mensuration  Blue print reading and materials specification  Use of wires, cables and tools  Preparation of required size of cable based on PEC Wire Table  Cable pulling and installation requirements  Cable layout and  Interpreting technical plan  Effective communication skills (written and Oral)  Effective use of measuring devices  Interpreting plans and drawings  Handling of",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 33 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS manufacturer's and job requirements. 4.4 Site is made safe and secure for cable installation. 4.5 Suitable protective clothing is selected and required safety devices are used 4.6 Support structure is assessed as safe for normal working conditions. installation materials, tools and equipment  Applying methods and techniques in various type of wiring wires and cables  Pulling of conductors 5. Perform wiring and cabling layout 5.1 Safety procedures are followed based on safety regulations PPE are identified and selected in line with safety requirements 5.2 Tools, equipment, pulling compound and safety requirements are identified and obtained for the layout and installation. 5.3 Pulling materials is properly installed and tensioned to required specifications 5.4 Cable is secured permanently to support structure in accordance with standard installation procedures 5.5 Bending radius and loops tolerance is observed for cable materials at all times 5.6 Schedule of wire cutting lists is followed based on estimates, quantity and sizes to avoid wastage. 5.7 Further instructions are sought if unplanned events or conditions occur 5.8 Checking of quality of work is done in accordance with instructions and requirements.  DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry  Wiring procedure such as cable lay-out, pulling splicing and termination of wire.  Uses of different type of wires and cables and its applications  Markings of Circuit homeruns.  Application of pulling compound  Bundling of wire size as per job requirement.  Applying methods and techniques in various type of wiring wires and cables  Wiring-up the required electrical control based on the standard.  Connecting and terminating of motor terminal/ leads out and the control devices.  Checking for continuity test or ohmmeter test of motor terminal.  Terminating wires  Performing the installation economically.",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 34 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 6. Notify completion of work 6.1 Final checks are made to ensure that work conforms with instructions and job requirements 6.2 Supervisor is notified upon completion of work 6.3 Tools, equipment and any surplus resources and materials are, where appropriate, cleaned, checked and returned to storage in accordance with established procedures 6.4 Work area is cleaned up and made safe according to OHSA regulations  Processes, Operations, Systems o Maintenance of tools o Storage of tools  Checking and Conforming procedures in installation based on job requirement  Good housekeeping  Skills in continuity test or ohmmeter test of motor terminal.  Commissioning skills  Documentation and reporting skills",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 35 RANGE OF VARIABLES VARIABLE RANGE 1. Metallic conduits / non-metallic conduit 1.1 Rigid Steel Conduits (RSC) 1.2 Intermediate Metallic Conduit (IMC) 1.3 Electrical Metallic Tubing (EMT) 1.4 Polyvinyl Chloride Pipe (PVC) 2. Fittings 2.1 Condulets and Reducers 2.2 lock nut and bushing 2.3 Entrance cap 2.4 Nipple 2.5 Elbow 3. Accessories 2.1 Boxes  Utility Box  Junction Box  Pull box/Splice box 2.2 Conduit supports (e.g. hangers) 2.3 Conduit Strap 2.4 Connectors (straight and angle) 4. Tools and equipment Including but not limited to: 3.1 Spirit level, hack saw, pipe cutter, plumb bob, pipe reamer, pipe threader, pipe bender, bolt cutter, electric drill 3.2 Electrical power tools - Power drills - Portable grinder 4. Installation 4.1 Electrical Metallic conduit - Fitting/coupling/connector fully inserted and tightened - Elbows with clamps/supports for mounting - Conduit rigidly anchored to building structure - Smooth field off-set bends - Conduit bend not to exceed 90° - Standard distance between supports - Conduit ends reamed and without sharp edges - Conduit cut to length requirement 4.2 Wire ways and cable tray - Boxes plumb to ground and rigidly anchored to walls building structure - Conduit rigidly clamp to building structure - Couplings fully inserted - Ground wire bonding jumper each joint. 4.3 Auxiliary terminal cabinet and distribution panel. - Conduit ends reamed and cleaned of burrs and rough edges - Fitting fully inserted and applied with adhesive solvent - Conduit cut to length requirement - PVC coupling with adhesive solvent",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 36 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Installed electrical metallic /non-metallic (PVC conduit) 1.2 Installed wire ways and cable tray 1.3 Installed auxiliary terminal cabinet and distribution panel 1.4 Prepared for cable pulling and installation 1.5 Performed wiring and cabling layout 1.6 Notified completion of work 2. Resource Implications The following resources MUST be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate to roughing-in, wiring and cabling works and installation processes 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3. Methods of Assessment Competency must be assessed through: 3.1 Direct observation of application to tasks. 3.2 Questions related to underpinning knowledge 3.3 Demonstration 3.4 Written test 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in a simulated workplace setting 4.2 Assessment shall be done while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 37 UNIT OF COMPETENCY: INSTALL ELECTRICAL PROTECTIVE DEVICES FOR DISTRIBUTION, POWER, LIGHTING, AUXILIARY, LIGHTNING PROTECTION AND GROUNDING SYSTEMS UNIT CODE: ELC 741302 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes on planning and preparing work, installing electrical protective devices, lightning fixture and auxiliary outlet and notifying completion of work for distribution, power, lighting, auxiliary, lightning protection and grounding systems. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Plan and prepare work 1.1 Instructions for the preparation of the work activity are communicated and confirmed to ensure clear understanding 1.2 Tools, equipment and PPE needed to install electrical wiring are identified, checked to ensure they work correctly as intended and are safe to use in accordance with established procedures 1.3 Materials needed for work are obtained in accordance with established procedures.  Types of protective devices and its applications/applications  Identification of standard drawing based on standard (ANSI or IEC)  Protective devices specifications  Electrical protection system components  Interpreting plans and details drawing.  Handling of materials, tools and equipment 2. Install electrical protective devices 2.1 Safety procedures are followed in line with job requirements 2.2 Correct procedures for installation of electrical protective devices are performed in line with job requirements and PEC 2.3 Schedule of work is followed to ensure work is completed in an agreed time, to a quality standard and with a minimum waste 2.4 Further instructions are sought from a supervisor if unplanned events or conditions occur 2.5 On-going checks of quality of work are done in accordance with instructions and requirements  DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry  Philippine Electrical Code (PEC) requirements regarding installation of electrical protection devices  Uses of different protective devices - o panelboard; o circuit breaker; o safety switch; o ground fault current interrupting device (GFCI); and o conventional atmospheric lightning protection and grounding system  Interpreting plans and details drawing.  Applying methods and techniques in installation of various type of protective devices and lightning protection and grounding systems  Performing the installation economically.",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 38 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Install lighting fixture and auxiliary outlet. 3.1 Safety procedures are followed 3.2 Correct procedures for installation of lighting fixture and auxiliaries are performed in line with job requirements 3.3 Schedule of work is followed to ensure work is completed in an agreed time, to a quality standard and with a minimum waste 3.4 Further instructions are sought from a supervisor if unplanned events or conditions occur. 3.5 On-going checks of quality of work are undertaken in accordance with instructions and requirements.  DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry  Philippine Electrical Code (PEC) requirements regarding installation of lighting fixture and auxiliary outlet  Types of lighting fixtures and installation technique  Ratings of lighting fixture  Interpreting plans and details  Handling of materials, tools and equipment  Interpreting product technical brochure  Applying methods and techniques in installation of various type of lighting fixture and auxiliary outlet 4. Notify completion of work. 4.1 Final checks are made to ensure the work conforms with instructions and requirements 4.2 Supervisor is notified upon completion of work 4.3 Tools, equipment and any surplus resources and materials are, where appropriate, cleaned, checked and returned to storage in accordance with established procedures 4.4 Work area is cleaned and made safe  Processes, Operations, Systems o Maintenance of tools o Storage of tools  Checking and conforming procedures for installation based on job requirement  Good housekeeping  Skills in continuity test or ohmmeter test of motor terminal.  commissioning skills  Documentation and reporting skills",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 39 RANGE OF VARIABLES VARIABLE RANGE 1. Tools and equipment Tools and equipment may include but not limited to: 5.1 Pliers 5.2 Screwdrivers 5.3 Wrenches 5.4 Wire splicers 5.5 Electrician knives 5.6 electric drill 5.7 Ball hammer 2. Personal protective equipment (PPE) 2.1 Working gloves 2.2 Safety shoes 2.3 Hard hat 3. Safety procedures Safety procedures included in: 3.1 Philippine Electrical Code 3.2 Safety standards 4. Installation 4.1 Horizontally and vertically aligned 4.2 Rigidly anchored to wall 4.3 Installed with clearance to wall/other boxes for cover to open freely 4.4 Enough clearance for cover opening for flush mounted 5. Electrical protection system component 5.1 Safety switch 5.2 Earth Leakage Circuit Breaker (ELCB) 5.3 Conventional atmospheric lightning protection 5.4 Grounding system 6. lighting fixture 6.1 Lamps 6.2 Spotlights 6.3 Track lights 6.4 Perimeter lighting",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 40 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Correctly interpreted work instructions 1.2 Selected appropriate tools, equipment and materials for installation of electrical protection system 1.3 Selected and used correct PPE 1.4 Demonstrated correct procedures on installation of electrical protective devices 1.5 Demonstrated correct procedures on installation of lighting fixture and auxiliary outlet 1.5 Followed safety procedures/protocol 1.6 Cleaned worksite, tools and equipment 1.7 Stored surplus materials 2. Resource Implications The following resources MUST be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate for installation of electrical protection systems 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3. Methods of Assessment Competency must be assessed through: 3.1 Direct observation of candidate's application of knowledge to tasks. 3.2 Questions related to underpinning knowledge 3.3 Demonstration/Practical activity 3.4 Written test 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in simulated workplace setting 4.2 Assessment shall be observed while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 41 UNIT OF COMPETENCY: INSTALL WIRING DEVICES OF FLOOR AND WALL MOUNTED OUTLETS, LIGHTING FIXTURE/SWITCHES AND AUXILIARY OUTLETS UNIT CODE: ELC 74130 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes on selecting and installing wiring devices, installing lighting fixtures/switches and notifying completion of work of floor and wall mounted outlets and auxiliary outlets. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Select wiring devices 1.1 Drawings are read and interpreted to determine job requirements 1.2 Correct type and quantity of wiring devices and consumable items are identified in line with job requirements 1.3 Tools and equipment are selected in line with job requirements 1.4 Correct PPE are identified and selected in line with safety requirements • Blue print reading • Materials specification • Types and uses of electrical wiring devices, tools and equipment • Proper PPEs • Interpreting plans and details • Handling of materials, tools and equipment • Communication (written and oral) • Selecting wiring devices 2. Install wiring devices 2.1 Safety procedures are followed based on safety regulations 2.2 Correct procedures for installation of wiring devices are performed in line with job requirements 2.3 Schedule of work is followed based on agreed time, quality standard and minimum wastage 2.4 Further instructions are sought if unplanned events or conditions occur 2.5 On-going checking of quality of work is done in accordance with instructions and requirements. • Installation procedures of various wiring devices • DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry • PEC requirement regarding installation of wiring devices • Applying methods and techniques in various type of wiring devices • Checking and conforming the installation based on job requirement",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 42 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Install lighting fixture/ switches 3.1 Safety procedures are followed 3.2 Correct procedures for installation of lighting fixtures/switches are performed in line with job requirements 3.3 Schedule of work is followed to ensure work is completed in an agreed time, to a quality standard and with a minimum waste 3.4 Further instructions are sought from a supervisor if unplanned events or conditions occur 3.5 On-going checks of quality of work are undertaken in accordance with instructions and requirements  Types of lighting fixtures and installation technique  Installation procedures of various lighting fixtures/switches  Ratings of lighting fixture  DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry  PEC requirement regarding installation of various lighting fixtures/switches  Applying methods and techniques in various type of lighting fixtures/switches  Checking and conforming the installation based on job requirement  Installing lighting fixture and switches 4. Notify completion of work 4.1 Final checks are made to ensure that work conforms with instructions and to requirements 4.2 Supervisor is notified upon completion of work 4.3 Tools, equipment and any surplus resources and materials are, where appropriate, cleaned, checked and returned to storage in accordance with established procedures 4.4 Work area is cleaned and made safe  Processes, Operations, Systems o Maintenance of tools o Storage of tools  Checked and conformed the installation based on job requirement  Good housekeeping  Performing commissioning activity",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 43 RANGE OF VARIABLES VARIABLE RANGE 1. Wiring devices and consumable items 1.1 Wiring devices 1.1.1 Floor outlet 1.1.2 Ground fault current interrupting device 1.1.3 Grounding type convenience outlet 1.1.4 Light switches 1.2 Consumable items 1.2.1 Wire nut 1.2.2 Electrical tape 1.2.3 rubber tape 2. Tools and equipment 2.1 Pliers 2.2 Screwdrivers 2.3 Wire splicers 2.4 Electrician knives 3. Personal protective equipment (PPE) May include but not limited to: 3.1 Working gloves 3.2 Safety shoes 3.3 Hard hat 4. Safety procedures Includes Safety procedures in: 4.1 Philippine Electrical Code 4.2 Safety standards 5. Installation of wiring devices 5.1 Horizontally and vertically aligned 5.2 No gap between plate cover and wall 5.3 Wire cut to requirement 5.4 All bolts tightened for rigid mounting 6 Installation of lighting fixtures/switches 6.1 Lamps - Horizontally aligned against wall - No gap between ceiling and lighting fixture base - Wiring at junction box cut to requirement as required - Lamps securely mounted 6.2 Spotlights - Horizontally aligned against wall - No gap between ceiling and lighting fixture base - Wiring at junction box cut to requirement as required - Floodlights/spotlights securely mounted 6.3 Track Lights - Wiring at junction box cut to requirement as required - Track light mounted securely 6.4 Perimeter Lighting - Perimeter lighting installed as per plan/shop - Foundation constructed as per plan - Fixture wired and tested - Fixture mounted to pole",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 44 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Correctly interpreted work instructions 1.1 Selected appropriate tools, equipment and materials for installing wiring devices and lighting fixtures/switches and auxiliary outlet 1.3 Selected and used correct PPE 1.2 Demonstrated correct procedures for installation of wiring devices and lighting fixtures/switches 1.5 Followed safety procedures/protocol 1.6 Cleaned worksite, tools and equipment 1.7 Stored surplus materials 2. Resource Implications The following resources MUST be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate for installation of wiring devices and lighting fixtures/switches 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3. Methods of Assessment Competency must be assessed through: 3.1 Direct observation of application of tasks 3.2 Questions related to underpinning knowledge 3.3 Demonstration/Practical activity 3.4 Written test 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in a simulated workplace setting 4.2 Assessment shall be observed while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            }
        ]
    }
]