[
    {
        "name": "Electrical Installation and Maintenance NC II",
        "core_competencies": [
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 31 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM ROUGHING-IN ACTIVITIES, WIRING AND CABLING WORKS FOR SINGLE-PHASE DISTRIBUTION, POWER, LIGHTING AND AUXILIARY SYSTEMS UNIT CODE: ELC 74 1 3 01 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes on installing electrical metallic and non-metallic conduit, wire ways and cable clamp, auxiliary terminal cabinet and distribution frame panel board/safety switch and used in roughing-in based on the required performance standards. This unit also covers the outcomes required in preparing for cable pulling and installation, performing wiring and cabling layout and notifying completion of work for single-phase distribution, power, lighting and auxiliary systems. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Install electrical metallic / non-metallic (PVC conduit) 1.1 Correct drawings are interpreted based on job requirements 1.2 Correct quantities of conduit, fittings and accessories are determined as per job requirements 1.3 Tools and equipment are selected as per job requirements 1.4 Conduit is assembled ensuring that fittings are fully inserted and tightened as per job requirements 1.5 Conduit is bent with bends not exceeding 90° as per job requirements 1.6 Conduit couplings and elbows are installed as per job requirements 1.7 Conduit is threaded in line with job requirements 1.8 Safety procedures are followed in line with standard operating procedures (SOPs)  Interpretation of electrical wiring diagrams  mechanical drawings  Types of electrical conduits  Proper uses and installation of conduits  Techniques in installing and bending of conduits and fittings  Proper Installation for maintenance accessibility  Safe use of adhesives  Proper use of safety harness (PPE)  Reading skills required to interpret work instructions  Handling of materials and tools and equipment  Laying out conduits  Bending electrical metallic conduits  Cutting conduits  Performing the installation  economically",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 32 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Install wire ways and cable tray 2.1 Correct drawings are interpreted to determine job requirements 2.2 Correct quantities of materials are selected as per job requirements 2.3 Tools and equipment are selected as per job requirements 2.4 Wire ways and cable trays are installed as per job requirements. 2.5 Safety procedures are followed in line with SOPs  Mensuration  Blue print reading  Materials specification  Use of materials, tools and equipment  Interpretation of an electrical and mechanical drawing.  Proper uses and installation of wire ways and cable trays  Suitability for installation and used of bus way, cable tray, fittings and panels in conformity with the provision of the PEC.  Proper use of safety harness (PPE)  Interpreting technical plan  Effective communication skills (written and oral)  Effective use of measuring devices  Installing wire ways and cable tray 3. Install auxiliary terminal cabinet and distribution panel 3.1 Correct drawings are interpreted to determine job requirements 3.2 Correct quantities of materials are selected as per job requirements 3.3 Tools and equipment are selected as per job requirements 3.4 Auxiliary terminal cabinet is installed as per job requirements 3.5 Auxiliary main distribution frame is installed as per job requirements 3.6 Safety procedures are followed in line with SOPs  Mensuration  Blue print reading and materials specification  Use of wires and cables and tools,  Interpretation of electrical and mechanical drawing  Proper procedure in installation of auxiliary terminal cabinet and distribution panels.  Proper use of safety harness and PPE  Interpreting technical plan  Effective communication skills (written and oral)  Effective use of measuring devices  Installing different types of panel/frame 4. Prepare for cable pulling and installation 4.1 Necessary tools, equipment, materials and personal protective equipment (PPE) are prepared in line with job requirements. 4.2 Cable pulling & installation requirements and constraints from plan and site inspection are identified as per job requirements. 4.3 Cable layout & installation equipment is set up in accordance with  Mensuration  Blue print reading and materials specification  Use of wires, cables and tools  Preparation of required size of cable based on PEC Wire Table  Cable pulling and installation requirements  Cable layout and  Interpreting technical plan  Effective communication skills (written and Oral)  Effective use of measuring devices  Interpreting plans and drawings  Handling of",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 33 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS manufacturer's and job requirements. 4.4 Site is made safe and secure for cable installation. 4.5 Suitable protective clothing is selected and required safety devices are used 4.6 Support structure is assessed as safe for normal working conditions. installation materials, tools and equipment  Applying methods and techniques in various type of wiring wires and cables  Pulling of conductors 5. Perform wiring and cabling layout 5.1 Safety procedures are followed based on safety regulations PPE are identified and selected in line with safety requirements 5.2 Tools, equipment, pulling compound and safety requirements are identified and obtained for the layout and installation. 5.3 Pulling materials is properly installed and tensioned to required specifications 5.4 Cable is secured permanently to support structure in accordance with standard installation procedures 5.5 Bending radius and loops tolerance is observed for cable materials at all times 5.6 Schedule of wire cutting lists is followed based on estimates, quantity and sizes to avoid wastage. 5.7 Further instructions are sought if unplanned events or conditions occur 5.8 Checking of quality of work is done in accordance with instructions and requirements.  DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry  Wiring procedure such as cable lay-out, pulling splicing and termination of wire.  Uses of different type of wires and cables and its applications  Markings of Circuit homeruns.  Application of pulling compound  Bundling of wire size as per job requirement.  Applying methods and techniques in various type of wiring wires and cables  Wiring-up the required electrical control based on the standard.  Connecting and terminating of motor terminal/ leads out and the control devices.  Checking for continuity test or ohmmeter test of motor terminal.  Terminating wires  Performing the installation economically.",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 34 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 6. Notify completion of work 6.1 Final checks are made to ensure that work conforms with instructions and job requirements 6.2 Supervisor is notified upon completion of work 6.3 Tools, equipment and any surplus resources and materials are, where appropriate, cleaned, checked and returned to storage in accordance with established procedures 6.4 Work area is cleaned up and made safe according to OHSA regulations  Processes, Operations, Systems o Maintenance of tools o Storage of tools  Checking and Conforming procedures in installation based on job requirement  Good housekeeping  Skills in continuity test or ohmmeter test of motor terminal.  Commissioning skills  Documentation and reporting skills",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 35 RANGE OF VARIABLES VARIABLE RANGE 1. Metallic conduits / non-metallic conduit 1.1 Rigid Steel Conduits (RSC) 1.2 Intermediate Metallic Conduit (IMC) 1.3 Electrical Metallic Tubing (EMT) 1.4 Polyvinyl Chloride Pipe (PVC) 2. Fittings 2.1 Condulets and Reducers 2.2 lock nut and bushing 2.3 Entrance cap 2.4 Nipple 2.5 Elbow 3. Accessories 2.1 Boxes  Utility Box  Junction Box  Pull box/Splice box 2.2 Conduit supports (e.g. hangers) 2.3 Conduit Strap 2.4 Connectors (straight and angle) 4. Tools and equipment Including but not limited to: 3.1 Spirit level, hack saw, pipe cutter, plumb bob, pipe reamer, pipe threader, pipe bender, bolt cutter, electric drill 3.2 Electrical power tools - Power drills - Portable grinder 4. Installation 4.1 Electrical Metallic conduit - Fitting/coupling/connector fully inserted and tightened - Elbows with clamps/supports for mounting - Conduit rigidly anchored to building structure - Smooth field off-set bends - Conduit bend not to exceed 90° - Standard distance between supports - Conduit ends reamed and without sharp edges - Conduit cut to length requirement 4.2 Wire ways and cable tray - Boxes plumb to ground and rigidly anchored to walls building structure - Conduit rigidly clamp to building structure - Couplings fully inserted - Ground wire bonding jumper each joint. 4.3 Auxiliary terminal cabinet and distribution panel. - Conduit ends reamed and cleaned of burrs and rough edges - Fitting fully inserted and applied with adhesive solvent - Conduit cut to length requirement - PVC coupling with adhesive solvent",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 36 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Installed electrical metallic /non-metallic (PVC conduit) 1.2 Installed wire ways and cable tray 1.3 Installed auxiliary terminal cabinet and distribution panel 1.4 Prepared for cable pulling and installation 1.5 Performed wiring and cabling layout 1.6 Notified completion of work 2. Resource Implications The following resources MUST be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate to roughing-in, wiring and cabling works and installation processes 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3. Methods of Assessment Competency must be assessed through: 3.1 Direct observation of application to tasks. 3.2 Questions related to underpinning knowledge 3.3 Demonstration 3.4 Written test 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in a simulated workplace setting 4.2 Assessment shall be done while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 37 UNIT OF COMPETENCY: INSTALL ELECTRICAL PROTECTIVE DEVICES FOR DISTRIBUTION, POWER, LIGHTING, AUXILIARY, LIGHTNING PROTECTION AND GROUNDING SYSTEMS UNIT CODE: ELC 741302 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes on planning and preparing work, installing electrical protective devices, lightning fixture and auxiliary outlet and notifying completion of work for distribution, power, lighting, auxiliary, lightning protection and grounding systems. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Plan and prepare work 1.1 Instructions for the preparation of the work activity are communicated and confirmed to ensure clear understanding 1.2 Tools, equipment and PPE needed to install electrical wiring are identified, checked to ensure they work correctly as intended and are safe to use in accordance with established procedures 1.3 Materials needed for work are obtained in accordance with established procedures.  Types of protective devices and its applications/applications  Identification of standard drawing based on standard (ANSI or IEC)  Protective devices specifications  Electrical protection system components  Interpreting plans and details drawing.  Handling of materials, tools and equipment 2. Install electrical protective devices 2.1 Safety procedures are followed in line with job requirements 2.2 Correct procedures for installation of electrical protective devices are performed in line with job requirements and PEC 2.3 Schedule of work is followed to ensure work is completed in an agreed time, to a quality standard and with a minimum waste 2.4 Further instructions are sought from a supervisor if unplanned events or conditions occur 2.5 On-going checks of quality of work are done in accordance with instructions and requirements  DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry  Philippine Electrical Code (PEC) requirements regarding installation of electrical protection devices  Uses of different protective devices - o panelboard; o circuit breaker; o safety switch; o ground fault current interrupting device (GFCI); and o conventional atmospheric lightning protection and grounding system  Interpreting plans and details drawing.  Applying methods and techniques in installation of various type of protective devices and lightning protection and grounding systems  Performing the installation economically.",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 38 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Install lighting fixture and auxiliary outlet. 3.1 Safety procedures are followed 3.2 Correct procedures for installation of lighting fixture and auxiliaries are performed in line with job requirements 3.3 Schedule of work is followed to ensure work is completed in an agreed time, to a quality standard and with a minimum waste 3.4 Further instructions are sought from a supervisor if unplanned events or conditions occur. 3.5 On-going checks of quality of work are undertaken in accordance with instructions and requirements.  DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry  Philippine Electrical Code (PEC) requirements regarding installation of lighting fixture and auxiliary outlet  Types of lighting fixtures and installation technique  Ratings of lighting fixture  Interpreting plans and details  Handling of materials, tools and equipment  Interpreting product technical brochure  Applying methods and techniques in installation of various type of lighting fixture and auxiliary outlet 4. Notify completion of work. 4.1 Final checks are made to ensure the work conforms with instructions and requirements 4.2 Supervisor is notified upon completion of work 4.3 Tools, equipment and any surplus resources and materials are, where appropriate, cleaned, checked and returned to storage in accordance with established procedures 4.4 Work area is cleaned and made safe  Processes, Operations, Systems o Maintenance of tools o Storage of tools  Checking and conforming procedures for installation based on job requirement  Good housekeeping  Skills in continuity test or ohmmeter test of motor terminal.  commissioning skills  Documentation and reporting skills",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 39 RANGE OF VARIABLES VARIABLE RANGE 1. Tools and equipment Tools and equipment may include but not limited to: 5.1 Pliers 5.2 Screwdrivers 5.3 Wrenches 5.4 Wire splicers 5.5 Electrician knives 5.6 electric drill 5.7 Ball hammer 2. Personal protective equipment (PPE) 2.1 Working gloves 2.2 Safety shoes 2.3 Hard hat 3. Safety procedures Safety procedures included in: 3.1 Philippine Electrical Code 3.2 Safety standards 4. Installation 4.1 Horizontally and vertically aligned 4.2 Rigidly anchored to wall 4.3 Installed with clearance to wall/other boxes for cover to open freely 4.4 Enough clearance for cover opening for flush mounted 5. Electrical protection system component 5.1 Safety switch 5.2 Earth Leakage Circuit Breaker (ELCB) 5.3 Conventional atmospheric lightning protection 5.4 Grounding system 6. lighting fixture 6.1 Lamps 6.2 Spotlights 6.3 Track lights 6.4 Perimeter lighting",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 40 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Correctly interpreted work instructions 1.2 Selected appropriate tools, equipment and materials for installation of electrical protection system 1.3 Selected and used correct PPE 1.4 Demonstrated correct procedures on installation of electrical protective devices 1.5 Demonstrated correct procedures on installation of lighting fixture and auxiliary outlet 1.5 Followed safety procedures/protocol 1.6 Cleaned worksite, tools and equipment 1.7 Stored surplus materials 2. Resource Implications The following resources MUST be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate for installation of electrical protection systems 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3. Methods of Assessment Competency must be assessed through: 3.1 Direct observation of candidate's application of knowledge to tasks. 3.2 Questions related to underpinning knowledge 3.3 Demonstration/Practical activity 3.4 Written test 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in simulated workplace setting 4.2 Assessment shall be observed while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 41 UNIT OF COMPETENCY: INSTALL WIRING DEVICES OF FLOOR AND WALL MOUNTED OUTLETS, LIGHTING FIXTURE/SWITCHES AND AUXILIARY OUTLETS UNIT CODE: ELC 74130 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes on selecting and installing wiring devices, installing lighting fixtures/switches and notifying completion of work of floor and wall mounted outlets and auxiliary outlets. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Select wiring devices 1.1 Drawings are read and interpreted to determine job requirements 1.2 Correct type and quantity of wiring devices and consumable items are identified in line with job requirements 1.3 Tools and equipment are selected in line with job requirements 1.4 Correct PPE are identified and selected in line with safety requirements • Blue print reading • Materials specification • Types and uses of electrical wiring devices, tools and equipment • Proper PPEs • Interpreting plans and details • Handling of materials, tools and equipment • Communication (written and oral) • Selecting wiring devices 2. Install wiring devices 2.1 Safety procedures are followed based on safety regulations 2.2 Correct procedures for installation of wiring devices are performed in line with job requirements 2.3 Schedule of work is followed based on agreed time, quality standard and minimum wastage 2.4 Further instructions are sought if unplanned events or conditions occur 2.5 On-going checking of quality of work is done in accordance with instructions and requirements. • Installation procedures of various wiring devices • DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry • PEC requirement regarding installation of wiring devices • Applying methods and techniques in various type of wiring devices • Checking and conforming the installation based on job requirement",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 42 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Install lighting fixture/ switches 3.1 Safety procedures are followed 3.2 Correct procedures for installation of lighting fixtures/switches are performed in line with job requirements 3.3 Schedule of work is followed to ensure work is completed in an agreed time, to a quality standard and with a minimum waste 3.4 Further instructions are sought from a supervisor if unplanned events or conditions occur 3.5 On-going checks of quality of work are undertaken in accordance with instructions and requirements  Types of lighting fixtures and installation technique  Installation procedures of various lighting fixtures/switches  Ratings of lighting fixture  DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry  PEC requirement regarding installation of various lighting fixtures/switches  Applying methods and techniques in various type of lighting fixtures/switches  Checking and conforming the installation based on job requirement  Installing lighting fixture and switches 4. Notify completion of work 4.1 Final checks are made to ensure that work conforms with instructions and to requirements 4.2 Supervisor is notified upon completion of work 4.3 Tools, equipment and any surplus resources and materials are, where appropriate, cleaned, checked and returned to storage in accordance with established procedures 4.4 Work area is cleaned and made safe  Processes, Operations, Systems o Maintenance of tools o Storage of tools  Checked and conformed the installation based on job requirement  Good housekeeping  Performing commissioning activity",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 43 RANGE OF VARIABLES VARIABLE RANGE 1. Wiring devices and consumable items 1.1 Wiring devices 1.1.1 Floor outlet 1.1.2 Ground fault current interrupting device 1.1.3 Grounding type convenience outlet 1.1.4 Light switches 1.2 Consumable items 1.2.1 Wire nut 1.2.2 Electrical tape 1.2.3 rubber tape 2. Tools and equipment 2.1 Pliers 2.2 Screwdrivers 2.3 Wire splicers 2.4 Electrician knives 3. Personal protective equipment (PPE) May include but not limited to: 3.1 Working gloves 3.2 Safety shoes 3.3 Hard hat 4. Safety procedures Includes Safety procedures in: 4.1 Philippine Electrical Code 4.2 Safety standards 5. Installation of wiring devices 5.1 Horizontally and vertically aligned 5.2 No gap between plate cover and wall 5.3 Wire cut to requirement 5.4 All bolts tightened for rigid mounting 6 Installation of lighting fixtures/switches 6.1 Lamps - Horizontally aligned against wall - No gap between ceiling and lighting fixture base - Wiring at junction box cut to requirement as required - Lamps securely mounted 6.2 Spotlights - Horizontally aligned against wall - No gap between ceiling and lighting fixture base - Wiring at junction box cut to requirement as required - Floodlights/spotlights securely mounted 6.3 Track Lights - Wiring at junction box cut to requirement as required - Track light mounted securely 6.4 Perimeter Lighting - Perimeter lighting installed as per plan/shop - Foundation constructed as per plan - Fixture wired and tested - Fixture mounted to pole",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC II (Amended) Promulgated Dec. 16, 2015 44 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Correctly interpreted work instructions 1.1 Selected appropriate tools, equipment and materials for installing wiring devices and lighting fixtures/switches and auxiliary outlet 1.3 Selected and used correct PPE 1.2 Demonstrated correct procedures for installation of wiring devices and lighting fixtures/switches 1.5 Followed safety procedures/protocol 1.6 Cleaned worksite, tools and equipment 1.7 Stored surplus materials 2. Resource Implications The following resources MUST be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate for installation of wiring devices and lighting fixtures/switches 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3. Methods of Assessment Competency must be assessed through: 3.1 Direct observation of application of tasks 3.2 Questions related to underpinning knowledge 3.3 Demonstration/Practical activity 3.4 Written test 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in a simulated workplace setting 4.2 Assessment shall be observed while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Electrical Installation and Maintenance NC III",
        "core_competencies": [
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 40 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM ROUGHING-IN AND WIRING ACTIVITIES FOR THREE-PHASE DISTRIBUTION SYSTEM FOR POWER, LIGHTING AND MOTOR CONTROL PANEL UNIT CODE: ELC741304 UNIT DESCRIPTOR: This unit of Core Electrical Competencies covers the knowledge and attitudes on installing cable tray, power panel, lighting panel and motor control center (MCC), fittings, under the required performance standard. This also includes wiring and completion works. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variable REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Prepare for rough-in and wiring works 1.1 Technical drawings and plans are interpreted to determine job requirements 1.2 Correct type and quantity of cable trays, power and lighting panels and MCC are identified and selected in line with job requirements 1.3 Tools and equipment are selected in line with job requirements 1.4 Correct PPE are identified and selected in line with safety requirements  Types of wiring diagram based on ANSI or IEC Standard.  Types of enclosures, proofing and mounting configuration  Types and uses of tools, materials and equipment for roughing-in and wiring.  Proper use of safety harness.  Interpreting plan and details drawing.  Identifying the required proofing of the panel and enclosure.  Identifying the functional and defective tools, materials and equipment. 2. Install cable tray and panel 2.1 Safety procedures are followed 2.2 Correct procedures for installation of cable tray and panel are performed in line with job requirements 2.3 Schedule of work is monitored to ensure work is completed in an agreed time, to a quality standard and with a minimum of waste 2.4 Unplanned events or conditions occurred are responded to accordingly 2.5 Checks of quality of work are undertaken in accordance with instructions and requirements  Interpretation of electrical/mechanical drawings  Cable trays o Uses and specifications  Panel board o Uses and specifications o Circuit breaker o Types of mounting of protective device o Circuit home run requirements  Proper procedure in installation of cable tray, fittings and panels.  Installation techniques for maintenance accessibility  Blue Print reading skills required to interpret work instructions.  Performing installation economically and based on job specifications",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 41 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variable REQUIRED KNOWLEDGE REQUIRED SKILLS  Proper use of safety harness.  PEC requirements in cable tray and panel installation 3. Perform wiring works 3.1 Safety procedures are followed based on safety regulations PPE are identified and selected in line with safety requirements 3.2 Tools, equipment, pulling compound and safety requirements are identified and obtained for the layout and installation. 3.3 Pulling materials are properly installed and tensioned to required specifications 3.4 Cable is secured permanently to support structure in accordance with standard installation procedures 3.5 Bending radius and loops tolerance is observed for cable materials at all times 3.6 Schedule of wire cutting lists is followed based on estimates, quantity and sizes to avoid wastage. 3.7 Further instructions are sought if unplanned events or conditions occur 3.8 Checking of quality of work is done in accordance with instructions and requirements.  Wiring works provisions in DOLE Department Order No. 13 s. 1998 - Guidelines Governing Occupational Safety and Health in the Construction Industry  Wiring procedures such as cable lay-out, pulling splicing and wire termination.  Usage of different type of wires and cables and its applications  Markings of circuit homeruns  Application of pulling compound.  Bundling of wire size as per job requirement.  PEC requirements in wiring works  Interpreting plans and drawings  Handling of materials, tools and equipment  Applying methods and techniques in various type of wiring wires and cables  Splicing and terminating wires 4. Complete work activity 4.1 Final checks are made to ensure that work conforms with instructions and to requirements 4.2 Tools, equipment and any surplus resources and materials are checked/monitored in accordance with established procedures 4.3 Work area is checked as to cleanliness and safety. 4.4 Waste materials and hazardous substances are disposal of in accordance with environmental rules and procedures.  Processes, Operations, Systems o Maintenance of tools o Storage of tools  Procedures in checking and conforming the installation based on job requirement  Proper disposal of waste materials and hazardous substances  Principles of good housekeeping  Performing commissioning activities  Performing good housekeeping",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08   TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 42 RANGE OF VARIABLES VARIABLE RANGE 1. Tools and equipment Including but not limited to: 2.1 Pliers 2.7. Rivet 2.2 Screwdrivers 2.8 Mallet 2.3 Wrenches 2.4 Wire splicers 2.5 Knives 2.6 Face shield 2. Personal protective equipment (PPE) Including but not limited to: 3.1 Working gloves 3.2 Safety shoes 3.3 Hard hat 3. Safety procedures Includes safety procedures in: 4.1 Philippine Electrical Code 4.2 Industrial safety standards 4.3 Electrical safety standards 4. Correct procedures for Installation of bus ducts and cable tray 5.1 Bus ducts - Joints between sections and fittings are accessible for maintenance purposes - Bus ducts shall be securely supported - Vertically and horizontally aligned - Dead end of busway shall be closed 5.2 Cable tray - Properly supported, aligned and spaced - Measurements referred to center of insert holes 5. Installation procedures 5.1 Horizontally and vertically aligned 5.2 No gap between plate cover and wall 5.3 Wire cut to requirement 5.4 All bolts tightened for rigid mounting",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 43 EVIDENCE GUIDE 1. Critical aspects of competency Assessment required evidence that the candidate: 1.1 Interpreted technical drawings and plans to determine job requirements 1.2 Selected appropriate tools, equipment and materials for performing rough-in and wiring activities 1.3 Selected and used correct personnel protective equipment 1.4 Demonstrated correct procedures for performing rough-in activities such as installing bus ducts, cable tray and panel 1.5 Followed safety procedures 1.6 Performed wiring works 1.7 Made final checks to ensure work completion and conforms with the working plan 2. Resource Implications The following resources should be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate to building wiring electrical installation 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3. Methods of Assessment Competency in this unit must be assessed: 3.1 Direct observation/Demonstration of application of tasks. 3.2 Questions related to underpinning knowledge 3.3 Written Test 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in a simulated workplace setting 4.2 Assessment shall be observed while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 44 UNIT OF COMPETENCY: PERFORM INSTALLATION OF DATA MEASUREMENT AND CONTROL SYSTEM ON ELECTRICAL AND AUXILIARY EQUIPMENT UNIT CODE : ELC741305 UNIT DESCRIPTOR : This unit of Core Electrical Competency covers the knowledge, skills and attitudes in installing wiring devices for power supply of data measurement and control system on electrical and auxiliary equipment such as UPS, drytype, transformer, capacitor bank AVR and rectifier based on required performance standard. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variable REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Plan and prepare for installation work 1.1 Instructions for the preparation of work activity are communicated and confirmed to ensure clear understanding 1.2 Tools, equipment and personnel protective equipment needed to electrical system and auxiliary equipment are identified and checked to ensure usability and safety in accordance with established procedures 1.3 Materials needed to do the work are obtained and estimated in accordance with established procedures and plan  Types and specification of wiring devices for data measurement and control system.  Functions and uses of power supply on data measurement system and auxiliary equipment.  Identification of tools and materials for installation of data measurement and control system on electrical and auxiliary equipment  Interpreting plans and details drawing.  Handling of materials, tools and equipment  Checking and quantifying the item needed, in the job requirement. 2. Install electrical system and auxiliary equipment 2.1 Safety procedures are followed in line with job requirements 2.2 Correct procedures for installation of electrical system and auxiliary equipment are performed in line with job requirements 2.3 Schedule of work is followed to ensure work is completed in an agreed time, to a quality standard and with a minimum of waste 2.4 Unplanned events or conditions occurred are responded to accordingly 2.5 Ongoing checks of quality of work are undertaken in accordance with instructions and requirements 2.6 Conductors/wires are terminated/spliced in accordance with electrical standards  Procedures on installation of electrical system and auxiliary equipment.  Proper used of power tools and equipment in an installation.  Splicing, dressing and harnessing of wires.  Proper termination and mounting of devices.  Proper use of safety harness  Types and uses of: o UPS o Drytype Transformer o Capacitor bank o AVR  Installing AVR and UPS  Performing splicing, dressing and harnessing of wires.  Mounting of devices.  Performing the installation economically.  Applying active and non-active test to ensure its functionality.",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 45 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variable REQUIRED KNOWLEDGE REQUIRED SKILLS o Rectifier o other metering/ central aux. equipment  PEC requirements in installation of electrical system and auxiliary equipment 3. Notify completion of work 3.1 Final checks are made to ensure that work conforms with instructions and to requirements 3.2 Completion report is prepared and submitted to appropriate officer 3.3 Tools, equipment and any surplus resources and materials are checked and monitored in accordance with established procedures 3.4 Work area is monitored as to cleanliness and safety  Procedures in checking and conforming the installation based on job requirement  Procedures in report preparation and submission  Principles of good housekeeping  Performing commissioning activities  Performing good housekeeping",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08   TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 46 RANGE OF VARIABLES VARIABLE RANGE 1. Tools and equipment 1.1 Electrical power tools 1.2 Hand tools 1.3 Multi-testers, mega-ohmmeter, clamp-on meter 2. Personal protective equipment (PPE) Includes but is not limited to: 2.1 Working gloves 2.2 Safety shoes 2.3 Hard hat 2.4 Goggles/face shield 3. Electrical system and auxiliary equipment 3.1 UPS 3.2 Drytype 3.3 Transformer 3.4 Capacitor bank 3.5 AVR 3.6 Rectifier/Frequency converter 3.7 Fire alarm system 3.8 Intercom 3.9 Digital watt meter 4. Safety procedures 4.1 Philippine Electrical Code (PEC) 4.2 Industrial safety 4.3 Electrical safety 5. Installation of electrical system and auxiliary equipment 5.1 Installed and connected as per plan 5.2 Magnetic switches installed 5.3 Conducted preliminary testing prior to commissioning",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 47 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Correctly followed work instructions 1.2 Identified and checked appropriate tools, equipment and materials for installing electrical system and auxiliary equipment 1.3 Selected and used correct personal protective equipment 1.4 Performed correct procedures for installation of electrical system and auxiliary equipment 1.5 Terminated/Spliced conductors/wires in accordance with the existing electrical standards 1.6 Made final checks to ensure work conforms with the plan 1.7 Followed safety procedures 2. Resource Implications The following resources should be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate to installation of electrical and auxiliary equipment 2.3 Materials relevant to the activity 2.4 Wiring diagrams, layout/shop drawings and specifications relevant to the task 3. Methods of Assessment Competency in this unit must be assessed: 3.1 Direct observation/Demonstration of application of tasks. 3.2 Questions related to underpinning knowledge 3.3 Written Test 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in a simulated workplace setting 4.2 Assessment shall be observed while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 48 UNIT OF COMPETENCY: INSTALL, ASSEMBLE, TEST AND MAINTAIN MOTOR CONTROL SYSTEM UNIT CODE: ELC741306 UNIT DESCRIPTOR: This unit of Core Electrical Competency covers the knowledge, skills and attitudes in installing, assembling, testing and maintaining motor control system. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variable REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Check/Review type and purpose of motor control system. 1.1. Wiring diagrams and layout/shop drawings are obtained according to job requirements 1.2. Drawings are read and interpreted in accordance with job requirements 1.3. Correct rating, quantity, sizes and type of motor control components & wiring devices and other materials are identified in line with job requirements 1.4. Correct size and degree of protection of enclosures are verified in line with job requirements 1.5. Tools, equipment and testing instruments are properly selected in line with job requirements 1.6. Correct PPE are identified and selected in line with safety requirements  Interpretation of electrical drawing and wiring diagram.  Function of every devices used in the line/job requirements  Motor specification for the selection of control devices.  NEMA Standard in mounting of MCC.  Electrical control components and devices  Safe working habits/Safety procedures  Interpreting electrical drawing and wiring diagram  Checking and quantifying items needed in the job requirement  Checking the required rating based on its specification in accordance with standard. 2. Install and assemble motor control system 2.1 Safety procedures are followed according to enterprise or based on PEC standard and requirements. 2.2 Electrical components and wiring devices are laid-out, mounted or installed according to drawings, plans, specifications and PEC standards 2.3 Electrical motor control components are wired correctly in accordance with wiring diagrams and PEC standards 2.4 Preliminary checks/tests are conducted in line/job requirements. 2.5 Work schedule is followed to ensure job is completed on time in accordance to a quality standard and minimum wastage.  Layout and dimensions of electrical drawing or wiring diagram.  Types and operation of motor control system.  Types and uses of termination either point to point termination or terminal strip.  Correct procedures in assembling motor control system  Proper procedure mounting and installation of panels/MCC.  Proper terminal connection of motor leads outs.  Interpreting the electrical wiring diagram of motor control system.  Wiring-up the required electrical control based on the standard.  Connecting and Terminating of motor terminal/leads out and the control devices.  Checking for continuity test or ohmmeter test of motor terminal",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 49 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variable REQUIRED KNOWLEDGE REQUIRED SKILLS  PEC standards - Article 4.30  Performing the installation economically. 3. Notify completion of work 3.1 Immediate superior is notified upon completion of work. 3.2 Performance tests are made to ensure that work conforms to instructions and job requirements. 3.3 Tools, equipment and any surplus materials are cleaned, checked and returned to storage in accordance with established procedures. 3.4 Waste materials and hazardous substances are disposed of in accordance with environmental rules and regulations. 3.5 Work area is cleaned up and made safe in accordance with OSHA requirements  Checked and conformed the installation based on job requirement  Principles of 5S  Proper disposal of waste materials and hazardous substances  Good housekeeping  Performing commissioning activities  Storing excess materials  Checking quality of work  Communicating skills (both written & oral) 4. Maintain electrical motor control system. 4.1 Safety policies and procedures are followed in accordance with OSH and enterprise procedures. 4.2 Materials, tools, equipment, testing devices and PPE needed are prepared for the maintenance work requirements. 4.3 Potential hazards are identified for prevention and control measures are selected in accordance with the work plan and site procedures 4.4 Routine/visual/sensory inspection is regularly conducted in line with normal operation. 4.5 Maintenance work schedule is prepared in accordance with machine/equipment operating time/condition 4.6 Work instructions are prepared according to machine’s manual and established enterprise procedures 4.7 Concerned department/personnel are informed on the schedule of work according to standard operating procedure. 4.8 Availability of maintenance records are prepared in accordance with established procedure, or based on enterprise Quality Management System (QMS).  Safety Practices in the use of PPE, handling of tools, instrument and equipment.  Types and uses of lubricants and cleaning materials  Preventive Maintenance Methods and Techniques and Procedures.  Types of potential hazards  Maintenance and troubleshooting procedures  Good housekeeping of materials, tools and equipment  Selecting prevention and/or control measures  Handling of tools, instrument and equipment.  Performing basic troubleshooting skills  Identifying failures or defects  Implementing corrective and preventive actions based on root cause of trouble  Application of maintenance procedures",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08   TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 50 RANGE OF VARIABLES VARIABLE RANGE 1. Wiring diagrams 1.1 Power circuit 1.2 Control circuit 2. Motor control components & wiring devices May include but are not limited to: 2.1 Circuit breakers/Fuses 2.2 Magnetic Contactors 2.3 Overload heater 2.4 Power Cabinet or MCC 2.5 Power and Timers Relays 2.6 Terminal Blocks/Lugs 2.7 Pilot lamps and Buzzer 2.8 Actuators 2.9 Push buttons 2.10 Selector Switches 2.11 Cable duct 2.12 Din rail 2.13 Wire Strap 2.14 Wire Markers 2.15 Cable Tie 2.16 Tie Mount 2.17 Cable Glands/Grommet 2.18 Automotive wires/ Conductors 2.19 Insulators 3. Degree of Protection 3.1 Nema Standards - Nema 1 - Nema 2 - Nema 3/3R - Nema 4/4x - Nema 6 - Nema 11 - Nema 12 3.2 IEC Standards - International Protection (IP) 3.3 Bureau of Product Standards (BPS) 4. Tools, equipment & testing instruments May include but are not limited to: 4.1 Tools - Pliers - Screw drivers - Wrenches - Wire splicers/strippers - Electrician knives - Electric Hand drill - Hand or electric taping/threading - Hack saw - File - Manual/Hydraulic puncher - Measuring tools (e.g. Push-pull meter)",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 51 VARIABLE RANGE - Crimping tools - Soldering tools - Manual/Hydraulic pipe bender - Manual/Electrical Pipe Threader/Reamer - High-speed cutter 4.2 Testing Instruments - Multi-tester - Clamp ammeter - Insulation resistance tester - Ground resistance tester - Earth leakage tester - Harmonic meter - Phase Sequence Tester 4.3 Three-Phase Motor - SCRIM - WRIM - Synchronous Motor 4.4 Single Phase Motor 5. Personal protective equipment (PPE) May include but are not limited to: 5.1 Proper working clothes 5.2 Working gloves 5.3 Safety shoes 5.4 Gas/Dust mask 5.5 Hard hat 5.6 Safety goggles 6. Specifications 6.1 Brand/Make - Classification/Type 6.2 Rating - Voltage - Current - Power - Frequency - Temperature Rise - Service factor - Degree of protection - Utilization category - Harmonics 6.3 Phase 6.4 Range (Tools must be specific) 6.5 Needed accessories 7. PEC standard and requirements 7.1 Splicing and joining of electrical conductor 7.2 Soldering electrical conductors 7.3 Solderless electrical connectors 7.4 Creepage distances 7.5 Clearances",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 52 VARIABLE RANGE 8. Preliminary Check/Tests May include but are not limited to: 8.1 Mechanical - Board/Panel properly leveled - Doors can be opened/closed with ease. Paint not easily scratched/removed - Tightness of bolts and nuts - Type of protection - Cleanliness - Cable trays 8.2 Electrical - Conductor size or Cross-section - Conductor Color Coding - Cables laid to avoid risk of short circuit - Grounding busbar conductor - Voltage Clearances/Creepage Distances - Control Voltage - High Voltage Test - Insulation Test - Continuity Test/Contact Resistance Test - Correct use of wire markers & terminals 9. Performance Tests 9.1 Simulation Test/No Load Test 9.2 Phase sequence 9.3 Actual Operation 9.4 Temperature rise 9.5 Insulation Resistance Test 10. Materials May include but not limited to: 10.1 Contact cleaner 10.2 Insulating varnish/materials 10.3 Carbon brushes 10.4 Sand paper 10.5 Waste rugs 10.6 Electrical tapes 10.7 Warning tags 10.8 Signages 10.9 Lockout/tagout 10.10 Lubricants 10.11 Motor cleaner 10.12 Insulating oil 10.13 Coolant",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08   TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 53 VARIABLE RANGE 11. Tools, equipment and testing devices Including but not limited to: 11.1 Electrician’s hand tools - Pliers - Screwdrivers - Wrenches - Wire splicers - Knives - Bolt/Cable cutter - Knockout puncher - Torque wrench 11.2 Testing instruments/devices - Multi-tester (VOM) - Insulation resistance tester (Megger) - High potential tester - Low resistance tester - Phase sequence meter - Ammeter - Torque meter 11.3 Equipment - Labeling machine - Vacuum cleaner - Air blower - Dryer - Welding machine - Pressure washer - Vacuum pump 12. Personal protective equipment (PPE) Including but not limited to: 12.1 Working gloves 12.2 Safety shoes 12.3 Hard hat 12.4 Face shield 12.5 Insulating mat 12.6 Lockout tags 12.7 Safety goggles 12.8 Safety belt 12.1 Safety ladder 13. Potential hazards Including but not limited to: 13.1 Live wires 13.2 Oil spill 13.3 Chemical hazards 13.4 Flammable materials 13.5 Sources of energy 13.6 Moving machine parts 13.7 Sharp/pointed objects 13.8 Noise hazards 13.9 Confined space",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08   TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 54 VARIABLE RANGE 14. Maintenance records May include but are not limited to: 14.1 Electrical plans 14.2 Equipment electrical diagrams 14.3 Historical records - Job orders - Commissioning test record - Preventive Maintenance schedules - Corrective Maintenance records - Manufacturer’s maintenance guides - Equipment breakdown records - Periodic monitoring data - Service reports 14.4 Log book 15. Quality Management System 15.1 ISO 9001 15.2 QS 9000 15.3 TS 16949 15.4 ISO 14000 15.5 ISO14001",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01 - F08 TR – Electrical Installation and Maintenance NC III (Amended) Promulgated December 16, 2015 55 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Checked/Reviewed type and purpose of motor control system 1.2 Installed and assembled motor control system. 1.3 Notified completion of work 1.4 Maintained electrical motor control system 2. Resource Implications The following resources should be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate to assembly of electrical control system 2.3 Materials relevant to the activity 2.4 Wiring diagrams, layout/shop drawings and specifications relevant to the task 3. Methods of Assessment Competency in this unit must be assessed through: 3.1 Direct observation/demonstration of application of tasks 3.2 Questions or interview related to underpinning knowledge 3.3 Written Test (about symbols) 4. Context for Assessment 4.1 Competency may be assessed in the workplace – to observe/check workmanship, correct function of work, length of time in doing the work 4.2 Assessment shall be observed while the tasks are being undertaken either individually or as part of a team under limited supervision",
                "metadata": {
                    "source": "datasets\\raw\\Electrical Installation and Maintenance NC III.pdf",
                    "page": 58
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Electronics Products Assembly and Servicing NC II",
        "core_competencies": [
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 38 CORE COMPETENCIES UNIT OF COMPETENCY: ASSEMBLE ELECTRONIC PRODUCTS UNIT CODE: ELC724 335 DESCRIPTON: This unit covers the knowledge, skills and attitudes required to assemble electronic products and systems for consumer/industrial uses/applications. It consist of competencies in identifying and preparing electronic components and circuits, preparing/making printed circuit board (PCB) modules, mounting and soldering of components, assembling electronic products and performing mechanical and electrical/electronic tests. ELEMENTS PERFORMANCE CRITERIA (Italicized bold terms are elaborated in the range of variables) 1. Prepare to assemble electronic products 1.1 Assembly workplace is prepared in accordance with OH&S policies and procedures 1.2 Established risk control measures for work preparation are followed. 1.3 Work instructions are obtained and clarified based on job order or client requirements 1.4 Responsible person is consulted for effective and proper work coordination 1.5 Required materials, tools and equipment are prepared and checked in accordance with established procedures 1.6 Parts and components needed to complete the work are identified, prepared and obtained according to requirements 2. Prepare/Make PCB modules 2.1 PCB layout is verified for conformity with the schematic diagram in accordance with the layout rules 2.2 PCB layout is transferred to copper-cladded board following acceptable methods and standards 2.3 Visual inspection is performed based on standards procedures. 2.4 Thru-hole is drilled based on standards procedures 2.5 PCB is cleaned based on standards procedures 2.6 Functionality of PCB is tested and visual inspection is performed based on standards procedures 3. Mount and solder electronic components 3.1 Knowledge of lead and lead-free soldering characteristics and requirements are applied to mounting and soldering process in accordance with OH&S standards 3.2 Components are mounted and soldered in accordance with soldering principles. 3.3 Soldering/Desoldering techniques and procedures are applied in accordance with established standards and requirements. 3.4 Soldered products are checked and complied with international standards and task specifications 4. Perform electronic products assembly 4.1 Work instructions is followed based on job order or client requirements 4.2 Assembly procedures are performed in accordance with OH&S policies and work instructions 4.3 Modules and accessories are connected/integrated into the final product based on the client specifications",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 39 ELEMENTS PERFORMANCE CRITERIA (Italicized bold terms are elaborated in the range of variables) 4.4 Excess components and materials are disposed of based on WEEE directives and 3Rs waste management program. 5. Test and inspect assembled electronic products 5.1 Finished products are subjected to final visual/sensory inspection and testing in accordance with quality standards, procedures and requirements 5.2 Mechanical and electrical/electronic testing is performed in accordance with quality standards, procedures and requirements 5.3 Work completion is documented and responsible person is informed in accordance with established procedures 5.4 Housekeeping procedures are observed in accordance with 5S discipline and established procedures",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 40 RANGE OF VARIABLES VARIABLE RANGE 1. OH&S policies and procedures Arrangements of enterprise to meet their legal and ethical obligations in ensuring the workplace is safe and without risk to health. This may include: 1.1 Hazard and risk assessment mechanisms 1.2 Implementation of safety regulations 1.3 Safety training 1.4 Safety systems incorporating: 1.4.1 Work clearance procedures 1.4.2 Isolation procedures 1.4.3 Gas and vapor 1.4.4 Monitoring/testing procedures 1.4.5 Use of protective equipment and clothing 1.5 Use of codes of practice 1.5.1 Philippine Electronics Code 2. Responsible person 2.1 Immediate supervisor 2.2 Manager 3. Materials, tools and equipment May include: 3.1 Variable power supply 3.2 Variable transformer 3.3 Soldering iron 3.4 Hot air soldering station 3.5 Table top reflow oven 3.6 Desoldering tools 3.7 Screwdriver (assorted) 3.8 Wrenches (assorted) 3.9 Allen wrench/key 3.10 Function /Signal generator 3.11 Multi - testers (analog/digital) 3.12 Utility knife/stripper 3.13 Pliers (assorted) 3.14 ESD - free work bench with mirror 3.15 Oscilloscope, digital 3.16 High - grade magnifying glass with lamp 3.17 Flashlight/headlamp 3.18 Cleaning brush 3.19 Soldering wire 3.20 SMD soldering paste 3.21 Stranded/solid/hook - up wires 3.22 Assorted electronic components 3.23 Assorted electronic sensors 4. Layout rules 4.1 EMI 4.2 EMC 5. Acceptable methods 5.1 silk screen 5.2 photo transfer 6. Mounting of components 6.1 Surface mount 6.2 Thru - hole mount 6.3 Socket mount 7. Soldering principles The four key principles to producing a good joint are: 7.1 Ensure the joint surfaces are clean and free from grease. 7.2 Ensure the temperature of the solder when making the joint is correct. 7.3 Ensure the heat is applied to the joint for the correct amount of time 7.4 Ensure the correct amount of solder is used. 8. Soldering / Desoldering procedures 8.1 Hot iron soldering procedures 8.2 Hot air soldering procedures 9. Assembly procedures 9.1 Prepare supplies, materials and equipment 9.2 Familiarize with the diagram and the product 9.3 Perform assembly 9.4 Check the assembled product 10. Testing 10.1 Aging test 10.2 Substitution test 10.3 Mechanical testing",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 41 EVIDENCE GUIDE 1 Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Prepared electronics components for assembly 1.2 Prepared/Made printed circuit board modules 1.3 Mounted and soldered electronic components 1.4 Assembled electronic components 1.5 Tested and inspected assembled electronic products 1.6 Applied safety rules and procedures 2 Required knowledge and attitude 2.1 Mensuration/Mathematics 2.1.1 Conversion of Units 2.1.2 Applied Mathematics 2.2 Environmental Safety 2.2.1 Work Safety requirements and economy of materials with durability 2.2.2 Knowledge in 5S application and observation of required timeframe 2.2.3 Knowledge of proper handling and disposal of chemicals 2.2.4 Safety handling of hand tools 2.2.5 Practicing 3Rs – reduce, re-use, recycle/recover 2.2.6 Managing waste from electrical and electronic equipment (WEEE) 2.3 Materials, tools and equipment uses and specifications 2.3.1 Identification of hand and power tools 2.3.2 Proper care and use of tools 2.4 Theories and Principles 2.4.1 PCB problems and solutions 2.4.2 Surface mount components and devices 2.4.3 Through-hole mount components and devices 2.4.4 PCB characteristics 2.4.5 Methods of soldering 2.4.6 Design compliance with EMI / EMC 2.4.7 Component layout and grounding 2.4.8 Thermal and vibration theories 2.4.9 Environmental control 2.4.10 Manufacturing - PCB Manufacturing Information - PCB Layout and Artwork 2.4.11 Fabrication - Blanking, Cutting, Punching, Drilling - Laminating Techniques - Plating, Etching, Surface Finishing - Coatings 2.4.12 Assembly - Proper care and use of tools - Component - Soldering Technology i. Reflow soldering ii. Wave soldering iii. Hand soldering iv. RoHS and lead-free soldering - Nonsolder Connections (terminal block",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II\nPage 42\n- Cleaning\n- Repair and Rework\n- Safety\n- ESD protection\n2.4.13 Testing of electronic products\n2.5 3Rs waste management programs\n2.6 Rules and conventions\n2.6.1 Philippine Electronics Code\n2.6.2 RoHS/WEEE Directives\n2.6.3 RA 9292 – ECE Law\n3 Required skills\n3.1 assembling electronic products\n3.2 Using and maintaining test instruments, tools, & equipment\n3.3 splicing/joining wires\n3.4 PCB preparation skills\n3.5 Proper soldering/desoldering skills\n3.6 Component testing\n3.7 mounting various types of electronic components\n3.8 Work safety practices and time management\n3.9 interpreting schematic/block diagrams\n4 Method of assessment\nCompetency may be assessed through two or more of the following methods:\n4.1 Practical Demonstration w/ oral questioning\n4.2 Interview\n4.3 Portfolio\n5 Resource implications\nThe following resources must be provided:\n5.1 Tools and equipment (see range of variables)\n5.2 Working area/bench\n5.3 PC with computer-aided design (CAD) software and printer PCBs\n5.4 electronic components/supplies\n5.5 diagrams and other references\n5.6 Assessment rating sheet\n5.7 Reporting forms\n6 Context of assessment\n6.1 Assessment maybe conducted in the workplace or in a simulated workplace setting",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 43 UNIT OF COMPETENCY: SERVICE CONSUMER ELECTRONIC PRODUCTS AND SYSTEMS UNIT CODE: ELC724 336 DESCRIPTION: This unit covers the knowledge, skills and attitudes required to install and service consumer electronic products and systems. It includes competencies in installing, maintenance and repairing audio-video products/systems and domestic electronic appliances and home security system. ELEMENT PERFORMANCE CRITERIA (Italicized bold terms are elaborated in the range of variables) 1. Prepare unit, tools and workplace for installation and service 1.1 Complete check-up of consumer electronic products and systems is conducted and defects are identified, verified and documented against customer description. 1.2 Manuals and service information required for installation are acquired as per standard procedure. 1.3 Repair/maintenance history is verified in line with the company procedures. 1.4 Workplace is set/prepared for installation job in line with the client’s requirements. 1.5 Necessary tools, test instruments and personal protective equipment are prepared in line with job requirements 2. Install consumer electronic products and systems 2.1 Materials necessary to complete the work are obtained in accordance with job requirements. 2.2 Consumer electronic products and systems are installed in accordance with manufacturer’s instructions, requirements, and without damage to the surrounding place or environment 2.3 Devices are tested in accordance with standard procedures. 2.4 Final inspections are undertaken to ensure that the installed devices conform to technical requirements. 2.5 Unplanned events or conditions are responded to in accordance with established procedures 2.6 Work site is cleaned and cleared of all debris and left safe in accordance with the company requirements 2.7 Report on installation and testing of equipment is prepared according to company’s procedures/policies. 3. Diagnose faults and defects of consumer electronic products and systems 3.1 Systematic pre-testing procedure is observed in accordance with manufacturer’s instructions. 3.2 System defects/Fault symptoms are identified using appropriate tools and equipment and troubleshooting techniques and in accordance with safety procedures 3.3 Test instruments required for the job are used in accordance with user manuals. 3.4 Circuits are checked and isolated using specified testing procedures 3.5 Identified defects and faults are explained to the responsible person in accordance with enterprise or company policy and procedures 3.6 Control settings/adjustments are checked in conformity with service-manual specifications. 3.7 Results of diagnosis and testing are documented accurately and completely within the specified time. 3.8 Customers are advised/informed regarding the status and serviceability of the unit according to procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 44 ELEMENT PERFORMANCE CRITERIA (Italicized bold terms are elaborated in the range of variables) 4. Maintain/Repair consumer electronic products 4.1 Personal protective equipment is used in accordance with Occupational Health and Safety practices. 4.2 Electro-static discharge (ESD) protection procedure is followed in accordance with current industry standards. 4.3 Defective parts/components are replaced with identical or recommended appropriate equivalent ratings 4.4 Repaired or replaced parts/components are soldered/mounted in accordance with the current industry standards. 4.5 Control settings/adjustments are performed in conformity with service-manual specifications 4.6 Repair activity is performed within the required timeframe 4.7 Care and extreme precaution in handling the unit/product is observed as per procedures 4.8 Cleaning of unit is performed in accordance with standard procedures 4.9 Excess components and materials are disposed of based on WEEE directives and 3Rs waste management program 5. Re-assemble and test repaired consumer electronic product 5.1 Repaired units are reassembled according to procedures 5.2 Reassembled units are subjected to final testing and cleaning in conformity with manufacturer’s specifications 5.3 Service completion procedures and documentations are complied with based on manual. 5.4 Waste materials are disposed of in accordance with environmental requirements.",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 45 RANGE OF VARIABLES VARIABLE RANGE 1. Consumer electronic products and systems 1. Audio-Video products and systems include -- 1.1 Radio receivers 1.2 Audio recorders 1.3 Videoke systems 1.4 Electronic musical instruments/keyboards 1.5 DVD/VCD Player 1.6 Professional audio/Public-address (PA) systems 1.7 Television 1.7.1 Home 1.7.2 Portable 1.8 Home theater system 1.9 PC Monitors 2. Domestic Electronic Appliances include -- 2.1 Electronic-controlled Washing Machines 2.2 Home Food Processing equipment 2.3 Microwave Oven 2.4 Electronic Clock 2.5 Rechargeable Light 2.6 Electronic-controlled Light 2.7 Home security equipment 2.8 Induction stove 2.9 Solar-powered management system 2. Service manuals 2.1. Service manual/schematic diagram/parts list 2.2. Operating instructions/User’s/Owner’s manual 3. Service Information 3.1. Job Report Sheets 3.2. Job Order 3.3. Bill of materials 3.4. Customer index 3.5. Service flowchart 3.6. Stock and inventory record 3.7. Requisition slips (for acquisition of parts) 3.8. Supplier Index 4. Tools, Materials and Test Instruments May include: 4.1 Variable power supply 4.2 Variable transformer 4.3 Soldering iron 4.4 Hot air soldering station 4.5 Table top reflow oven 4.6 Desoldering tools 4.7 Screwdriver (assorted) 4.8 Wrenches (assorted) 4.9 Allen wrench/key 4.10 Function generator 4.11 Multi-testers (analog/digital) 4.12 Utility knife/stripper 4.13 Pliers (assorted) 4.14 ESD-free work bench with mirror 4.15 Test jigs 4.16 Oscilloscope, digital 4.17 High-grade magnifying glass with lamp 4.18 Flashlight/headlamp 4.19 Cleaning brush 4.20 Soldering wire 4.21 SMD soldering paste 4.22 Stranded/solid/hook-up wires 4.23 Assorted electronic components",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 46 VARIABLE RANGE 5. Pre-testing procedures 5.1. Visual inspection of the unit with power off 5.2. Interview of customer re history of unit 5.3. Operate the unit according to manual to confirm defects 6. Troubleshooting techniques May include: 6.1 sensory methods Visual checks Listening for telltale sounds Lookout for unusual smells Touching or feeling 6.2 Component substitution 6.3 Signal injection and tracing 6.4 Voltage and current measurement 6.5 Continuity/resistance testing 6.6 Waveform analysis 6.7 Display analysis (for video displays) 6.8 Circuit analysis 7. Responsible persons 7.1. Immediate supervisor 7.2. Service supervisor/manager 8. Environmental Requirements 8.1. Proper disposal of chemicals and components shall be based on existing requirements of the law and chemical waste management 8.2. Non-biodegradable parts or materials shall be packed and labeled properly for disposal. 8.3. WEEE requirements",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 47 EVIDENCE GUIDE 1 Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Prepared the unit and required materials, tools equipment and workplace properly for installation and service. 1.2 Installed consumer electronic products and systems 1.3 Diagnosed faults and defects 1.4 Maintained/Repaired consumer electronic products 1.5 Re-assembled and tested repaired consumer electronic product 1.6 Applied safety rules and procedures 2 Required knowledge and attitude 2.1 Mensuration/Mathematics 2.1.1 Conversion of units 2.1.2 Applied mathematics 2.2 Drawing and Schematic Diagram 2.2.1 Reading and interpreting orthographic projections and isometric views 2.2.2 Reading and interpreting electronic schematic symbols and diagram 2.3 Environmental Safety 2.3.1 Work Safety requirements and economy of materials with durability 2.3.2 Knowledge in 5S application and observation of required procedure 2.3.3 Practicing 3Rs – reduce, re-use, recycle/recover 2.3.4 Managing waste from electrical and electronic equipment (WEEE) 2.4 Materials, tools/instruments & equipment uses and specifications 2.4.1 Identification of hand and power tools 2.4.2 Proper care and use of tools 2.4.3 Identification of test and measuring instruments 2.4.4 Proper care and use of test and measuring instruments 2.5 System and Processes 2.5.1 Principles of electrical circuits 2.5.2 Fundamentals of direct current circuits 2.5.3 Fundamentals of alternating current circuits 2.5.4 Fundamentals of electronic components and circuits 2.5.5 Fundamentals of digital logics, components & circuits 2.5.6 Fundamentals of microprocessor circuits and programming 2.5.7 Analysis of troubles and isolation techniques 2.5.8 Principles of sound and acoustics 2.5.9 Fundamentals of audio amplifiers 2.5.10 Fundamentals of audio source & noise reduction system 2.5.11 Fundamentals of AM & FM Receivers 2.5.12 Principles of vision and color 2.5.13 Fundamentals of color television 2.5.14 Fundamentals of video sources & noise reduction system 2.6 Theories and Principles 2.6.1 AM transmission and reception 2.6.2 FM transmission and reception 2.6.3 Analog TV transmission and reception",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 48 2.6.4 Digital HDTV transmission and reception 2.6.5 Audio Video sources and formats 2.6.6 Pulse Code Modulation 2.6.7 Home theater system 2.6.8 Digital noise reduction system 2.6.9 CCTV system 2.6.10 Infrared remote control system 2.6.11 Motor and motor control system 2.6.12 LED and lighting system 2.6.13 Heat and heating control system 2.6.14 Solar cell and battery management system 2.6.15 Microcontroller 2.6.16 Microcontroller interfacing 2.7 Consumer electronic products and systems installation procedures 2.8 Systematic pre-testing procedures 2.9 System defects/Fault symptoms 2.10 Mechanical and electrical/electronic testing 2.11 Commissioning procedures 2.12 3Rs waste management programs 2.13 Rules and conventions 2.13.1 Philippine Electronics Code 2.13.2 RoHS/WEEE Directives 2.13.3 RA 9292 – ECE Law commissioning procedures 3 Required skills 3.1 Application of troubleshooting technique 3.2 Using and maintaining test instruments, tools, & equipment 3.3 Application of work safety practices and time management 3.4 Application of substitution technique 3.5 Soldering/desoldering and wiring/cabling techniques 3.6 Schematic diagram reading skills 4 Method of assessment Competency may be assessed through: 4.1 Practical Demonstration w/ oral questioning 4.2 Interview 4.3 Portfolio 5 Resource implications The following resources must be provided: 5.1 Tools, equipment and test instruments 5.2 Needed audio-video products and systems 5.3 Needed consumer appliances 5.4 Service manuals/schematics 5.5 ESD free working area/bench 5.6 Needed electronic spare parts/supplies 6 Context of assessment 6.1 Assessment maybe conducted in the workplace or in a simulated workplace setting",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 49 UNIT OF COMPETENCY: SERVICE INDUSTRIAL ELECTRONIC MODULES, PRODUCTS AND SYSTEMS UNIT CODE: ELC724 337 DESCRIPTION: This unit covers the knowledge, skills and attitudes required to install and service industrial electronic modules, products and systems. It consists of competencies in installing, troubleshooting, maintenance and repairing industrial electronic modules, products and systems. ELEMENT PERFORMANCE CRITERIA (Italicized bold terms are elaborated in the range of variables) 1. Prepare unit, tools and workplace for installation/servicing 1.1 Complete check-up of industrial electronic components, products and systems is conducted and defects are identified, verified and documented against customer description. 1.2 Repair/maintenance history is verified in line with the company procedures. 1.3 Service manuals and service information required for repair/maintenance are acquired as per standard procedure. 1.4 Workplace is set/prepared for repair job in line with the company requirements. 1.5 Necessary tools, test instruments and personal protective equipment are prepared in line with job requirements 2. Install industrial electronic modules/products/systems 2.1 Materials necessary to complete the work are obtained in accordance with job requirements. 2.2 Industrial electronic modules/products/systems are installed in accordance with manufacturer’s instructions, requirements, and without damage to the surrounding place or environment 2.3 Devices are tested in accordance with standard procedures. 2.4 Final inspections are undertaken to ensure that the installed devices conforms to technical requirements. 2.5 Unplanned events or conditions are responded to in accordance with established procedures 2.6 Work site is cleaned and cleared of all debris and left safe in accordance with the company requirements 2.7 Report on installation and testing of equipment is prepared according to company’s procedures/policies. 3. Diagnose faults and defects of industrial electronic modules/products/systems 3.1 Systematic pre-testing procedure is observed in accordance with manufacturer’s instructions. 3.2 System defects/Fault symptoms are identified using appropriate tools and equipment and troubleshooting techniques and in accordance with safety procedures 3.3 Test instruments required for the job are used in accordance with user manuals. 3.4 Circuits are checked and isolated using specified testing procedures 3.5 Identified defects and faults are explained to the responsible person in accordance with enterprise or company policy and procedures 3.6 Control settings/adjustments are checked in conformity with service-manual specifications. 3.7 Results of diagnosis and testing are documented accurately and completely within the specified time. 3.8 Customers are advised/informed regarding the status and serviceability of the unit according to procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 50 ELEMENT PERFORMANCE CRITERIA (Italicized bold terms are elaborated in the range of variables) 4. Maintain/Repair industrial electronic products 4.1 Personal protective equipment is used in accordance with Occupational Health and Safety practices. 4.2 Electro-static discharge (ESD) protection procedure is followed in accordance with current industry standards. 4.3 Defective parts/components are replaced with identical or recommended appropriate equivalent ratings 4.4 Repaired or replaced parts/components are soldered/mounted in accordance with the current industry standards. 4.5 Control settings/adjustments are performed in conformity with service-manual specifications 4.6 Repair activity is performed within the required timeframe 4.7 Care and extreme precaution in handling the unit/product is observed as per OHS procedures 4.8 Cleaning of unit is performed in accordance with standard procedures 4.9 Excess components and materials are disposed of based on WEEE directives and 3Rs waste management program. 5. Reassemble and test repaired industrial electronic products 5.1 Repaired units are reassembled according to procedures 5.2 Reassembled units are subjected to final testing and cleaning in conformity with manufacturer’s specifications 5.3 Service completion procedures and documentations are complied with based on manual. 5.4 Waste materials are disposed of in accordance with environmental requirements.",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 51 RANGE OF VARIABLES VARIABLE RANGE 1. Industrial electronics products and systems include -- 1.1 Industrial Electronic Components 1.2 Industrial Electronic Product * 1.2.1 Control boards and modules 1.2.2 Motor controllers and drives 1.2.3 Sensors and input devices 1.2.4 Actuators and output devices 1.2.5 Opto-electronics equipment and devices * NOTE: Only the electronics portion of the products and/or systems is covered in this unit of competency. 2. Service manuals 2.1 Service manual/schematic diagram/parts list 2.2 Operating instructions/User’s/Owner’s manual 3. Service Information 3.1 Job Report Sheets 3.2 Job Order 3.3 Bill of materials 3.4 Customer index 3.5 Service flowchart 3.6 Stock and inventory record 3.7 Requisition slips (for acquisition of parts) 3.8 Supplier Index 4. Tools, Materials and Test Instruments May include but not limited to: 4.1 Variable power supply 4.2 Step-down transformer 4.3 Soldering iron/gun 4.4 Desoldering tools 4.5 Screwdriver (assorted) 4.6 Wrenches (assorted) 4.7 Allen wrench/key 4.8 Signal generator - AF/RF 4.9 Multi-testers (analog/digital) 4.10 Utility knife/stripper 4.11 Pliers (assorted) 4.12 Test jig 4.13 ESD-free work bench with mirror 4.14 Oscilloscope 4.15 High-grade magnifying glass with lamp 4.16 Flashlight 4.17 Cleaning brush 4.18 High voltage probe 4.19 Ball peen hammer 4.20 Soldering lead 4.21 Wires 4.22 Assorted industrial electronic components 5. Personal protective equipment May include but not limited to: 5.1 Working clothes/Apron 5.2 Hand gloves 5.3 Face/Dust Mask 5.4 Goggles",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 52 VARIABLE RANGE 6. Pre - testing procedures 6.1 Visual inspection of the unit with power off 6.2 Interview of customer re history of unit 6.3 Operate the unit according to manual to confirm defects 7. Troubleshooting techniques May include: 7.1 Sensory methods  Visual checks  Listening for telltale sounds  Lookout for unusual smells  Touching or feeling 7.2 Component substitution 7.3 Signal injection and tracing 7.4 Voltage and current measurement 7.5 Continuity/resistance testing 7.6 Waveform analysis 7.7 Display analysis (for video displays) 7.8 Circuit analysis 8. Responsible persons 8.1 Immediate supervisor 8.2 Service supervisor/manager 9. OHS requirements in accordance with legislation & regulations 9.1 Use of proper tools and equipment 9.2 Observe workplace environment and safety 9.3 Adherence to safety requirements in handling the unit 9.4 Use of protective device/shields 9.5 Philippine Electronics Code 10. Environmental Requirements 10.1 Proper disposal of chemicals and components shall be based on existing requirements of the law and chemical waste management 10.2 Non - biodegradable parts or materials shall be packed and labeled properly for disposal.",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 53 EVIDENCE GUIDE 1 Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Prepared unit, tools and workplace for installation/servicing 1.2 Installed industrial electronics systems/products 1.3 Diagnosed faults of industrial electronics systems/products 1.4 Maintained/Repaired industrial electronics products 1.5 Reassembled and tested repaired industrial electronics products 1.6 Applied safety rules and procedures 2 Required knowledge and attitude 2.1 Mensuration/Mathematics 2.1.1 Conversion of units 2.1.2 Applied mathematics 2.2 Drawing and Schematic Diagram 2.2.1 Reading and interpreting orthographic projections and isometric views 2.2.2 Reading and interpreting electronic schematic symbols and diagram 2.3 Environment and Safety 2.3.1 Work Safety requirements and economy of materials with durability 2.3.2 Knowledge in 5S application and observation of required procedure 2.3.3 Practicing 3Rs – reduce, re-use, recycle/recover 2.3.4 Managing waste from electrical and electronic equipment (WEEE) 2.4 Materials, tools/instruments & equipment uses and specifications 2.4.1 Identification of hand and power tools 2.4.2 Proper care and use of tools 2.4.3 Identification of test and measuring instruments 2.4.4 Proper care and use of test and measuring instruments 2.5 Theories and Principles 2.5.1 Differential amplifiers 2.5.2 Analog to digital conversion 2.5.3 Digital to analog conversion 2.5.4 Solenoid Actuators 2.5.5 Solid state relay 2.5.6 LED 2.5.7 Light sensor 2.5.8 Lighting control system 2.5.9 Temperature control system 2.5.10 Temperature sensor 2.5.11 Voltage and current control system 2.5.12 Voltage/frequency and frequency conversion 2.5.13 Timers 2.5.14 Time control system 2.5.15 Liquid level control system 2.5.16 Optical sensor 2.5.17 Fiber optic cable 2.5.18 Fiber optic diode (tx and rx) 2.5.19 Optical and touch control system 2.5.20 Hall sensor 2.5.21 Encoder/decoder 2.5.22 DC/AC and brushless motor 2.5.23 Stepping and servo motor",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TRAINING REGULATIONS – ELECTRONIC PRODUCTS ASSEMBLY AND SERVICING NC II Page 54 2.5.24 Pulse Width Modulation 2.5.25 Rotation control system 2.5.26 Acoustic sensor 2.5.27 Acoustic control system 2.5.28 Teaching pendant 2.5.29 Basic Robotic principles 2.5.30 Ultrasonic sensor (tx and rx) 2.5.31 Ultrasonic control system 2.5.32 Infrared sensor 2.5.33 Motion sensor 2.5.34 Infrared control system 2.5.35 Strain gage 2.5.36 Pressure sensor 2.5.37 Pressure control system 2.5.38 Microcontroller 2.5.39 Microcontroller interfacing 2.6 3Rs waste management programs 2.7 Consumer electronic products and systems installation procedures 2.8 Systematic pre - testing procedures 2.9 System defects/Fault symptoms 2.10 Mechanical and electrical/electronic testing 2.11 Rules and conventions 2.11.1 Philippine Electronics Code 2.11.2 RoHS /WEEE Directives 2.11.3 RA 9292 – ECE Law Commissioning procedures 3 Required skills 3.1 Application of troubleshooting technique 3.2 Using and maintaining test instruments, tools, & equipment 3.3 Application of work safety practices and time management 3.4 Application of substitution technique 3.5 Soldering/desoldering and wiring/cabling techniques 3.6 Schematic diagram reading skills 4 Method of assessment Competency may be assessed through: 4.1 Practical Demonstration w/ oral questioning 4.2 Interview 4.3 Portfolio 5 Resource implications The following resources must be provided: 5.1 Tools, equipment and test instruments 5.2 Access to Industrial electronic products and systems and work environment, e.g. 5.2.1 Control boards and modules 5.2.2 Motor controllers and drives 5.2.3 Sensors and input devices 5.2.4 Actuators and output devices 5.2.5 Opto - electronics equipment and devices 5.2.6 Data communication systems 5.2.7 Microcontroller - based equipment 5.3 Service manuals/schematics 5.4 ESD free working area/bench 5.5 Complete electronic spare parts/supplies 6 Context of assessment 6.1 Assessment maybe conducted in the workplace or in a simulated workplace setting",
                "metadata": {
                    "source": "datasets\\raw\\Electronics Products Assembly and Servicing NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Events Management Services NC III",
        "core_competencies": [
            {
                "page_content": "42 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 CORE COMPETENCIES EVENT PLANNING SERVICES UNIT OF COMPETENCY: PLAN AND DEVELOP EVENT PROPOSAL OR BID UNIT CODE: TRS342315 UNIT DESCRIPTOR: This unit covers the knowledge, skills, behavior and motivations required to plan and develop proposals and bids for the staging of meetings and events. Depending on the context, this role could be performed by a wide range of individuals including event managers, local or regional tourism managers, venue managers and marketing managers. ELEMENT PERFORMANCE CRITERIA Bold and italicized terms are elaborated in the Range of Variables 1. Interpret event brief 1.1 Contents of the event brief are accurately interpreted and the company’s capacity to meet stated requirements is assessed. 1.2 Action required for the development of the proposal or bid is identified and planned. 1.3 Liaison with customer is undertaken to clarify requirements when appropriate. 2. Develop proposal and bid details 2.1 Details for inclusion in the proposal/bid are developed after consultation with suppliers and other relevant agencies. 2.2 Options to meet and, where possible, exceed the expectations of the customer are developed, including integration of current and emerging technology. 2.3 Possible competitors are evaluated and strategies to address competitive issues are developed. 3. Develop bid materials 3.1 Bid materials are prepared within the designated timelines in accordance with the requirements of the brief. 3.2 Materials are presented in a format that maximizes the use of presentation and promotional techniques.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "43 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 ELEMENT PERFORMANCE CRITERIA Bold and italicized terms are elaborated in the Range of Variables 4. Submit or present the bid or proposal on time 4.1 The proposal/bid is delivered within the prescribed timeline. 4.2 Proposal/bid presentation is conducted with maximum visual/retention impact.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "44 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 RANGE OF VARIABLES VARIABLE RANGE 1. Details May include but are not limited to: 1.1 General concepts and themes 1.2 Business program / Conference program 1.3 Social program 1.4 Costs 1.5 Touring (Pre - and post - tours, spouse program) 1.6 Accommodation 1.7 Entertainment 1.8 Staging 1.9 Special features 1.10 Sample promotional materials 1.11 References and details of other successful undertakings 1.12 Company information (e.g. structure, personnel) 1.13 Support statements, endorsement from previous clients 1.14 Approach to environmental impacts and issues 1.15 Proposals relating to use of technology",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "45 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidences that the candidate: 1.1 Demonstrated ability to undertake the proposal/bidding process for a specific meeting/event, including effective assessment of the event brief, coordination of all details and resources to meet the bid requirements and professional presentation of bid materials and documents. 1.2 Demonstrated knowledge of typical bid/proposal requirements and formats. 2. Underpinning knowledge 2.1 Components required for meeting/event proposals and bids and product knowledge in relation to those components 2.2 Networks and interrelationships of different industry sectors in relation to meeting/event proposal/bids 2.3 Presentation techniques for proposal and bid materials, including current technology 3. Underpinning skills 3.1 Assessing quotes and product information from suppliers to make an effective selection 3.2 Creating an effective presentation format for the bid document 3.3 Allocating responsibilities to team members and monitoring progress on bid preparations 3.4 Running team meetings to monitor progress 3.5 Making cost estimates for inclusion in the bid document 3.6 Creating a proposal from scratch within an extremely short timeframe 3.7 Designing an animated computer presentation 4. Resource implications The following resources MUST be provided: 4.1 Bid documents, event brief and/or case studies relevant to events planning and bidding 4.2 Office equipment and materials, including equipment for oral and visual presentations 4.3 Liaison with the customer and potential suppliers",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "46 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 5. Methods of assessment Competency may be assessed through: 5.1 Oral questioning or interview 5.2 Review of portfolios of evidence of on-the-job performance by the candidate 5.3 Third-party workplace reports of on-the-job performance by the candidate 6. Context for assessment 6.1 Competency assessment may occur in the workplace or any appropriately simulated environment 6.2 Assessment may be performed on multiple occasions involving a combination of direct, indirect, and supplementary forms of evidence.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "47 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 UNIT OF COMPETENCY: DEVELOP AN EVENT CONCEPT UNIT CODE: TRS342316 UNIT DESCRIPTOR: This unit covers the knowledge, skills, behavior and motivations required to develop the overall concept, theme and format for a major event comprising multiple components. An event manager would generally undertake this process at the commencement of the event management cycle in consultation with the stakeholders, including PR/advertising people. Sometimes the concept development phase is undertaken as part of the bidding process. ELEMENT PERFORMANCE CRITERIA Bold and italicized terms are elaborated in the Range of Variables 1. Identify overall event objectives and scope 1.1. Key objectives and components of the event are identified, clarified and agreed in consultation with the stakeholder. 1.2. Key information is analyzed and stakeholders are consulted to determine the scope of the event. 1.3. Internal and external factors which may impact on the event are analyzed. 2. Establish event concept theme and format 2.1. Overall event concept, theme and format are developed which reflect key objectives and meet the needs of the potential audience. 2.2. Creative elements are incorporated into the event concept and theme. 2.3. Operational practicality and cohesiveness of the concept, theme and format are verified through consultation and analysis. 2.4. Summary of key logistical requirements is developed based on the overall concept, theme and format. 2.5. Accurate and complete information on the concept, theme, and format are provided to all relevant stakeholders to facilitate timely and effective planning and implementation. 2.6. Approval from relevant stakeholders is obtained prior to implementation.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "48 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 RANGE OF VARIABLES VARIABLE RANGE 1. Key objectives and components of the event May include but are not limited to: 1.1 Multiple contractors 1.2 Substantial catering (not simply afternoon snacks) 1.3 Multiple speakers, performers or exhibitors 1.4 Requirement for display, decoration or theming 2. Stakeholder May include but is not limited to: 2.1 Event principal 2.2 Local community 2.3 Organizing committees 2.4 Local authorities 2.5 Customers 2.6 Colleagues 2.7 Staging contractors 2.8 Entertainers 3. Scope May include but is not limited to: 3.1 Theme/Motif of Event 3.2 Size and number of guests/delegates 3.3 Audience/participant needs 3.4 Location(s) 3.5 Duration 3.6 Financial investment and other resourcing issues",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "49 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 VARIABLE RANGE 4. Internal and external factors May include but are not limited to: 4.1 Resource availability (e.g. human, financial, physical) 4.2 Potential for attraction of additional resources (e.g. sponsorship, co-hosting) 4.3 Level of management commitment 4.4 Restrictions on lead time 4.5 Potential levels of participation and interest 4.6 Competitive environment 4.7 Timing and duration factors (e.g. impact of public holidays and other public events) 4.8 Potential contributors 4.9 Talent requirements 4.10 Climate 4.11 Access factors 4.12 Marketing and promotional issues (e.g. potential for media coverage) 5. Key logistical requirements May include but are not limited to: 5.1 Venue decoration 5.2 Talent 5.3 Stage set-up and design 5.4 Catering 5.5 Technical effects (e.g. sound, lighting, audio-visual) 5.6 Collateral materials",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "50 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidences that the candidate: 1.1 Demonstrated ability to develop a concept and format that reflects event objectives. 1.2 Demonstrated ability to develop concept that is operationally practical and which results in the achievement of objectives. 1.3 Demonstrated knowledge of typical formats for different styles of events. 1.4 Demonstrated knowledge of the creative options to be considered when developing an event concept. 2. Underpinning knowledge 2.1. Key stakeholders for different types of events 2.2. Internal and external factors to be considered when developing an event concept 2.3. Key management issues that impact on development of an event concept 2.4. Creative options for different types of event 3. Underpinning skills 3.1 Completing and reporting on an internal research process to determine key factors affecting a corporate event 3.2 Developing concept, theme and format proposals for presentation to an event organizing committee 3.3 Liaising with multiple potential contractors to develop an event concept within a very short timeframe 3.4 Coordinating a brainstorming session to develop the creative elements of an event 3.5 Estimating costs for particular concepts and formats 3.6 Developing a solution to a situation where the event principal’s desire for a particular creative component does not fit with the overall concept 3.7 Using computer software to develop an animated presentation on an event concept 4. Resource implications The following resources MUST be provided: 4.1 Standard office electronic equipment 4.2 Event brief and requirements 4.3 Access to and interaction with event industry suppliers 4.4 Involvement of and interaction with an event principal or organizing group",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "51 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 5. Methods of assessment Competency may be assessed through: 5.1 • Evaluation of concept through a review of candidate’s output/s. 5.2 Oral questions to assess knowledge of the range of key market factors and management issues to be considered in the concept development phase. 5.3 • Review of portfolios of evidence and third-party workplace reports of on-the-job performance by the candidate. 6. Context for assessment 6.1 Competency assessment may occur in workplace or any appropriately simulated environment 6.2 Assessment may be performed on multiple occasions involving a combination of direct, indirect and supplementary forms of evidence.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "52 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 UNIT OF COMPETENCY: DEVELOP EVENT PROGRAM UNIT CODE: TRS342317 UNIT DESCRIPTOR: This unit covers the knowledge, skills, behavior and motivations required to design an event program. Event managers, either internal or external to the sponsoring organization, would generally undertake this role. ELEMENT PERFORMANCE CRITERIA Bold and italicized terms are elaborated in the Range of Variables 1. Identify conference objectives 1.1 Overall context and scope of the conference are identified. 1.2 Specific conference objectives are developed and agreed on in consultation with relevant colleagues and/or customers. 2. Design event program 2.1 Dates and times are set to meet agreed objectives. 2.2 Theme is developed to complement event objectives. 2.3 Overall event format is developed within known budget, venue and staging constraints. 2.4 Relevant components for the program are identified, designed and integrated. 2.5 Use of appropriate technological options are identified and integrated in program development. 2.6 Business program based on principles of adult learning is developed to incorporate an appropriate range of activities. 3. Finalize program details 3.1 Proposed event program is presented to the appropriate people within required timeframe. 3.2 Approval of program details is obtained in accordance with agreed procedures. 3.3 Appropriate actions are initiated in relation to the dissemination and publication of event program.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "53 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 RANGE OF VARIABLES VARIABLE RANGE 1. Relevant components May include but are not limited to: 1.1 Business program 1.2 Breaks 1.3 Food and beverage 1.4 Social program 1.5 Pre and post touring elements 2. Business program Issues may include but are not limited to: 2.1 Workshops 2.2 Plenary sessions 2.3 Breakout sessions 2.4 Keynote speakers 2.5 Facilitators 2.6 Speaker availability 2.7 Venue-related issues 2.8 Technology",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "54 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidences that the candidate: 1.1 Demonstrated ability to design a practical event program to meet overall objectives and the needs of the target audience within budget guidelines. 1.2 Demonstrated detailed knowledge of the range of options available to conference organizers in terms of venues, staging, format and pre/post touring components. 2. Underpinning knowledge 2.1 Typical conference session formats 2.2 Range of options for event staging and venue set-ups 2.3 Principles of adult learning 2.4 Needs of different segments of the market in relation to conference activities (e.g. corporate, associations, government) 3. Underpinning skills 3.1 Assessing and selecting optimum pre-and post-touring options or social events for a given event 3.2 Presenting a draft event proposal to the sponsoring organization 3.3 Developing a precise schedule for all event activities 3.4 Running a mind-mapping session with colleagues to source ideas for an event program 3.5 Calculating costs to ensure they remain within budget guidelines 3.6 Adjusting a draft program to meet a 20% budget cutback 3.7 Using a computer to calculate costs 4. Resource implications The following resources MUST be provided: 4.1 Office equipment and materials, including equipment for oral and visual presentations 4.2 Project or work activities that allow the candidate to develop a program for an event that is actually held 4.3 Involvement of a sponsoring organization or individual with whom the candidate must liaise 4.4 Involvement of a team in event program development",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "55 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 5. Methods of assessment Competency may be assessed through: 5.1 Oral questioning to assess knowledge of programming for different types of conferences and/or events. 5.2 Review of portfolios of evidence of on-the-job performance by the candidate. 5.3 Third-party workplace reports of on-the-job performance by the candidate. 6. Context for assessment 6.1 Competency assessment may occur in the workplace or any appropriately simulated environment 6.2 Assessment may be performed on multiple occasions involving a combination of direct, indirect, and supplementary forms of evidence.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "56 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 UNIT OF COMPETENCY: SELECT EVENT VENUE AND SITE UNIT CODE: TRS342318 UNIT DESCRIPTOR: This unit covers the knowledge, skills, behavior and motivations required to undertake the venue/site selection process for a major event comprising multiple components. It requires the application of significant analytical and research skills to complete the process of matching an event to a particular site or venue. ELEMENT PERFORMANCE CRITERIA Bold and italicized terms are elaborated in the Range of Variables 1. Analyze venue or site requirements 1.1 Event-specific venue or site requirements are analyzed based on detailed review of all aspects of the proposed event, including multiple components. 1.2 Accurate and complete venue or site specifications are developed to facilitate the research process. 1.3 Needs of all stakeholders, including those with disabilities, are integrated into venue or site specifications. 2. Source event venues or sites 2.1 Potential venues or sites are researched, using appropriate information sources and research methods. 2.2 Suitability of venues or sites is assessed based on comparison of services offered with specifications. 2.3 Need for and the nature of contingency planning required by specific venues or sites are assessed. 2.4 Venue or site capacity to deliver quality outcomes in relation to customer service, cooperative management, and past experience is assessed. 2.5 Negotiation and liaising with personnel from potential venues or sites are undertaken to ensure all event requirements can be met and to address potential problem areas. 2.6 Need for tentative bookings is assessed and prompt action is taken. 2.7 Multiple site and venue selection is coordinated in a logical manner when required.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "57 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 ELE MENT PERFORMANCE CRITERIA Bold and italicized terms are elaborated in the Range of Variables 2.8 Clear and accurate briefings on venue or site options are provided to colleagues and key stakeholders to include recommendations and rationale. 3. Confirm venue or site arrangements 3.1 Venue or site arrangements are accurately confirmed in writing when the selection process is finalized. 3.2 Venue or site contracts are reviewed and signed within appropriate timeframes and within the scope of individual responsibility. 3.3 Specific venue and site planning issues are integrated into overall event management systems promptly.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "58 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 RANGE OF VARIABLES VARIABLE RANGE 1. Aspects May include but are not limited to: 1.1 Overall theme and image 1.2 Estimated numbers 1.3 Facilities and services to be provided 1.4 Budget 1.5 Audience/delegate profile and location 2. Multiple components May include but are not limited to: 2.1 Multiple contractors 2.2 Substantial catering (i.e. not simply afternoon snacks) 2.3 Multiple speakers, performers or exhibitors 2.4 Requirement for display, decoration or theming 3. Venue or site specifications May include but are not limited to: 3.1 Availability 3.2 Facilities and services (e.g. catering, size of area, protection from the elements, equipment) 3.3 Staging 3.4 Capacity 3.5 Budget parameters 3.6 Entry and exit points 3.7 Access and timing (set-up and breakdown) 4. Stakeholders May include but are not limited to: 4.1 Attendees/delegates/guests 4.2 Host organization 4.3 Contractors/suppliers 4.4 Sponsors 4.5 Emergency services 4.6 Regulatory authorities",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "59 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 VARIABLE RANGE 5. Information sources May include but are not limited to: 5.1 Local/regional/municipal tourism organizations 5.2. Philippine Convention and Visitors Corporation (PCVC) 5.3 Venue publications and directories 5.4 Destination brochures 5.5 Trade journals 5.6 Internet 6. Research methods May include but are not are limited to: 6.1 Using personal event industry networks 6.2 Desk research 6.3 Calling for tenders 6.4 Personal venue or site inspection",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "60 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidences that the candidate: 1.1 Researched evaluated and selected an appropriate venue or site for a nominated event comprising multiple components. 1.2 Interpreted the range of information used in the venue and site selection process. 1.3 Demonstrated knowledge of the different venue and site options within the local area. 2. Underpinning knowledge 2.1 Different styles of venues and sites, services offered and their suitability for particular event types 2.2 Venue and site options within a given locality 2.3 Presentation styles for venue and site information and interpretation of this information 2.4 Sources for information on venue and site 2.5 • Features and requirements of a typical venue or site contracts 2.6 • Typical operational structures within a venue including relevant personnel, internal networks and interrelationships and reporting structures. 3. Underpinning skills 3.1 Analyzing information from a range of venues or sites and assessing suitability 3.2 Developing an event specification document 3.3 Selecting and booking venues for an event 3.4 Running a venue sub-committee meeting to assess venue options 3.5 Calculating floor space requirements for a given event 3.6 Adjusting venues and dates when venue availability is limited 4. Resource implications The following resources MUST be provided: 4.1 Office equipment and material, including equipment for oral and visual presentations 4.2 Venue/site selection process for an event which becomes an event managed by the candidate 4.3 Access to venues and sites relevant to different types of events 4.4 Current industry documentation and publications relating to venues and sites 4.5 Access to and liaison with venue personnel during the selection process 4.6 Involvement of and consultation with event stakeholders",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 61
                },
                "type": "Document"
            },
            {
                "page_content": "61 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 5. Methods of assessment Competency may be assessed through: 5.1 Oral questioning/Interview 5.2 Evaluation of candidate’s output/s showing documentation and specifications. 5.3 Third-party workplace reports of on-the-job performance by the candidate. 6. Context for assessment 6.1 Competency assessment may occur in the workplace or any appropriately simulated environment 6.2 Assessment may be performed on multiple occasions involving a combination of direct, indirect, and supplementary forms of evidence.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 62
                },
                "type": "Document"
            },
            {
                "page_content": "62 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 UNIT OF COMPETENCY: DEVELOP AND UPDATE EVENT INDUSTRY KNOWLEDGE UNIT CODE: TRS342319 UNIT DESCRIPTOR: This unit covers the knowledge, skills, behavior and motivations required to develop and update general knowledge of the meetings and events industry including industry structure, legal issues and current technology. This knowledge underpins effective performance in all meeting and event organization and management roles. ELEMENT PERFORMANCE CRITERIA Bold and italicized terms are elaborated in the Range of Variables 1. Source and apply information on the structure and operation of the event industry 1.1 Sources of information on the event industry are identified correctly. 1.2 Knowledge of the event industry is used in the correct context to enhance the quality of work performance. 2. Source and apply information on ethical and legal issues for the event industry 2.1 Information on legal and ethical issues are obtained to assist effective work performance. 2.2 Day-to-day event organization activities are conducted in accordance with legal obligations and ethical industry practices. 3. Source and apply information on event industry technology 3.1 Information on current and emerging technologies that impact on the event organization process are obtained. 3.2 The potential effects of different technologies on the event organization process are assessed. 3.3 Knowledge of current and emerging technology is applied in day-to-day work activities. 4. Update event industry knowledge 4.1 A range of opportunities is identified and used to update knowledge of the events industry. 4.2 Current issues of concern to the industry are monitored. 4.3 Updated knowledge is shared with customers and colleagues as appropriate, and incorporated into day-to-day work activities.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 63
                },
                "type": "Document"
            },
            {
                "page_content": "63 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 RANGE OF VARIABLES VARIABLE RANGE 1. Information May include but is not limited to: 1.1 Industry structure 1.2 Different event types and staging elements 1.3 Event protocols 1.4 Major industry bodies/associations 1.5 Impacts of events on local economies 1.6 Trends 1.7 Career opportunities 2. Event May include but is not limited to: 2.1 Conferences 2.2 Symposia 2.3 Exhibitions 2.4 Festivals 2.5 Promotions 2.6 Shows 2.7 Sporting events 2.8 Parades 2.9 Cultural celebrations 2.10 Trade and consumer shows 2.11 Social events 2.12 Public events 2.13 Corporate events 2.14 Charitable, fund-raising events 3. Legal and ethical issues May include but are not limited to: 3.1 Public liability 3.2 Duty of care 3.3 Licensing 3.4 Risk management 3.5 Occupational health and safety",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 64
                },
                "type": "Document"
            },
            {
                "page_content": "64 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 VARIABLE RANGE 4. Ethical industry practices May include but are not limited to: 4.1 Commission procedures 4.2 Bookings at venues 4.3 Confidentiality 4.4 Overbooking 4.5 Sub-contracting 4.6 Pricing 5. Technologies May include but are not limited to: 5.1 Project management systems 5.2 Delegate registration and tracking systems 5.3 CAD systems 5.4 Internal venue booking systems 6. Opportunities May include but are not limited to: 6.1 Industry seminars 6.2 Training course 6.3 Industry association membership 6.4 Participation in events industry association activities 6.5 Informal networking with colleagues 6.6 Reading industry journals 6.7 Web search",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 65
                },
                "type": "Document"
            },
            {
                "page_content": "65 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidences that the candidate: 1.1 Demonstrated • general knowledge of the events industry. 1.2 Demonstrated understanding of how industry knowledge can be applied to work activities to maximize effective performance. 1.3 Demonstrated • knowledge of ways to maintain currency of knowledge. 2. Underpinning knowledge 2.1 Main types of events including the following for different event types:  Objectives/roles  Scope  Nature of audience  Key stakeholders  Key elements of staging an event 2.2 Structure and function of the events industry, including:  Relationships between the events industry and other industries such as entertainment  Businesses and organizations involved in the industry  Key motivations for hosting events 2.3 Role and impact of events on local economies 2.4 • Legal and ethical issues that impact on event management including overview of relevant legislation 2.5 Current and emerging technology for different aspects of the event management process 3. Underpinning skills 3.1 Deciding whether to join an industry association based on evaluation of promotional materials 3.2 Coordinating with clients on protocol requirements for a given event 3.3 Organizing a personal program of professional development activities for the upcoming year 3.4 Discussing industry developments with colleagues 3.5 Responding to a situation at a particular type of event where candidate has no knowledge of its components 3.6 Using the internet to source information on the events industry",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 66
                },
                "type": "Document"
            },
            {
                "page_content": "66 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 4. Resource implications The following resources MUST be provided: 4.1 Standard office electronic equipment 5. Methods of assessment Competency may be assessed through: 5.1 Oral questioning to assess knowledge of different aspects of the events industry. 5.2 Review of portfolios of evidence of on-the-job performance by the candidate. 5.3 Third-party workplace reports of on-the-job performance by the candidate. 6. Context for assessment 6.1 Competency assessment may occur in the workplace or any appropriately simulated environment. 6.2 Assessment may be performed on multiple occasions involving a combination of direct, indirect, and supplementary forms of evidence.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 67
                },
                "type": "Document"
            },
            {
                "page_content": "67 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 ON-SITE EVENT MANAGEMENT SERVICES UNIT OF COMPETENCY: PROVIDE ON-SITE EVENT MANAGEMENT SERVICES UNIT CODE: TRS342320 UNIT DESCRIPTOR: This unit covers the knowledge, skills, behavior and motivations required to coordinate the final preparation and set-up of a major event comprising multiple components and to manage all aspects of the on-site operation. ELEMENT PERFORMANCE CRITERIA Bold and italicized terms are elaborated in the Range of Variables 1. Prepare for on-site management 1.1 Plans for on-site management are developed in accordance with agreed procedures for the meeting or event. 1.2 Final arrangements for all aspects of the meeting or event are checked and any discrepancies are attended to. 1.3 Materials are created and collated to facilitate effective on-site management. 1.4 Accurate briefing is provided to operational staff and contractors prior to the meeting or event in an appropriate format including clarification of roles and responsibilities. 2. Oversee meeting/event set-up 2.1 Contact with the nominated contractor personnel is established at the appropriate time and all requirements are reconfirmed and agreed to. 2.2 Necessary adjustments are made and agreed to with the contractors. 2.3 All aspects of the event or meeting set up are checked against the pre-arranged agreements. 2.4 Venue space and set up of equipment are checked to allow for easy access, especially for those with disabilities, and to avoid risk of injury to guests, delegates and colleagues. 2.5 Any deficiencies and discrepancies are identified and prompt action is taken to rectify the situation. 2.6 Additional on-site staff are briefed on the full details of the meeting or event operation including communication and control mechanisms.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 68
                },
                "type": "Document"
            },
            {
                "page_content": "68 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 ELEMENT PERFORMANCE CRITERIA Bold and italicized terms are elaborated in the Range of Variables 3. Monitor meeting/event operation 3.1 Sessions and activities are monitored throughout the meeting or event through observation and appropriate reporting processes. 3.2 Problems are identified as they arise and prompt action is taken to resolve the situation. 3.3 Additional requirements are identified and promptly organized. 3.4 Customer is liaised with throughout the meeting or event to ensure it is progressing to his/her satisfaction. 3.5 All contractors are liaised with on an ongoing basis to ensure effective delivery of services. 4. Oversee meeting/event breakdown 4.1 Breakdown of the meeting or event is checked to ensure it is completed in accordance with agreements. 4.2 The packing and removal of all materials and equipment are coordinated in accordance with pre-arranged details. 4.3 Venue is checked to ensure items and belongings are not left behind. 4.4 Debriefing is conducted with contractors and staff, if necessary, to discuss any difficulties or suggestions for future improvements. 4.5 Accounts are checked and signed in accordance with contractor agreements. 4.6 Outstanding items requiring post-event action are noted.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 69
                },
                "type": "Document"
            },
            {
                "page_content": "69 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 RANGE OF VARIABLES VARIABLE RANGE 1. Procedures May include but are not limited to: 1.1 Registrations 1.2 Organizing committee 1.3 Record-keeping and reporting 1.4 Special needs 1.5 Risk management 1.6 Crowd control 1.7 Event timings 1.8 Contractor communication 2. Materials May include but are not limited to: 2.1 Running sheets 2.2 Copies of agreements with clients 2.3 Copies of agreements with all contractors 2.4 Contact numbers for all contractors and staff 2.5 Briefing papers 3. Contractors May include but are not limited to: 3.1 Venues 3.2 Speakers 3.3 Staging and audiovisual suppliers 3.4 Display suppliers 3.5 Caterers 3.6 Entertainers 3.7 Equipment hire companies 4. Aspects of the event or meeting May include but are not limited to: 4.1 Availability of all materials and equipment 4.2 Room set up 4.3 Staging 4.4 Technical equipment 4.5 Display and signage 4.6 Food and beverage arrangements 4.7 Registration areas",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 70
                },
                "type": "Document"
            },
            {
                "page_content": "70 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 VARIABLE RANGE 5. Deficiencies and discrepancies May include but are not limited to: 5.1 Incorrect room set ups 5.2 Incorrect staging 5.3 Faulty or non availability of technical equipment 5.4 Lack of equipment to manage displays and signage 5.5 Shortage of food and beverage 5.6 Inappropriate space at registration areas 6. Communication and control mechanisms May include but are not limited to: 6.1 Guidelines on reporting lines during the event 6.2 Regularity of updates to event managers 6.3 Specific performance indicators 6.4 Contingency plans 7. Breakdown May include but is not limited to: 7.1 Packing and removal of all materials and equipment 7.2 Final check of venue 7.3 Checking and signing of accounts with contractors",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 71
                },
                "type": "Document"
            },
            {
                "page_content": "71 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidences that the candidate: 1.1 Demonstrated ability to manage the on-site operation of a meeting or event including all aspects of preparation, set up, operation and move out. 1.2 Demonstrated knowledge of the range of issues and problems that may arise during the conduct of meetings/events. 2. Underpinning knowledge 2.1 Typical on-site events management systems and procedures 2.2 Logistics for on-site management including contractor communication mechanisms and protocols (e.g. main liaison person within a venue, hierarchy of control, walkie-talkie options) 2.3 Running sheets and how they are used 2.4 Importance of and techniques for managing stress and time during the operation of an event 2.5 Characteristics of written contractor documentation including event order and other technical specifications 2.6 Safety/risk issues associated with the movement of numbers of people at meeting and event venues 3. Underpinning skills 3.1 Negotiation skills in specific relation to time constraints of on-site activities 3.2 Checking all aspects of the event or meeting set up against the pre-arranged agreements 3.3 Providing a pre-event briefing to operational staff and suppliers 3.4 Discussing problems with operational staff and providing advice on how to solve them 3.5 Developing plans for on-site management 3.6 Preparing service reconfirmation checklists 3.7 Providing instructions to operational team members, briefing and debriefing suppliers and staff 3.8 Checking capacity of venue outlets against numbers of registrations 3.9 Checking and signing accounts in accordance with supplier agreements 3.10 Identifying room set up deficiencies and discrepancies in supply of equipment and taking prompt action to rectify the situation 3.11 Creating and collating a computerized running sheet",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 72
                },
                "type": "Document"
            },
            {
                "page_content": "72 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 4. Resource implications The following resources MUST be provided: 4.1 Project or work activities that allow the candidate to manage the on-site aspects of a meeting or event within an appropriate venue on more than one occasion to ensure that skills in dealing with a range of circumstances are demonstrated 4.2 Involvement of a team of operational staff involved in delivering a meeting or event 4.3 • Involvement of suppliers of equipment and services 4.4 Realistic ratios of operational staff to delegates and guests 4.5 Presence of commercially-realistic time pressures related to the operation of an event 4.6 Use of meeting and event operational documents and equipment 5. Methods of assessment Competency may be assessed through: 5.1 Direct observation with Oral Questioning of actual event managed by candidate 5.2 • Evaluation of candidate’s outputs such as running sheets, site management plans, review of staff or supplier briefing documents and reconfirmation checklists. 5.3 Review of portfolios of evidence and third party workplace reports of on-the-job performance by the candidate. 5.4 Third Party Report 6. Context for assessment 6.1 Competency assessment may occur in workplace or any appropriately simulated environment. 6.2 Assessment may be performed on multiple occasions involving a combination of direct, indirect and supplementary forms of evidence.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 73
                },
                "type": "Document"
            },
            {
                "page_content": "73 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 UNIT OF COMPETENCY: MANAGE CONTRACTORS FOR INDOOR EVENTS UNIT CODE: TRS342321 UNIT DESCRIPTOR: This unit covers the knowledge, skills, behavior and motivations required to manage the staging and operation of a major indoor event comprising multiple components. It does not cover the high levels of technical expertise required to actually provide these services, but focuses on the key knowledge and skills required to oversee the process from an organizational and contractor management perspective. ELEMENT PERFORMANCE CRITERIA Bold and italicized terms are elaborated in the Range of Variables 1. Identify event operational requirements 1.1 Event staging requirements are analyzed based on detailed review of all aspects of the proposed event with multiple components. 1.2 An accurate summary of staging requirements is developed for each event component in consultation with key stakeholders. 1.3 Safety and risk management issues are incorporated into all planning documentation and processes. 2. Source contractors 2.1 Appropriate contractors are identified and sourced to provide services for the event. 2.2 Accurate briefings or specifications on precise staging requirements are provided to contractors. 2.3 Complete and timely quotations for the provision of services are obtained. 2.4 Quotations are analyzed and contractors are selected in consultation with key stakeholders. 2.5 Agreements with contractors are confirmed in writing to include details and costs of all services. 3. Monitor contractors 3.1 Progress, including safety issues, is monitored at regular intervals through ongoing liaison with contractors and other stakeholders. 3.2 Need for adjustments is identified and appropriate changes are organized with confirmation in writing. 3.3 Adjustments are negotiated to maintain the integrity and quality of the event.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 74
                },
                "type": "Document"
            },
            {
                "page_content": "74 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 ELEMENT PERFORMANCE CRITERIA Bold and italicized terms are elaborated in the Range of Variables 3.4 Work completed is evaluated against event requirements and time schedules and appropriate action is taken to address delays.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 75
                },
                "type": "Document"
            },
            {
                "page_content": "75 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 RANGE OF VARIABLES VARIABLE RANGE 1. Staging requirements May include but are not limited to: 1.1 Exhibition set-up 1.2 Audio-visual 1.3 Display and decoration 1.4 Furniture 1.5 Special effects 1.6 Entertainment 1.7 Lighting 1.8 Sound 1.9 Stage design 1.10 Rigging 1.11 Catering and catering set-up 1.12 Security 2. Multiple components May include but are not limited to: 2.1 Multiple contractors 2.2 Substantial catering (not simply afternoon snacks) 2.3 Multiple speakers, performers or exhibitors 2.4 Requirement for display, decoration or theming 3. Contractors May include but are not limited to: 3.1 Venues 3.2 • Speakers 3.3 • Staging and audio visual suppliers 3.4 • Display suppliers 3.5 • Caterers 3.6 • Entertainers 3.7 Equipment hire companies 4. Specifications May include but are not limited to: 4.1 Price 4.2 Performance standards 4.3 Timelines 4.4 Technical specifications for equipment 4.5 Theme-related requirements",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 76
                },
                "type": "Document"
            },
            {
                "page_content": "76 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 VARIABLE RANGE 4.6 Regulatory requirements 4.7 Previous experience",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 77
                },
                "type": "Document"
            },
            {
                "page_content": "77 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1. Demonstrated general knowledge of all event staging services and terminology. 1.2. Demonstrated ability to organize and coordinate multiple contractors as part of the overall event management process. 2. Underpinning knowledge 2.1 Roles and responsibilities of organizations involved in event staging 2.2 Fundamentals of Obligations and Contracts 2.3 Suppliers of staging services and sources of information on staging services 2.4 Risk management issues to be considered for key areas of event staging 2.5 Knowledge of terminology, services and key technology in key areas of staging including:  Catering  Venue decoration  Audio-visual options  Sound amplification  Lighting  Rigging  Live entertainment  Registration areas  Display  Security  Electronic media coverage of events  Safety equipment 2.6 The key inclusions for contractor briefing or specification documents 3. Underpinning skills 3.1 Assessing competitive quotes from staging suppliers 3.2 Developing a tender brief for staging suppliers 3.3 Appointing and managing multiple suppliers before, during and after an event 3.4 Negotiating with suppliers on changing requirements 3.5 Calculating numbers of exhibition panels required for a trade show",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 78
                },
                "type": "Document"
            },
            {
                "page_content": "78 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 3.6 Negotiating with a supplier who is failing to meet contract obligations 3.7 Creating different staging scenarios 4. Resource implications The following resources MUST be provided: 4.1 Standard office electronic equipment 4.2 Access to venues for staging of an indoor event 4.3 Access to all equipment required for the staging of an event 4.4 Liaison with and involvement of multiple contractors 5. Methods of assessment Competency may be assessed through: 5.1 Evaluation of candidate’s output to review documentation used to manage contractors. 5.2 Oral questioning to assess knowledge of key staging services and relevant terminology. 5.3 Review of third-party workplace reports of on-the-job performance by the candidate. 6. Context for assessment 6.1 Competency assessment may occur in workplace or any appropriately simulated environment. 6.2 Assessment may be performed on multiple occasions involving a combination of direct, indirect and supplementary forms of evidence.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 79
                },
                "type": "Document"
            },
            {
                "page_content": "79 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 UNIT OF COMPETENCY: DEVELOP AND UPDATE KNOWLEDGE ON PROTOCOL UNIT CODE: TRS342322 UNIT DESCRIPTOR: This unit covers the knowledge, skills, behavior and motivations required to develop and apply knowledge of protocol to a range of tourism related activities. It is particularly relevant to those involved in the management and operation of events, including functions. ELEMENT PERFORMANCE CRITERIA Bold and italicized terms are elaborated in the Range of Variables 1. Seek information on appropriate protocol 1.1 Sources of accurate information on protocol are identified. 1.2 Relevant protocol information is accessed in response to workplace needs. 2. Integrate appropriate protocol procedures into work activities 2.1 Areas of work activity and/or functions that require appropriate use of protocol are identified in a timely manner. 2.2 Correct use of protocol is integrated into work activities. 2.3 Appropriate protocol requirements are determined by liaising with colleagues and other stakeholders. 2.4 Appropriate information on protocol is provided to relevant colleagues and stakeholders. 3. Update knowledge on protocol 3.1 Opportunities to update protocol knowledge are identified and used. 3.2 Updated knowledge is shared with customers and colleagues as appropriate and incorporated into day-to-day working activities.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 80
                },
                "type": "Document"
            },
            {
                "page_content": "80 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 RANGE OF VARIABLES VARIABLE RANGE 1. Sources of accurate information May include but are not limited to: 1.1 Libraries 1.2 Internet 1.3 Department of Foreign Affairs 1.4 Department of Interior and Local Government 1.5 National Council of Culture and Arts 1.6 Office of the United Nations 2. Functions May include but are not limited to: 2.1 Civic receptions 2.2 Formal parades 2.3 City ceremonies 2.4 National holiday receptions 2.5 Independence ceremonies 2.6 Private functions 2.7 Functions with VIPs and/or government officials in attendance 3. Work activities May include but are not limited to: 3.1 Issuing invitations 3.2 Preparing running sheets 3.3 Preparation of briefing papers 3.4 Liaison with dignitaries and officials 3.5 Correspondence to dignitaries and officials 3.6 Providing various services during the conduct of on-site management, service of food and beverage",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 81
                },
                "type": "Document"
            },
            {
                "page_content": "81 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Demonstrated knowledge of where to source accurate information on protocol for specific situations. 1.2 Demonstrated knowledge of protocols. 2. Underpinning knowledge 2.1 • Importance and role of protocol in different events and situations 2.2 Key sources of information on protocol 2.3 Main types of civic functions held in the Philippines 2.4 Philippine ranking system including order of precedence, ranks and forms of address and wearing of honors and medals 2.5 Appropriate protocols for the involvement of indigenous peoples and other cultural groups in events 2.6 Correct use of national symbols including flags, anthems and military salutes 2.7 Forms of address for different VIPs and dignitaries, both for written correspondence and in oral communication 2.8 Protocol procedures for different types of function including: 2.81 Invitations to VIPs 2.82 Arrival procedures, including for government officials 2.83 Introduction protocols and order of speakers 2.84 Order of precedence for official guests 2.85 Seating arrangements 2.86 Dress styles 3. Underpinning skills 3.1 Determining the protocol information required for a particular event 3.2 Advising colleagues about protocol requirements for a given event 3.3 Integrating protocol into event organization activities 3.4 Liaising with protocol officers from a government department 3.2 Finding protocol information in relation to a totally unknown situation 3.3 Using the internet to source protocol information",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 82
                },
                "type": "Document"
            },
            {
                "page_content": "82 EVENTS MANAGEMENT SERVICES NCIII Promulgated November 2007 4. Resource implications The following resources MUST be provided: 4.1 Standard office electronic equipment 5. Methods of assessment Competency may be assessed through: 5.1 Oral questions to assess knowledge of protocol for different situations. 5.2 Review of portfolios of evidence of on-the-job performance by the candidate. 5.3 Third party workplace reports of on-the-job performance by the candidate. 6. Context for assessment 6.1 Competency assessment may occur in the workplace or any appropriately simulated environment. 6.2 Assessment may be performed on multiple occasions involving a combination of direct, indirect, and supplementary forms of evidence.",
                "metadata": {
                    "source": "datasets\\raw\\Events Management Services NC III.pdf",
                    "page": 83
                },
                "type": "Document"
            }
        ]
    }
]