[
    {
        "name": "Flux Cored Arc Welding (FCAW) NC II",
        "core_competencies": [
            {
                "page_content": "FCAW NC II 43 CORE COMPETENCY UNIT OF COMPETENCY: Weld carbon steel pipes using FCAW UNIT CODE: MEE721310 DESCRIPTOR: This unit covers the skills, knowledge and attitudes required in welding carbon steel pipes using FCAW process. ELEMENTS PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Perform root pass (backing material) 1.1 Root pass is performed in accordance with WPS and/or client specifications. 1.2 Weld is visually checked for defects and repaired, as required (root pass is performed without defects 1.3 Weld is visually acceptable in accordance with applicable codes and standards 2. Clean root pass 2.1 Root pass is cleaned and is free from defects and discontinuities (root pass is cleaned without defects and discontinuities 2.2 Task is performed in accordance with approved WPS 3. Weld subsequent/filling passes 3.1 Subsequent/filling passes are performed in accordance with approved WPS 3.2 Weld is visually checked for defects and repaired, as required 3.3 Weld is visually acceptable in accordance with applicable codes and standards 4. Perform capping 4.1 Capping is performed in accordance with WPS and/or client specifications 4.2 Weld is visually checked for defects and repaired, as required 4.3 Weld is visually acceptable in accordance with applicable codes and standards",
                "metadata": {
                    "source": "datasets\\raw\\Flux Cored Arc Welding (FCAW) NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "FCAW NCI 44 RANGE OF VARIABLE VARIABLE RANGE 1. WPS WPS Requirements 1.1 Welding positions 1.1.1 2G and 5G and/or 6G 1.2 Wall thickness 1.2.1 1.6mm and above 1.3 Type of material 1.3.1 Carbon and mild steel pipes 1.3.2 Diameter 25.4mm (1 inch) and above 1.4 Type and size of flux cored electrode 1.5 Travel speed 1.6 Current setting (polarity, amperage, voltage) 1.7 Backing materials (weld metal, backing ring or ceramics) 1.8 Welding accessories 1.8.1 Transformer Rectifier Type 1.8.2 Wire feeder 1.9 Joint preparation 2. Defects 2.1 Porosity 2.2 Undercut 2.3 Arc Strike 2.4 Spatters 2.5 Wire, solid and slag inclusion 2.6 Concavity/convexity 2.7 Degree of reinforcement 2.8 Burn Through 2.9 Crater cracks 2.10 Cracks 2.11 Lack of Fusion (tie-in) 2.12 Pinholes/Blowholes 2.13 Under Fill 2.14 Overlap 2.15 Misalignment 2.16 Distortion",
                "metadata": {
                    "source": "datasets\\raw\\Flux Cored Arc Welding (FCAW) NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "FCAW NC II 45 EVIDENCE GUIDE 1 Critical Aspects of Competency Assessment requires evidence that the candidate welded carbon steel pipes using FCAW in 2G, 5G and/or 6G positions to acceptable standard following the approved WPS. 2 Underpinning Knowledge 2.1 Drawing/Plan/WPS interpretation 2.2 Materials and consumables 2.2.1 Flux cored electrode (self-shielded and gas shielded) 2.2.2 Shielding gases 2.3 Welding Equipment and Tools 2.4 Basic Mathematics (MDAS) 2.5 Welding Codes and symbols 2.6 Identification of weld defects 3 Underpinning Skills 3.1 Measuring skills 3.2 Communication skills 3.3 Rectifying weld defects 3.4 Applying welding techniques for FCAW 3.5 Handling welding tools and equipment 3.6 Handling materials and consumables and checking purity of shielding gas 3.7 Philippine OH&S Rules and/or client’s safety procedure 4 Resource Implications The following resources must be provided: 4.1 Well-ventilated work area/shop with FCAW facilities and equipment 4.2 Supplies and materials 4.3 PPE 4.4 Fumes extractor, if applicable 4.4 Relevant documentation such as WPS and working drawing 4.5 Stand-by fire fighting equipment 5 Method of Assessment Competency must be assessed through: 5.1 Demonstration/observation and oral questioning 5.2 Written test 5.3 Portfolio (awards, records, certificates, endorsements, etc.) 6 Context of Assessment Assessment may be conducted in the workplace or in a simulated work environment.",
                "metadata": {
                    "source": "datasets\\raw\\Flux Cored Arc Welding (FCAW) NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Food and Beverage Services NC II",
        "core_competencies": [
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 34 CORE COMPETENCIES UNIT OF COMPETENCY : PREPARE THE DINING ROOM/RESTAURANT AREA FOR SERVICE UNIT CODE : TRS512387 UNIT DESCRIPTOR : This unit covers the knowledge and skills required in the preparation of the dining room/restaurant area before the start of the service operations. It involves opening duties or the dining room mise-en-place prior to service. This unit includes the knowledge and skills in taking reservations, preparing service stations, table-setting, and setting the ambiance of the food service facility. ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 1. Take table reservations 1.1 Inquiries are answered promptly, clearly and accurately. 1.2 Pertinent questions are asked to complete the details of the reservations. 1.3 Reservations data are recorded on forms accurately based on establishment’s standards. 1.4 Details of the reservations are repeated back and confirmed with the party making the reservation. 1.5 Additional information about the food service establishment is provided when necessary. 2. Prepare service stations and equipment 2.1 Service or waiter’s stations are stocked with supplies necessary for service. 2.2 All tableware and dining room equipment are cleaned, wiped and put in their proper places. 2.3 Special tent cards and similar special displays are put up for promotion. 2.4 Cleanliness and condition of all tables, tableware and dining room equipment are checked. 2.5 Water pitchers and ice buckets are filled. 2.6 Electrical appliance or equipment like coffee pots, tea pots, plate warmers etc. in the dining area are turned on and kept ready. 2.7 Condiments and sauce bottles are refilled and the necks and tops of the bottles are wiped clean and dry.",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 35 ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 3. Set up the tables in the dining area 3.1 Tables are set according to the standards of the food service establishment. 3.2 In cases where the menu is pre-arranged or fixed, covers are set correctly according to the predetermined menu. 3.3 Tableware and glassware are wiped and polished before they are set up on the table. 3.4 Cloth napkins are folded properly and laid on the table appropriately according to napkin folding style. 3.5 Buffet or display tables are skirted properly taking into account symmetry, balance and harmony in size and design. 4. Set the mood/ambiance of the dining area 4.1 Lights are adjusted according to time of the day. 4.2 Tables, chairs and other dining room furniture are arranged to ensure comfort and convenience of the guests. 4.3 Appropriate music is played when applicable 4.4 Floors/carpets are cleaned and made sure are dry. 4.5 Air-condition or cooling units are adjusted for the comfort of the guests 4.6 Decorations are set-up according to the me or concept of the dining room.",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 36 RANGE OF VARIABLES VARIABLE RANGE 1. Inquiries May be received through the following: 1.1 Telephone 1.2 Fax 1.3 Email 1.4 Internet 1.5 In person 2. Details of the reservation May include: 2.1 Date of reservation 2.2 Time of arrival 2.3 Number of persons 2.4 Name of person who will use the reservation 2.5 Name of person making the reservation 2.6 Contact details of the person checking in and of the person making the reservation 2.7 Special requirements 3. Reservation records or forms May include: 3.1 Reservation Sheets 3.2 Logbook 3.3 Computer 3.4 Reservation Cards 4. Supplies May include: 4.1 Napkins 4.2 Menu folders 4.3 Order slips 4.4 Wine list 4.5 Condiments 4.6 Toothpicks 4.7 Table cloth/Placemats 4.8 Salt and Pepper shakers 5. Tableware May include: 5.1 Dinnerware/chinaware 5.1.1 Cover/service plate 5.1.2 Dinner plate 5.1.3 Entrée plate 5.1.4 Fish plate 5.1.5 Bread plate 5.1.6 Soup bowl/plate 5.1.7 Cups and saucers",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 37 VARIABLE RANGE 5.2 Glassware 5.2.1 Stem wares 5.2.2 Footed wares 5.2.3 Tumblers 5.2.4 Mugs 5.3 Silverware/Flatware 5.3.1 Dinner fork 5.3.2 Dinner spoon 5.3.3 Soup spoon 5.3.4 Butter knife/spreader 5.3.5 Steak knife 5.3.6 Fish Fork 5.3.7 Dessert fork 5.3.8 Teaspoon 5.4 Holloware 5.4.1 Soup tureen 5.4.2 Platters 5.4.3 Coffeepots 5.4.4 Teapots 6. Dining room/ Restaurant equipment May include: 6.1 Service tray stands 6.2 Gueridon 6.3 Cake display 6.4 Refrigerators/Chillers 6.5 Coffee makers/machines 6.6 Point Of Sales (POS) 6.7 Wine service equipment 7. Napkin folding styles May include: 7.1 Pyramid 7.2 Bird of Paradise 7.3 Bishop’s Hat 7.4 Rose bud 7.5 Sail 7.6 Candle 7.7 Crown 7.8 Goblet Fan",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 38 VARIABLE RANGE 8. Table skirting designs May include but not limited to: 8.1 Diamond style 8.2 Pleated box 8.3 Shirred Pleat 8.4 Single Pleats 8.5 Tulips 8.6 Scallops 8.7 Butterfly",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 39 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate 1.1 Took table reservations accurately 1.2 Identified and explained the use of the different food and beverage wares and equipment e.g. Dinnerware, glassware, silverware etc. 1.3 Completed and prepared service or waiter’s station 1.4 Set up tables according to predetermined menu 1.5 Performed different table napkin folding styles 2. Required Knowledge 2.1 Foodservice operations 2.2 Reservations process 2.3 Basic types of tableware a. Dinnerware b. Beverage ware/glassware c. Silverware/cutlery 2.4 General rules in laying covers/table set-up 2.5 Different napkin folding styles 2.6 Station mise-en-place 2.7 Telephone ethics 2.8 Table skirting styles 2.9 Banquet set-up styles 3. Required Skills 3.1 Taking reservations 3.2 Table set-up 3.3 Napkin folding 3.4 Skirting buffet/display tables 3.5 Banquet set-ups 4. Resource Implications The following resources MUST be provided: 4.1 Different tableware and dining room equipment. 4.2 Table skirting and set-up paraphernalia 4.3 Cloth napkins (correct size and material) 5. Methods of Assessment Competency may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on the different tableware and equipment and Station mise-en-place 5.2 Simulation/role play to test the candidate’s knowledge and skills in taking reservations telephone skills 5.3 Practical/Demonstration for table setting, skirting and napkin folding 5.4 Demonstration to show the types of service 6. Context of Assessment Assessment must be conducted in 6.1 Workplace or simulated environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 40 UNIT OF COMPETENCY: WELCOME GUESTS AND TAKE FOOD AND BEVERAGE ORDERS UNIT CODE: TRS512388 UNIT DESCRIPTOR: This unit deals with the knowledge and skills required in providing pre-meal services to the dining guests as soon as they arrive in the foodservice facility. It covers the dining room or restaurant service procedures before the food and beverage orders are served. This unit involves the initial steps in the sequence of service that includes the welcoming of guests, seating the guests, taking food and beverage orders and liaising between the kitchen and the service area. ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 1. Welcome and greet guests 1.1 Guests are acknowledged as soon as they arrive. 1.2 Guests are greeted with an appropriate welcome. 1.3 Details of reservations are checked based on established standard policy. 2. Seat the guests 2.1 Guests are escorted and seated according to table allocations 2.2 Tables are utilized according to the number of party. 2.3 Guests are seated evenly among stations to control the traffic flow of guests in the dining room. 2.4 Cloth napkins are opened for the guests when applicable. 2.5 Water is served when applicable, according to the standards of the foodservice facility. 3. Take food and beverage orders 3.1 Guests are presented with the menu according to established standard practice. 3.2 Orders are taken completely in accordance with the establishment’s standard procedures. 3.3 Special requests and requirements are noted accurately. 3.4 Orders are repeated back to the guests to confirm items. 3.5 Tableware and cutlery appropriate for the menu choices are provided and adjusted in accordance with establishment procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 41 ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 4. Liaise between kitchen and service areas 4.1 Orders are placed and sent to the kitchen promptly. 4.2 Quality of food is checked in accordance with establishment standards 4.3 Tableware is checked for chips, marks, cleanliness, spills, and drips 4.4 Plates and/or trays are carried out safely. 4.5 Colleagues are advised promptly regarding readiness of items for service 4.6 Information about special requests, dietary or cultural requirements is relayed accurately to kitchen where appropriate. 4.7 Work technology are observed according to establishment standard policy and procedures",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 42 RANGE OF VARIABLES VARIABLE RANGE 1. Types of menu May include: 1.1 A la carte 1.2 Table d’hote 1.3 Carte du jour 2. Ordering systems May include: 2.1 Docket system 2.2 Checklist 2.3 Blank order slips 2.4 Touchscreen POS system 3. Work technology May include: 3.1 POS 3.2 Electronic tablet order",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 43 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidences that the candidate: 1.1 Welcomed and greeted the guests 1.2 Took food and beverage orders 1.3 Liaised between kitchen and service areas 2. Required Knowledge 2.1 Welcoming and greeting guests procedures 2.2 Seating guests procedures 2.3 Sequence of Food Service 2.4 Basic Menu types 2.5 Order taking procedures 2.6 Principles of promotion and selling 2.7 Suggestive selling techniques 2.8 Product and service knowledge 3. Required Skills 3.1 Basic communication skills 3.2 Taking food and beverage order 3.3 Skill in Technology knowledge (e.g. POS, electronic order tablet, etc. 4. Resource Implications The following resources must be provided: 4.1 Different order taking systems 4.2 Different menu forms 5. Methods of Assessment Competency may be assessed through: 5.1 Practical demonstration or 5.2 Simulation/role plays to test the candidate’s knowledge and skills in: a. Welcoming and greeting guests b. Seating the guests c. Taking food and beverage orders. 6. Context for Assessment Assessment must be conducted in 6.1 Workplace or simulated work environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 44 UNIT OF COMPETENCY: PROMOTE FOOD AND BEVERAGE PRODUCTS UNIT CODE: TRS5123 89 UNIT DESCRIPTOR: This unit deals with the knowledge and skills required in providing advice to customers on food and beverage products in foodservice enterprises. ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 1. Know the product 1.1 Names and pronunciations of dishes in the menu are mastered. 1.2 Ingredients of dishes are memorized. 1.3 Sauces and accompaniments are known by heart. 1.4 Descriptions of every item in the menu are studied. 1.5 Common food allergens are mastered to prevent serious health consequences. 2. Undertake Suggestive selling 2.1 Information about the food items are provided in clear explanations and descriptions. 2.2 Items on specials or promos are offered to assist guests with food and beverage selections. 2.3 Name of specific menu items are suggested to guests rather than just mentioning the general categories in the menu to help them make the choice and know what they want. 2.4 Standard food and beverage pairings are recommended. 2.5 Several choices are given to provide more options to guests 2.6 Descriptive words are used while explaining the dishes to make it more tempting and appetizing. 2.7 Suggestive selling is carried out discreetly so as not to be too pushy or too aggressive. 3. Carry out Upselling strategies 3.1 Slow moving but highly profitable items are suggested to increase guest check. 3.2 Second servings of items ordered are offered. 3.3 Food portion or size is mentioned for possible adjustments with the orders. 3.4 New items are recommended to regular guests to encourage them to try other items in the menu.",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 45 RANGE OF VARIABLES VARIABLE RANGE 1. Information about the food May include: 1.1 Cooking method 1.2 Serving portions 1.3 Tastes and flavors 1.4 Ingredients including food allergens 1.5 Cooking time 1.6 Side dishes 2. Items on specials or promos May include: 2.1 House specials 2.2 Soup of the day 2.3 Combo meals 2.4 Best sellers 2.5 Chef’s pick 2.6 Seasonal items 3. General categories in the menu May include: 3.1 Meat 3.2 Vegetable 3.3 Dessert 3.4 Beverages 3.5 Entrée 3.6 Seafood 4. Standard food and beverage pairings May include: 4.1 Burgers and fries 4.2 Steaks and salad 4.3 Steak and mashed potato 4.4 Dessert and coffee 4.5 Seafood with white wine 5. Descriptive words May include: 5.1 Freshly prepared 5.2 Delicately seasoned 5.3 Soft and juicy 5.4 Mouth watering 5.5 Flavorful 5.6 Spicy",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 46 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidences that the candidate: 1.1 Demonstrated ability to apply relevant food and beverage product knowledge 1.2 Provided advice on food and beverage compatibility 1.3 Demonstrated ability to apply up selling products knowledge 2. Required Knowledge 2.1 Menu familiarization 2.2 Types of Menus 2.3 Food pairing 2.4 Beverage pairing 2.5 Suggestive selling techniques and principles 2.6 Upselling techniques 2.7 Food allergens 3. Required Skills 3.1 Basic communication skills 3.2 Ability to apply selling techniques 3.3 Ability to make suggestions and recommendations in line with customer wants and needs 4. Resource Implications The following resources MUST be provided: 4.1 Menu 4.2 Order taking systems 5. Methods of Assessment Competency may be assessed through: 5.3 Practical demonstration or 5.4 Simulation/role plays to test the candidate’s knowledge and skills in suggestive selling and up selling 6. Context for Assessment Assessment must be conducted in 6.1 Workplace or simulated work environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 47 UNIT OF COMPETENCY : PROVIDE FOOD AND BEVERAGE SERVICES TO GUESTS UNIT CODE : TRS5123 90 UNIT DESCRIPTOR : This unit deals with the knowledge and skills required in the provision of food and beverage service to guests in various types of dining venues and diverse styles of service. This unit focuses on the procedures in the delivery of food and beverages to the guest as well as on the knowledge and skills that underpins the efficient work performance in assisting the dining guest during and after the meal service. ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 1. Serve food orders 1.1 Food orders are picked up promptly from service areas. 1.2 Food orders are checked for presentation and appropriate garnish and accompaniments. 1.3 Food orders are served to the guests who ordered them. 1.4 Food orders are served and cleared with minimal disturbance to the other guests and in accordance to hygienic requirements. 1.5 Food orders are served in accordance with the enterprise serving style standards. 1.6 Name of the dish or order is mentioned upon serving the guest. 1.7 Sequence of service and meal delivery is monitored in accordance with enterprise procedures. 2. Assist the diners 2.1 Additional requests or needs of the guests are anticipated. 2.2 Additional food and beverage are offered and served at the appropriate times. 2.3 Necessary condiments and appropriate tableware are provided based on the food order. 2.4 Delays or deficiencies in service are recognized and followed up promptly based on enterprise policy. 2.5 The “3-minute check” is conducted to check guest‘s satisfaction. 2.6 Children and guests with special needs are treated with extra attention and care.",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 48 ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 3. Perform banquet or catering food service 3.1 Service ware are prepared and checked for completeness ahead of time. 3.2 Tables and chairs are set up in accordance with the event requirements. 3.3 Food is served according to general service principles. 3.4 Food is handled based on food safety procedures. 3.5 Coordinated service of meal courses is ensured. 3.6 Assigned areas are kept clean in accordance with enterprise procedures. 3.7 Tables are cleared and soiled dishes prepared to be brought for dishwashing after the event or function, 3.8 Number of guests being served is noted and monitored. 4. Serve Beverage Orders 4.1 Beverage orders are picked up promptly from the bar. 4.2 Beverage orders are checked for presentation and appropriate garnishes. 4.3 Beverages are served at appropriate times during meal. 4.4 Beverages are served efficiently according to established standards of service. 4.5 Beverages are served at the right temperature. 4.6 For full bottle wine orders, wine is opened efficiently with minimal disturbance to the other guests. 4.7 Wine service is carried out in accordance with establishment procedures. 4.8 Coffee and/or tea service is carried out in accordance with establishment procedure. 5. Process payments and receipts 5.1 Bills are prepare and processed accurately in coordination with cashier. 5.2 Amount due is verified with customer. 5.3 Cash and non-cash payments are accepted and receipts are issued. 5.4 Change are given as required. 5.5 Required documentation is completed in accordance with enterprise policy. 6. Conclude food service and close down dining area 6.1 Soiled dishes are removed when guests are finished with the meal. 6.2 Food scraps are handled in accordance with hygiene regulations and enterprise procedures. 6.3 Equipment are cleaned and stored in accordance with hygiene regulations and enterprise procedures. 6.4 Tables are cleared, reset and made ready for the next sitting when guests are finished with the meal. 6.5 Guests are thanked and given a warm farewell. 6.6 Electrical equipment are turned off where appropriate.",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 49 ELEMENT PERFORMANCE CRITERIA Italicized items are elaborated in the Range of Variables 7. Manage intoxicated persons 7.1 Levels of intoxication of customers are determined 7.2 Difficult situations are referred to an appropriate person 7.3 Appropriate procedures are applied to the situation and in accordance with enterprise policy 7.4 Legislative requirements are applied",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 50 RANGE OF VARIABLES VARIABLE SCOPE 1. Serving styles May include: 1.1 American Service (Plate Service) 1.2 Russian Service (Platter Service) 1.3 Buffet Service 2. Sequence of service May include: 2.1 Welcoming/Greeting of guest 2.2 Seating the guest 2.3 Taking beverage orders 2.4 Presenting the menu 2.5 Taking food orders 2.6 Wine service 2.7 Serving food orders 2.8 Crumbling/brushing table 2.9 Coffee/tea service 2.10 Preparing and presenting the bill 3. 3-Minute Check May include: 3.1 Ensure guest satisfaction about their meals 3.2 Replenish condiments 3.3 Providing additional items 3.4 Clear unused items 4. Guests with special needs May include: 4.1 Children 4.2 Elderly people 4.3 Persons with Disability 4.4 VIP guests 5. General service principles May include: 5.1 Never reach in front of the guest when serving another. 5.2 Do not place dirty, chipped, cracked tableware before the guest. 5.3 Handle flatware/ cutleries and glassware properly 5.4 Glasses should never be filled too full. 5.5 Glasses are handled by the base or the stem. 5.6 Crumb table when necessary. 6. Beverages May include: 6.1 Alcoholic beverages 6.2 Non-Alcoholic beverages (e.g. juices, sodas, coffee, tea) 7. Wine service May include: 7.1 Presenting the wine. 7.2 Opening wine 7.3 Pouring wine 8. Cash payments May include: 8.1 Payment in notes and coins 8.2 Payment in a foreign currency 8.3 Calculating currency exchange rates",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 51 VARIABLE SCOPE 9. Non-cash payments May include: 9.1 Debit and credit cards 9.2 Checks (Personal, business, travelers) 9.3 In-house vouchers 9.4 Charges to company accounts 10. Receipts issued May include: 10.1 Issuing receipts via cash register/terminal 10.2 Issuing handwritten receipt 10.3 Complying with legal requirements of host country to provide receipt 11. Required documentation May include: 11.1 Internal documentation 11.2 External agent documentation",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 52 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidences that the candidate: 1.1 Performed the various styles of food service 1.2 Demonstrated service principles 1.3 Explained the sequence of service 1.4 Performed the “3-minute” check 1.5 Described how to handle guests with special needs 1.6 Opened wine bottles in front of a guest 1.7 Described banquet service 1.8 Explained closing duties 1.9 Processed payments and receipts during the trade 1.10 Managed intoxicated persons 2. Required Knowledge 2.1 Different Food service styles 2.2 General service principles 2.3 Sequence of service 2.4 Handling guests with special needs 2.5 Wine knowledge and service 2.6 Banquet service 2.7 Food safety principles 3. Required Skills 3.1 Food service styles 3.2 Carrying plates and trays 3.3 Presenting and opening wines 3.4 Beverage service 4. Resource Implications The following resources MUST be provided: 4.1 Different kinds of tableware: dinnerware, glassware, flatware, hollowware 4.2 Wines (unopened bottles) 4.3 Bar tools (e.g. Corkscrew or wine opener) 4.4 Dining room/restaurant equipment e.g Coffee pots, dumbwaiter (stand) 5. Methods of Assessment Competency may be assessed through: 5.1 Written and/or oral questions to test candidate’s knowledge on: 5.1.1 The sequence of service 5.1.2 Different food service styles 5.1.3 Banquet service 5.1.4 Beverage service 5.1.5 Assisting the dining guests 5.2 Demonstration with questioning on 5.2.1 Sequence of service 5.2.2 Food service styles 5.2.3 How to present, open and serve wine in front of the guest 6. Context for Assessment Assessment must be conducted in 6.1 Workplace or simulated work environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 53 UNIT OF COMPETENCY : PROVIDE ROOM SERVICE UNIT CODE : TRS5123 91 UNIT DESCRIPTOR : This unit deals with the knowledge and skills required in the provision of food and beverage service particularly in the guest room of a commercial accommodation establishment. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Take and process room service orders 1.1 Telephone call is answered promptly and courteously in accordance with customer service standards. 1.2 Guests’ name is checked and used throughout the interaction 1.3 Details of orders are clarified, repeated and checked with guests for accuracy 1.4 Suggestive selling techniques are used. 1.5 Guests are advised of approximate time of delivery 1.6 Relevant information are recorded and checked in accordance with establishment policy and procedures 1.7 Room service orders received from doorknob dockets are interpreted accurately. 1.8 Orders are promptly transferred and relayed to appropriate location for preparation. 2. Set up trays and trolleys 2.1 Room service equipment and supplies are prepared in accordance with establishment procedures. 2.2 Proper room service equipment and supplies are selected and checked for cleanliness and condition. 2.3 Trays and trolleys are set up keeping in mind balance, safety and attractiveness. 2.4 Room service trays or trolleys are set up according to the food and beverage ordered 2.5 Orders are checked before leaving the kitchen for delivery. 2.6 Food items are covered during transportation to the room. 3. Present and serve food and beverage orders to guests 3.1 The guest’s name is verified on the bill before announcing the staff’s presence outside the door. 3.2 Guests are greeted politely in accordance with the with establishment’s service procedures. 3.3 Guests are asked where they want the tray or trolley positioned. 3.4 Food orders are delivered on the time desired by the guest. 4. Present room service account 4.1 Guests’ accounts are checked for accuracy and presented in accordance with establishment procedures 4.2 Cash payments are acknowledged and then presented to the cashier for processing in accordance with establishment guidelines 4.3 For charge accounts, guests are asked to sign the bills.",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 54 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 5. Clear away room service equipment 5.1 Procedure to take away the tray or trolley when the guests have finished their meal is explained. 5.2 Floors are checked and cleared in accordance with establishment policy and guidelines. 5.3 Dirty trays are cleared in accordance with the establishment’s procedure. 5.4 Trays and trolleys are cleaned and returned to the room service area.",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 55 RANGE OF VARIABLES VARIABLE RANGE 1. Relevant information May include: 1.1 Name of the guest 1.2 Room number 1.3 Number of persons 1.4 Detailed food orders 1.5 Time the order was taken 1.6 Time for delivery 2. Room service equipment and supplies May include: 2.1 Trays and trolleys 2.2 Toasters 2.3 Tableware and appointments 2.4 Warming equipment 2.5 Linen 2.6 Printed materials 3. Set-ups for room service trays and or trolleys May include: 3.1 Butters 3.2 Condiments 3.3 Cutlery 3.4 Glassware 3.5 Beverages 3.6 Linen",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 56 EVIDENCE GUIDE 1. Critical aspects of Competency Assessment requires evidences that the candidate: 1.1 Took room service orders properly 1.2 Recorded and processed room service orders accurately 1.3 Set up a variety of room service meals according to ordered food and beverage 1.4 Presented and served room service orders 2. Required Skills 2.1 Take room service orders 2.2 Setting up trays or trolleys 2.3 Suggestive selling 3. Required Knowledge 3.1 Room service procedures 3.2 Suggestive selling 4. Resource Implications The following resources MUST be provided: 4.1 Food and beverage room service supplies and equipment 4.2 Room service menu 4.3 Room service tableware and appointments 5. Methods of Assessment Competency may be assessed through: 5.1 Demonstration with questioning of the candidate taking a room service orders and preparing a room service tray. 5.2 Role play on the whole room service procedure 6. Context for Assessment Assessment must be conducted in: 6.1 Workplace or simulated work environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 57 UNIT OF COMPETENCY : RECEIVE AND HANDLE GUEST CONCERNS UNIT CODE : TRS5123 92 UNIT DESCRIPTOR : This unit deals with the knowledge and skills required in receiving and handling guest complaints. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Listen to the complaint 1.1 The entire story or issue of concern is obtained from the guest without interruption. 1.2 Details of the guest complaint or concern are noted. 1.3 Full attention is given to the complaining guest. 1.4 Guest complaint is paraphrased to determine if the concern is correctly understood. 2. Apologize to the guest 2.1 Sincere apology is offered for the disservice. 2.2 Empathy is shown to the guest to show genuine concern and consideration. 2.3 Excuses or blaming others are avoided. 2.4 Gratitude is expressed to the guest for bringing the matter up for attention. 3. Take proper action on the complaint 3.1 Appropriate action is taken regarding guest’s concerns. 3.2 The right person or department who can solve the problem is informed for proper action. 3.3 Difficult situations or serious concerns are elevated or referred to higher authority. 3.4 Problem is followed-up to check whether it solved or not. 4. Record complaint 4.1 Complaints are documented according to the establishment standard procedures. 4.2 Persons concerned are recognized and actions taken are recorded. 4.3 Feedback received from guests is logged and collated.",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 58 RANGE OF VARIABLES VARIABLE RANGE 1. Guest complaint May include: 1.1 Undelivered promise 1.2 Poor condition of property 1.3 Dirty property 1.4 Poor service 1.5 Unfriendly personnel 2. Empathy May include: 2.1 Agree truthfully to minor points 2.2 Express sincere regret 2.3 Thank the guest for bringing up the matter 2.4 Do not take offense when guest complains 2.5 Approach with friendly spirit 3. Appropriate actions May include: 3.1 Product replacements 3.2 Correction 3.3 Addition 3.4 Proper endorsement",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 61
                },
                "type": "Document"
            },
            {
                "page_content": "TESDA - SOP - QSO - 01-F08 TR – Food and Beverage Services NC II (Amended) Promulgated December 2013 59 EVIDENCE GUIDE 1. Critical aspects of Competency Assessment requires evidences that the candidate: 1.1 Listened and obtained the entire story or complaint 1.2 Paraphrased the guest complaint 1.3 Showed empathy towards complaining guest 1.4 Took action on the guest complaint 1.5 Recorded complaint 2. Required Knowledge 2.1 General service principles / Standards of service 2.2 Sequence of service 2.3 Handling guests with special needs 2.4 Dealing with difficult customer/clients 3. Required Skills 3.1 Listening skills 3.2 Basic problem solving skills 3.3 Effective communication skills 3.4 Summarizing and paraphrasing 4. Resource Implications The following resources MUST be provided: 4.1 Actual documents or records of guest complaints 4.2 Feedback forms 5. Methods of Assessment Competency may be assessed through: 5.1 Role play/Simulation to test candidate’s knowledge and skills in listening to guest complaints, paraphrasing concerns and taking action on the guest complaint. 6. Context for Assessment Assessment may be conducted in: 6.1 Workplace or simulated work environment or 6.2 TESDA accredited assessment center/venue",
                "metadata": {
                    "source": "datasets\\raw\\Food and Beverage Services NC II.pdf",
                    "page": 62
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Food Processing NC II",
        "core_competencies": [
            {
                "page_content": "TR- Food Processing NC II 46 CORE COMPETENCIES UNIT OF COMPETENCY: PROCESS FOODS BY SALTING, CURING AND SMOKING UNIT CODE: AGR741301 UNIT DESCRIPTOR: This unit deals with the skills, knowledge and attitudes required to process foods by Salting, Curing and Smoking ELEMENTS PERFORMANCE CRITERIA Bold, italicized terms are elaborated in the Range of Variables 1. Prepare Equipment, Tools, Materials and Utensils 1.1 Equipment and tools for salting, curing and smoking are prepared in accordance with manufacturer’s specifications. 1.2 Equipment for the above food processing methods are checked, sanitized and calibrated in accordance with manufacturer’s specifications. 1.3 Kitchen utensils for the above food processing methods are readied and sanitized in accordance with manufacturer’s specifications. 1.4 Office equipment and materials/supplies needed are prepared in accordance with approved specifications. 2. Prepare the Raw Materials 2.1 Raw materials are sorted and graded in accordance with specifications 2.2 Eggs for salting are cleaned and washed in accordance with approved standard procedures. 2.3 Poultry for curing are skinned, eviscerated and washed in accordance with approved specifications and standard procedures. 2.4 Meat for curing are deskinned, deboned, sliced, chopped and minced in accordance with approved specifications and standard procedures. 2.5 Fish/other marine products are cleaned, descaled, eviscerated, deboned, filleted and washed in accordance with approved specifications and standard procedures. 2.6 Cleaned raw materials are weighed in accordance with approved specifications",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 47 3. Prepare Salting and Curing Solutions and Mixtures 3.1 Required salt and other ingredients and adjuncts for salting and curing are measured and weighed in line with approved specifications and OHS requirements 3.2 Required ingredients for pumping pickle, cover pickle and dry cure mixture are measured and weighed in line with approved specifications 4. Cure the Materials 4.1 Curing mixture and prepared materials are mixed in accordance with approved specifications and enterprise requirements 4.2 Mixture is allowed to be cured at room temperature or refrigerated temperature at appropriate number of days. 4.3 Materials being cured are kept submerged in solution to obtain even distribution/penetration of cure mixture in line with approved specifications 5. Finish the Cured Materials 5.1 Cured food materials are removed from the solution, washed and drained in accordance with standard operating procedures 5.2 Drained cured materials are cooked in appropriate cooking medium 5.3 Cooked cured products are smoked according to specifications 5.4 Cooked cured smoked products are transferred to containers and cooled according to specifications 5.5 Salted eggs are hard boiled then dipped in grana solution according to approved specifications 6. Prepare Production Report 6.1 Daily production input is noted and documented according to standard operating procedures. 6.2 Daily production output is noted and documented according to standard operating procedures. 6.3 All production data are recorded and presented according to prescribed format.",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 48 RANGE OF VARIABLES VARIABLE SCOPE 1. Equipment, Tools and Materials 1.1 Salting, Curing and Smoking equipment and materials may include but not limited to: 1.1.1 Smokehouse 1.1.2 Polysealer 1.1.3 Soaking vats 1.1.4 Chiller/refrigerator/freezer 1.1.5 Oven 1.1.6 Salinometer 1.1.7 Jack lifts, trolleys and wheelers 1.1.8 Weighing scales of varying capacities and sensitivities 1.1.9 Cutting implements like knives, slicers, peelers 1.1.10 Fuel for smoking like wood, wood shavings, half-dried leaves, coconut husks & shells, rice hulls, corn cobs, sawdust 1.2 Office equipment, supplies may include but not limited to the following: 1.2.1 Computer with printer 1.2.2 Calculator 1.2.3 Overhead projector 1.2.4 Bond papers 1.2.5 Computer papers 1.2.6 Note pads 1.2.7 Pencils/ball pen 1.2.8 Index cards 1.2.9 Clips 1.2.10 Folders 1.2.11 Clip pads 1.2.12 Reporting and recording forms/logbooks 1.2.13 Adhesive tapes. 1.2.14 Bulletin boards 1.2.15 White boards and white board markers 1.2.16 Chalks 1.2.17 Pentel pens 2. Food Processing Methods Food Processing methods involved in this Unit of Competency is limited to: 2.1 Salting 2.2 Curing 2.3 Smoking",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 49 3. Kitchen Utensils Kitchen utensils include but not limited to: 3.1 Casseroles 3.2 Mixing bowls 3.3 Chopping boards 3.4 Colander 3.5 Saucepans 3.6 Utility trays 3.7 Food tongs 4. Raw Materials Raw materials include: 4.1 Fresh eggs 4.2 Dressed poultry 4.3 Fresh meat 4.4 Fish/other marine products 5. Ingredients Ingredients may include but not limited to: 5.1 Salt 5.2 Sugar 5.3 Condiments 5.4 Spices 5.5 Herbs 5.6 Grana solutions 6. OHS requirements Occupational Health and Safety requirements may include: 6.1 Health/medical certificate 6.2 Dole requirements 6.3 Personal hygiene & good grooming 6.4 Plant sanitation & waste management 6.5 BFAD requirements 6.6 PPE requirements 6.6.1 apron/laboratory gown 6.6.2 mouth masks 6.6.3 gloves 6.6.4 rubber boots, 6.6.5 head gears such as caps, hairnets, ear plug 7 Production Data Production data include: 7.1 Production input 7.2 Production output 7.3 Production target 7.4 Production schedule",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 50 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1 Prepared, cleaned, checked and sanitized the equipment, tools, materials and utensils used for salting, curing and smoking meat, eggs poultry and fish/other marine products 1.2 Followed the procedures and techniques in salting, curing and smoking 1.3 Followed BFAD & GRAS approved least minimum and maximum levels of usage for food and curing mixes 1.4 Calibrated and operated equipment 1.5 Cleaned and stowed equipment, tools, and utensils after using 2. Underpinning Knowledge 1.1 Safety Practices 2.1.1 Environmental protection and concerns 2.1.2 Food safety principles and practices 2.1.3 Food handling practices 2.1.4 Proper waste disposal 2.1.5 Good grooming & personal hygiene 2.2 Communication 2.2.1 Preparation of daily production input report (spoilage and rejects) 2.2.2 Preparation of daily production output report (yields and recoveries) 2.2.3 Recording and documenting of production data 2.2.4 Reporting of defects/breakdown to immediate head/supervisor 2.3 Equipment, Tools/Instruments and Utensils: Uses and Specifications 2.3.1 Parts and functions of equipment, tools/instruments and utensils 2.4 Systems, Processes and Operations 2.4.1 Preparing raw materials 2.4.2 Cut-out procedures and techniques 2.4.3 Recycling/by-product utilization 2.4.4 Sorting and grading of raw materials 2.4.5 Curing procedures and techniques 2.4.6 Salting procedures and techniques 2.4.6 Smoking procedures and techniques 2.4.7 Operating various equipment, tools and utensils",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II\n51 2.5 Codes and Regulations\n2.5.1 TQM and Food Quality Systems Principles\n2.5.2 Hazard Analysis Critical Control Points\n2.5.3 ISO and EMS\n2.5.4 Good Manufacturing Practices\n2.6 Materials: Uses and Specifications\n2.6.1 Raw materials and ingredients\n2.6.2 Fuel for smoking\n2.6.3 Office supplies like bond paper, computer papers, note pads\n2.6.4 Salting and curing solutions and mixtures\n2.7 Mathematics and Measurements\n2.7.1 Weights, measures, conversions, percentages, ratios and proportions\n2.7.2 Basic accounting procedures and techniques\n2.7.3 Basic arithmetical operations like multiplication, division, addition and subtraction\n2.8 Maintenance\n2.8.1 Maintaining the various equipment, tools and utensils\n2.8.2 Calibrating weighing scale and various equipment\n2.8.3 Proper cleaning and stowing of equipment, tools and utensils\n3. Underpinning Skills\n3.1 Oral and written communication skills\n3.2 Calibrating skills\n3.3 Basic computer skills\n3.4 Cooking/culinary skills\n3.5 Basic mathematical skills (conversion, percentage and formulation)\n3.6 Recording and reporting skills\n3.7 Preparing flow diagrams/flow charts\n3.8 Conducting cut-out tests\n3.9 Sanitary food handling practices\n3.10 Computation of yields and recoveries\n4. Underpinning Attitudes\n4.1 Self-esteem\n4.2 Punctual/Time conscious\n4.3 Cost conscious\n4.4 Environmental and pollution conscious\n4.5 Flexible/adaptable\n4.6 Honest\n4.7 Socially responsible\n4.8 Dependable\n4.9 Innovative",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 52 4.10 Alert 4.11 Systematic and organized 4.12 Committed 4.13 Good listener and fast learner 4.14 Creative 4.15 Resourceful 4.16 Self–starter 4.17 Nationalistic and patriotic 5. Methods of Assessment Competency in this unit must be assessed using at least two (2) of the following methods: 5.1 A combination of direct observation and questioning of a candidate processing foods by salting, curing and smoking including preparation of equipment, tools and utensils, preparation of raw materials and salting/ curing solutions/mixtures 5.2 Written report on the preparation of daily production input and output and other production data 5.3 Written test 5.4 Portfolio 6. Resource Implications The following resources should be provided: 6.1 Specific work area/station 6.2 Equipment, tools and utensils to be prepared for salting, curing and smoking 6.3 Fruits, vegetables, fish/other marine products, meat, poultry and eggs to be processed by salting, curing and smoking 6.4 Materials relevant to the proposed activity 7. Context of Assessment 7.1 Assessment should occur on the job or in a simulated workplace.",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 53 UNIT OF COMPETENCY: PROCESS FOODS BY FERMENTATION AND PICKLING UNIT CODE: AGR741302 UNIT DESCRIPTOR: This unit deals with the skills, knowledge and attitudes required to process foods by Fermentation and Pickling ELEMENTS PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare Equipment, Tools and Utensils 1.1 Equipment, tools and utensils for fermentation and pickling are selected according to requirements 1.2 Equipment, tools and utensils are checked and calibrated in accordance with manufacturer’s specifications 1.3 Equipment/utensils for the above food processing methods are readied and sanitized according to manufacturer’s specifications 2. Prepare Raw Materials 2.1 Raw materials are sorted and graded according to approved criteria and enterprise requirements 2.2 Sorted and graded fresh fruits and vegetables are weighed, washed, peeled, cut and sliced according to required sizes and shapes 2.3 Fish and other marine products are cleaned, eviscerated, cut and washed according to specifications. 3. Perform Alcoholic Fermentation of Fruits/Vegetables 3.1 Prepared fruit is mixed with water according to specifications 3.2 Mixture is allowed to boil and juice is extracted in accordance with specifications and enterprise requirements 3.3 Extracted juice is cooled and mixed with other ingredients like sugar and yeast in accordance with specifications 3.4 Juice is fermented for 1-2 weeks as required 3.5 Fermented juice is strained, filtered and heated according to specifications",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II\n54 4. Perform Acetic Acid/ Lactic Acid Fermentation/pickling of Vegetables\n4.1 Alcoholic liquid is mixed with mother vinegar according to specifications\n4.2 Mixture is allowed to ferment for 2-4 weeks according to standard procedures\n4.3 Mixture is strained/filtered then clarified according to specifications\n4.4 Acetous liquid is heated according to specifications\n5. Ferment Fish and Other Marine Products\n5.1 Fish and other marine products are mixed with required salt according to mixing requirements\n5.2 The mixture of fresh and other marine products and salt are left to ferment for 1-2 weeks in fermentation vats/vessels according to standard procedures\n5.3 Fish paste/fish sauce are heated according to standard procedures\n6. Prepare Production Report\n6.1 All production data gathered are presented in prescribed format to include: Daily production input (spoilage, rejects and variances) and daily production output (yield, recoveries and variances)",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 55 RANGE OF VARIABLES VARIABLE RANGE 1. Equipment, Tools, Utensils and Materials Equipment, tools and kitchen utensils for this unit of competency include: 1.1 Cold storage equipment like chiller, refrigerator, freezer 1.2 Jack lifts and trolleys 1.3 Weighing scale of various capacities and sensitivities 1.4 Fermentation vats 1.5 Sealers (can and plastic) 1.6 Cutting implements such as knives, peelers, slicer, cutter 1.7 Kitchen utensils like casserole, colanders, bowls, food tongs 1.8 Strainers, basting spoon paddle, steamer exhauster 1.9 Exhaust box, steam jacketed kettle lifter, wire baskets, chopping boards, vegetable cutter, osterizer 1.10 Office equipment such as computer with printer, intercom 1.11 Office materials like bond papers, computer papers, note pads, pencils/ball pen, index cards, clips, folders, clip pads, reporting and recording forms/logbooks, adhesive tapes. 1.12 Bulletin boards, white boards, chalks, white board markers, pentel pens 2. Food Processing Methods Food processing methods specified in this Unit of Competency is limited to: 2.1 Fermentation 2.2 Pickling 3. Raw Materials Raw materials in this Unit of Competency include: 3.1 Fresh fruits 3.2 Fresh vegetables 3.3 Fresh fish 3.4 Other marine products 4. Sorting/Grading Criteria 4.1 Fresh fruits and vegetable crops are sorted and graded according to: 4.1.1 size 4.1.2 shape 4.1.3 maturity 4.1.4 degree of ripeness 4.1.5 presence/absence of defects/damaged parts",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II\n56 4.2 Fish and other marine products are checked and sorted according to:\n4.2.1 degree of freshness\n4.2.2 level of spoilage\n4.2.3 quality of eyes, gills and scales\n5. Ingredients\nIngredients include but not limited to:\n5.1 Refined sugar\n5.2 Salt\n5.3 Water\n5.4 Pickling solution\n5.5 Spices\n5.6 Herbs\n5.7 Condiments\n6. Production Data\nProduction data include:\n6.1 Production input\n6.2 Production output\n6.3 Production target\n6.4 Production schedule",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 57 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1 Prepared the equipment, tools, and utensils used for fermenting fruits, vegetables, fish and other marine products 1.2 Prepared equipment, tools and utensils used for pickling fruits and vegetables 1.3 Cleaned and sanitized equipment, tools and utensils used for fermenting and pickling 1.4 Operated the various equipment 1.5 Prepared, sorted and graded raw materials 1.6 Performed alcoholic fermentation of fruits and vegetables 1.7 Performed lactic acid fermentation/pickling of vegetables 1.8 Fermented fish and other marine products 2. Underpinning Knowledge 2.1 Safety Practices 2.1.1 Food safety principles and practices 2.1.2 Food handling practices 2.1.3 Environmental protection and concerns 2.1.4 Proper waste disposal 2.1.5 Good grooming & personal hygiene 2.2 Communication 2.2.1 Preparation of daily production input report (spoilage, rejects and variances) 2.2.2 Preparation of daily production output (yield, recoveries and variances) 2.2.3 Recording and documenting of production data 2.2.4 Reporting of defects/breakdown to immediate head/supervisor 2.3 Mathematics/Measurements 2.3.1 Basic accounting procedures and techniques 2.3.2 Measures, conversions, weights and percentages and ratios 2.3.3 Basic arithmetic operations (multiplication, division, addition, subtraction) 2.4 Codes and Regulations 2.4.1 TQM and other good food quality system principles 2.4.2 HACCP, ISO & EMS 2.4.3 Good Food Manufacturing Practices",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II\n58 2.5 Equipment, Tools/Utensils and Utensils: Uses and Specifications\n2.5.1 Parts and functions of equipment, tools and utensils\n2.6 Materials: Uses and Specifications\n2.6.1 Raw materials\n2.6.2 Ingredients and spices\n2.7 Systems, Processes and Operations\n2.6.3 Basic computer operation (Microsoft word)\n2.6.4 Cut-out procedures and techniques\n2.6.5 Fermentation methods and techniques\n2.6.6 Pickling procedures and techniques\n2.7.5 Operating various equipment\n2.7.6 Recycling/by-product utilization\n2.7.7 Sorting and grading of raw materials\n2.8 Maintenance\n2.8.1 Maintaining various equipment, tools, and utensils\n2.8.2 Calibrating weighing scale and equipment\n2.8.3 Proper cleaning and stowing of equipment, tools and utensils\n3. Underpinning Skills\n3.1 Communication skills (oral & written)\n3.2 Calibrating skills\n3.3 Basic computer skills\n3.4 Cooking/culinary skills\n3.5 Basic mathematical skills (conversion, weights and measurements, ratios and proportions)\n3.6 Recording and reporting skills\n3.7 Preparing process flow charts/flow diagrams\n3.8 Cut-out test\n3.9 Sanitary food handling practices\n3.10 Computation for recovery/yields\n4. Underpinning Attitudes\n4.1 Self-esteem\n4.2 Time conscious/punctual\n4.3 Cost conscious\n4.4 Environment and pollution conscious\n4.5 Flexible/adaptable\n4.6 Honest\n4.7 Socially responsible\n4.8 Dependable\n4.9 Self-starter\n4.10 Alert\n4.11 Systematic and organized",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II\n59 4.12 Committed \n4.13 Good team worker \n4.14 Good listener and fast learner \n4.15 Creative \n4.16 Nationalistic and patriotic \n5. Methods of Assessment \nCompetency in this unit must be assessed using at least two (2) of the following methods: \n5.1 A combination of direct observation and questioning of a candidate fermenting fish and other marine products and pickling of vegetables including preparation of equipment utensils, preparation, sorting and grading of raw materials \n5.2 Written report on the preparation of daily production input and output and other production data \n5.3 Written test \n5.4 Portfolio \n6. Resource Implications \nThe following resources should be provided: \n6.1 Work area/ station \n6.2 Equipment, tools and utensils to prepare and to process fruits, vegetables, meat, fish and other marine products by fermentation and pickling \n6.3 Materials relevant to the proposed activity \n7. Context of Assessment \n7.1 Assessment should occur on the job or in a simulated workplace.",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 60 UNIT OF COMPETENCY: PROCESS FOODS BY SUGAR CONCENTRATION UNIT CODE: AGR741303 UNIT DESCRIPTOR: This unit deals with the knowledge, skills and attitudes required to process foods by Sugar Concentration ELEMENTS PERFORMANCE CRITERIA italicized terms are elaborated in the Range of Variables 1. Prepare Equipment, Tools and Utensils 1.1. Equipment, tools and utensils for preserving foods by sugar concentration are prepared in accordance with manufacturer’s manual 1.2 Equipment, tools and utensils are calibrated in accordance with manufacturer’s specifications 1.3 Equipment, tools and utensils for preserving foods by sugar concentration are readied and sanitized as required. 2. Prepare the Raw Materials 2.1 Availability of raw materials are checked according to required food processing methods 2.2 Sorted fruits and vegetables are washed, peeled, sliced and cut according to required sizes and shapes 2.1 Prepared fruits and vegetables for jelly/jam and marmalade are chopped finely 2.2 Prepared fruits and vegetables for jelly and marmalade making are boiled to obtain the juice extract 2.3 Prepared finely chopped fruits and vegetables for jam making are mixed with sugar 2.4 Prepared fruits and vegetables to be preserved are cooked in syrup as specified 3. Prepare Acid, Pectin and Sugar Mixture 3.1 Required amounts of pectin, sugar and citric acid are measured according to approved specifications 3.2 Measured pectin, acid and sugar are mixed with chopped fruit pulp/juice extract/pieces of fruits according to approved specifications",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 61
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II\n61 4. Cook Sugar Concentrates\n4.1 Mixture is heated and boiled/cooked to required consistency\n4.2 Desired endpoint is checked/tested as specified\n5. Prepare Production Report\n5.1 Daily production report input, output and variances are documented according to enterprise requirements\n5.2 All production data gathered are recorded and presented in prescribed format",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 62
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 62 RANGE OF VARIABLES VARIABLES RANGE 1. Equipment, Tools, Kitchen Utensils and Materials Equipment, tools and kitchen utensils and materials may include but not limited to: 1.1 Cold storage equipment like chiller, refrigerator, freezer 1.2 Refractometer, candy thermometer, jelly thermometer, polmeter 1.3 Weighing scale of various capacities and sensitivities 1.4 Jack lifts and trolleys 1.5 Cutting implements such as knives, peelers, slicer, cutter 1.6 Cooking equipment like stove/burner 1.7 Cooking utensils like stainless enameled plastic casserole, colanders, bowls, food tongs, steamer 1.8 Strainers, basting spoon paddle, exhauster, spatula 1.9 Exhaust box, steam jacketed kettle, jar lifter, wire baskets, chopping boards, vegetable cutter, osterizer, juice extractor 1.10 Office equipment like computer with printer, intercom/telephone, fax machine, overhead projector 1.11 Office materials/supplies include bond paper, index cards, production report forms, white board, white board markers, white board erasers, folder, blank sticker label, note pad, pencils/ball pen 1.12 PPE include apron, mouth masks, gloves and rubber boots, headgears such as caps, hairnets and ear plugs 2. Raw Materials Raw materials in this Unit of Competency may include but not limited to: 2.1 Fresh fruits and vegetables 2.2 Sugar, salt and water 2.3 Chemical additives and preservatives like firming agent, sodium benzoate, citric acid/ascorbic acid 3. Food Processing Methods Food Processing Method in this Unit of Competency is limited to Processing of foods by sugar concentration 4. Production Data Production data include: 4.1 Production input 4.2 Spoilage 4.3 Rejects 4.4 Production output 4.5 Yields 4.6 Recoveries 4.7 Variances 4.8 Production target 4.9 Production schedule",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 63
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 63 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1 Prepared raw materials and other ingredients used to preserve fruits and vegetables by sugar concentration 1.2 Cleaned and sanitized equipment, tools and utensils used to preserve fruits and vegetables by sugar concentration 1.3 Operated various equipment and utensils according to approved specifications 1.4 Calibrated equipment 1.5 Checked and adjusted the pectin acid and sugar of the prepared raw materials 1.6 Cooked sugar concentrates to desired endpoint 2. Underpinning Knowledge 2.1 Safety Practices 2.1.1 Proper waste disposal 2.1.2 Environmental protection and concerns 2.1.3 Food safety principles and practices 2.1.4 Food Handling practices 2.1.5 Good Grooming & Personal hygiene 2.2 Communication 2.2.1 Preparation of daily production input report 2.2.2 Preparation of daily production output report 2.2.3 Recording and documenting production data 2.3 Mathematics and Measurements 2.3.1 Measures and conversions 2.3.2 Basic accounting procedures 2.3.3 Ratios, proportions and percentages 2.3.4 Pearson’s square 2.4 Codes and Regulations 2.4.1 TQM and other good food quality system principles 2.4.2 ISO, HACCP, EMS 2.4.3 Good Food Manufacturing Practices 2.5 Tools and Equipment: Uses and Specifications 2.5.1 Parts and functions of equipment, tools and utensils for processing foods by sugar concentration 2.5.2 Parts and functions of office equipment 2.5.3 Parts and functions of personal protective equipment",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 64
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 64 2.6 Materials: Uses and Specifications 2.6.1 Raw materials 2.6.2 Packing medium 2.6.3 Office supplies and equipment 2.7 Systems, Processes and Operations 2.7.1 Operating various equipment 2.7.2 Preparing tools and utensils 2.7.3 Sorting and grading of raw materials 2.7.4 Procedures & techniques in preserving fruits and vegetables by sugar concentration 2.7.5 Recycling/by-product utilization 2.7.6 Cut-out procedures and techniques 2.7.7 Basic computer operation (Microsoft word) 2.8 Maintenance 2.8.1 Calibrating equipment 2.8.2 Maintaining various equipment, tools and utensils 2.8.3 Proper cleaning and stowing of equipment, tools and utensils 3. Underpinning Skills 3.1 Test for pectin content and point of cooking for jam jelly marmalade 3.2 Communication skills (oral & written) 3.3 Acid ratio adjustment and computation 3.4 Calibrating skills 3.5 Basic computer skills 3.6 Cooking/culinary skills 3.7 Basic mathematical skills, conversion, weights and measure 3.8 Recording and reporting skills 3.9 Preparing process flowcharts/flow diagrams 3.10 Cut-out test 3.11 Sanitary food handling practices 3.12 Computation for recovery/yields and variances 4. Underpinning Attitudes 4.1 Time conscious/punctual 4.2 Cost conscious 4.3 Environment and pollution conscious 4.4 Flexible/adaptable 4.5 Honest 4.6 Socially responsible 4.7 Dependable 4.8 Self-starter",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 65
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II\n65 4.9 Alert \n4.10 Systematic and organized  \n4.11 Committed  \n4.12 Good team worker  \n4.13 Good listener and fast learner  \n4.14 Creative  \n4.15 Self-esteem  \n4.16 Nationalistic/patriotic   \n5. Methods of Assessment  \nCompetency in this unit must be assessed using at least two (2) of the following methods:  \n5.1 A combination of direct observation and questioning of a candidate processing foods by sugar concentration including preparation of the following: equipment, tools, utensils, raw materials, and sugar concentrate mixtures  \n5.2 Written report on the preparation and documentation of daily production input and output and other production data  \n5.3 Written test  \n5.4 Portfolio  \n5.5 Demonstration   \n6. Resource Implications  \nThe following resources should be provided:  \n1.1 Work area/ station  \n1.2 Equipment, tools and utensils needed to prepare and to process fruits and vegetables by sugar concentration  \n1.3 Materials relevant to the proposed activity    \n7. Context of Assessment  \n7.1 Assessment should occur on the job or in a simulated workplace.",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 66
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 66 UNIT OF COMPETENCY: PACKAGE FINISHED/PROCESSED FOOD PRODUCTS UNIT CODE: AGR741304 UNIT DESCRIPTOR: This unit deals with the knowledge, skills and attitudes required to package finished/processed food products ELEMENTS PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare Packaging Equipment, Tools and Materials 1.1 Packaging materials are selected and checked according to the finished/processed food products specifications 1.2 Packaging materials of varying sizes are washed and sterilized in accordance with manufacturer’s specifications 1.3 Appropriate tools and equipment are selected according to specified packaging requirements. 1.4 Packaging equipment is checked and readied according to manufacturer’s specifications 1.5 Operation of packaging equipment is monitored to ensure conformity with specified product output. 1.6 Finished/processed products are cooled to room temperature as required. 2. Undertake Packaging of Finished/Processed Food Products 2.1 Cooled cured products are placed in appropriate packaging materials. 2.2 Salted eggs are placed in trays/boxes in accordance with specifications 2.3 Fermented/Pickled products are packaged and sealed hermetically according to enterprise requirements 2.4 Cooled processed products are wrapped clean according to specifications 2.4 Canned/bottled products are sealed hermetically according to approved specifications 2.5 Sugar concentrated finished products are hot packed in dry sterile glass bottles 2.6 Dried/dehydrated food materials are packaged in appropriate packaging materials",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 67
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II\n67\n3. Perform Post Packaging Procedures\n3.1 Packaged finished/processed food products are sealed and labeled according to specifications.\n3.2 Condition of packaged finished/processed food products is checked to ensure conformity with specified outputs.\n3.3 Packaged finished/processed food products are stored according to required temperature and humidity.",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 68
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 68 RANGE OF VARIABLES VARIABLES RANGE 1. Packaging Materials Packaging materials may include but not limited to: 1.1 Glass 1.2 Metal 1.3 Plastics 1.4 Paper and paper board 1.5 Corrugated carton 1.6 Flexibles 1.7 Wood and wood products 1.8 Composite can/containers 1.9 Indigenous materials 1.9.1. Trays 1.9.2. PE/PP bags 1.9.3. Labels 1.9.4. Stickers 1.9.5. Tags 1.9.6. Glue 1.9.7. Packaging tape 2. Packaging Tools and Equipment Packaging tools and equipment may include but not limited to: 2.1 Packaging machinery/equipment/tools 2.2 Weighing scales 2.3 Food scales 2.4 Can sealer 2.5 Plastic sealer 2.6 Pulper finisher 2.7 Plastic protect cap sealer 3. Packaging Process Packaging Process includes: 3.1 Bottling 3.2 Canning 3.3 Cartoning 3.4 Wrapping 3.5 Bagging 3.6 Labeling 3.7 Case Packing 4. Condition of Packaged Finished Food Products Condition of packaged products may be checked through: 4.1 Leak inspection 4.2 Checking of print labels 4.3 Product testing",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 69
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II 69 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1 Prepared appropriate packaging equipment and tools 1.2 Packaging materials are washed and sterilized as required 1.3 Selected and checked appropriate packaging materials according to requirements of finished/processed food products 1.4 Packaged finished/processed food products according to specifications under sanitary and hygienic conditions 1.5 Checked condition of packaged food products 1.6 Properly and safely stored the labeled packaged finished/processed product according to temperature and humidity requirements. 2. Underpinning Knowledge 2.1 Safety Practices 2.1.1 Proper waste disposal 2.1.2 Environmental protection and concerns 2.1.3 Food safety principles and practices 2.1.4 Food Handling practices 2.1.5 Good Grooming & Personal hygiene 2.2 Communication 2.2.1 Recording and documenting of production data 2.2.2 Reporting of defects/breakdown to immediate head/supervisor 2.3 Mathematics and Measurements 2.3.1 Weights, measure, conversions 2.3.2 Basic accounting procedures 2.3.3 Ratios, proportions and percentages 2.3.4 Basic mathematical operations 2.4 Codes & Regulations 2.4.1 TQM and other good food quality system principles 2.4.2 ISO, HACCP, EMS 2.4.3 Good Food Manufacturing Practices 2.5 Materials, Tools & Equipment: Uses and Specifications 2.5.1 Packaging materials and blank labels and stickers 2.5.2 Packaging equipment, tools and utensils 2.5.3 Labeling materials",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 70
                },
                "type": "Document"
            },
            {
                "page_content": "TR- Food Processing NC II\n70\n2.6 Systems, Processes and Operations  \n2.6.1 Packaging procedure and techniques  \n2.6.2 Labeling procedures and techniques  \n2.6.3 Using various packaging equipment, tools and utensils  \n3. Underpinning Skills  \n3.1 Oral & written communication skills  \n3.2 Sanitary food handling practices  \n3.3 Package checks and inspection  \n3.4 Recording and reporting skills   \n4. Methods of Assessment  \nCompetency in this unit must be assessed using at least two (2) of the following methods:  \n4.1 A combination of direct observation and questioning of a candidate packaging finished/processed food products  \n4.2 Portfolio (submission of work samples)  \n4.3 Demonstration  \n4.4 Written test   \n5. Resource Implications  \nThe following resources must be provided:  \n5.1 Work area/station  \n5.2 Equipment, tools and utensils used to package finished/processed food products  \n5.3 Materials relevant to the proposed activity and tasks   \n6. Context of Assessment  \n6.1 Assessment should occur on the job or in a simulated workplace",
                "metadata": {
                    "source": "datasets\\raw\\Food Processing NC II.pdf",
                    "page": 71
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Gas Tungsten Arc Welding (GTAW) NC II",
        "core_competencies": [
            {
                "page_content": "Weldncii11 - 3 01/04/05 43 CORE COMPETENCIES UNIT OF COMPETENCY: Weld Carbon Steel Plates Using GTAW UNIT CODE: MEE721311 DESCRIPTOR: This unit covers the skills, knowledge and attitudes required in welding carbon steel plates 1F - 4F and 1G - 4G positions using GTAW process. ELEMENTS PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Perform root pass 1.1 Root pass is performed in accordance with WPS and/or client specifications. 1.2 Task is performed in accordance with company or industry requirement and safety procedure. 1.3 Weld is visually checked for defects and repaired, as required 1.4 Weld is visually acceptable in accordance with applicable codes and standards 2. Clean root pass 2.1 Root pass is cleaned and free from defects and discontinuities 2.2 Task is performed in accordance with approved WPS 3. Weld subsequent/filling passes 3.1 Subsequent/filling passes is performed in accordance with approved WPS 3.2 Weld is visually checked for defects and repaired, as required 3.3 Weld is visually acceptable in accordance with applicable codes and standards 4. Perform capping 4.1 Capping is performed in accordance with WPS and/or client specifications 4.2 Weld is visually checked for defects and repaired, as required 4.3 Weld is visually acceptable in accordance with applicable codes and standards",
                "metadata": {
                    "source": "datasets\\raw\\Gas Tungsten Arc Welding (GTAW) NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "Weldncii11 - 3 01/04/05 44 RANGE OF VARIABLE VARIABLE RANGE 1. WPS WPS Requirements 1.1 Welding positions 1.1.1 1F – 4F 1.1.2 1G – 4G 1.2 Wall thickness 1.2.1 1.6 mm and above 1.3 Type of material 1.3.1 Carbon or mild steel 1.4 Consumables 1.4.1 Filler metal 1.4.2 Tungsten rod (type and size) 1.4.3 Shielding gas (argon or other available inert gas) 1.5 Travel speed 1.6 Current setting (polarity, amperage, voltage) 1.7 Shielding gas flow rate 1.8 Welding accessories 1.9 Joint preparation 2. Defects 2.1 Porosity 2.2 Undercut 2.3 Arc Strike 2.4 Elongated intrusion 2.5 Tungsten inclusion 2.6 Concavity/convexity 2.7 Degree of reinforcement 2.8 Burn Through 2.9 Crater cracks 2.10 Cracks 2.11 Lack of Fusion 2.12 Pinholes/Blowholes 2.13 Under Fill 2.14 Overlap 2.15 Misalignment 2.16 Distortion",
                "metadata": {
                    "source": "datasets\\raw\\Gas Tungsten Arc Welding (GTAW) NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "Weldncii11 - 3  01/04/05    45 EVIDENCE GUIDE  1.  Critical Aspects of Competency  Assessment requires evidence that the candidate welded carbon steel plates using GTAW in 2G and 3G positions to acceptable standards following the approved WPS.   2.  Underpinning Knowledge  2.1  Drawing/Plan/WPS interpretation  2.2  Materials and consumables (filler rod, tungsten rod, shielding gas, base metal)  2.3  Welding Equipment and Tools  2.4  Basic Mathematics (Multiplication, Division, Addition and Subtraction)  2.5  Welding Codes  2.6  Identification of weld defects  3.  Underpinning Skills  3.1  Measuring skills  3.2  Communication skills  3.3  Rectifying weld defects  3.4  Applying welding techniques for GTAW  3.5  Handling welding tools and equipment  3.6  Handling materials and consumables and checking purity of inert gas   4.  Resource Implications  The following resources must be provided:  4.1  GTAW facilities and equipment  4.2  Supplies and materials  4.3  PPE  4.4  Relevant documentation such as WPS and working drawing  4.5  Stand-by fire-fighting equipment  5.  Method of Assessment  Competency must be assessed through:  5.1  Observation and interview  5.2  Demonstration and interview  5.3  Written test  5.4  Portfolio  6.  Context of Assessment  Competency to be assessed while a task is being undertaken in the workplace or in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Gas Tungsten Arc Welding (GTAW) NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "Weldncii11 - 3 01/04/05 46 UNIT OF COMPETENCY: Weld Carbon Steel Pipes using GTAW UNIT CODE: MEE721312 DESCRIPTOR: This unit covers the skills, knowledge and attitudes required in welding carbon steel pipes in 2G and 5G and/or 6G positions using GTAW process. ELEMENTS PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Perform root pass 1.1 Root pass is performed in accordance with WPS and/or client specifications. 1.2 Task is performed in accordance with company or industry requirement and safety procedure. 1.3 Weld is visually checked for defects and repaired, as required 1.4 Weld is visually acceptable in accordance with applicable codes and standards 2. Clean root pass 2.1 Root pass is cleaned and free from defects and discontinuities 2.2 Task is performed in accordance with approved WPS 3. Weld subsequent/filling passes 3.1 Subsequent/filling passes performed in accordance with approved WPS 3.2 Weld visually checked for defects and repaired, as required 3.3 Weld visually acceptable in accordance with applicable codes and standards 4. Perform capping 4.1 Capping performed in accordance with WPS and/or client specifications 4.2 Weld visually checked for defects and repaired, as required 4.3 Weld visually acceptable in accordance with applicable codes standards",
                "metadata": {
                    "source": "datasets\\raw\\Gas Tungsten Arc Welding (GTAW) NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "Weldncii11 - 3 01/04/05 47 RANGE OF VARIABLE VARIABLE RANGE 1. WPS WPS Requirements 1.1 Welding positions 1.1.1 2G and 5G, and/or 6G 1.2 Pipe wall thickness 1.2.1 1.6mm and above 1.3 Type of material 1.3.1 Carbon or mild steel 1.4 Consumables 1.4.1 Filler wire (diameter) 1.4.2 Tungsten rod (type and design) 1.4.3 Shielding gas (argon and other available inert gas) 1.5 Travel speed 1.6 Current setting (polarity, amperage, voltage) 1.7 Shielding gas flow rate 1.8 Welding accessories 1.9 Joint preparation 2. Defects 2.1 Porosity 2.2 Undercut 2.3 Arc Strike 2.4 Elongated intrusion 2.5 Tungsten inclusion 2.6 Concavity/convexity 2.7 Degree of reinforcement 2.8 Burn through 2.9 Crater cracks 2.10 Cracks 2.11 Lack of Fusion 2.12 Pinholes/Blowholes 2.13 Under fill 2.14 Overlap 2.15 Misalignment 2.16 Distortion",
                "metadata": {
                    "source": "datasets\\raw\\Gas Tungsten Arc Welding (GTAW) NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "Weldncii11 - 3 01/04/05 48 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate welded carbon steel pipes using GTAW in 2G and 5G and/or 6G positions to acceptable standards following approved WPS. 2. Underpinning Knowledge 2.1 Drawing/Plan/WPS interpretation 2.2 Materials and consumables (filler rod, tungsten rod, shielding gas, base metal) 2.3 Welding Equipment and Tools 2.4 Basic Mathematics (Multiplication, Division, Addition and Subtraction) 2.5 Welding Codes 2.6 Identification of weld defects 3. Underpinning Skills 3.1 Measuring skills 3.2 Communication skills 3.3 Rectifying weld defects 3.4 Applying welding techniques for GTAW 3.5 Handling welding tools and equipment 3.6 Handling materials and consumables and checking purity of inert gas 4. Resource Implications The following resources must be provided: 4.1 GTAW facilities and equipment 4.2 Supplies and materials 4.3 PPE 4.4 Relevant documentation such as WPS and working drawing 4.5 Stand-by fire fighting equipment 5. Method of Assessment Competency must be assessed through: 5.1 Observation and interview 5.2 Demonstration and interview 5.3 Written test 5.4 Portfolio 6. Context of Assessment Competency to be assessed while a task is being undertaken in the workplace or in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Gas Tungsten Arc Welding (GTAW) NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            }
        ]
    }
]