[
    {
        "name": "Grains Production NC II",
        "core_competencies": [
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 28 CORE COMPETENCIES UNIT OF COMPETENCY : CONDUCT VARIETY AND SEED SELECTION UNIT CODE : AFF 611305 UNIT DESCRIPTOR : This unit covers the knowledge, skills and attitudes required to conduct site characterization, select suitable seed variety and select quality seed. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Conduct site characterization 1.1 Soil characterization is performed according to soil type classification 1.2 Ecosystem is identified according to established classification 1.3 Climatic pattern is identified based on Climatic Type from PAG - ASA 1.4 Topography and elevation of the site are determined based on ocular observation 1.5 Information on the occurrence of prevalent pests and diseases are determined. 1.6 Record keeping is done based on workplace procedures 1.7 Available reference materials are sourced out based on work requirements.  Soil characterization procedures o Soil Sampling o Feel Method o Visual examination  Soil type classification  Types of ecosystem  Types of climatic pattern  Climatic types  Types of land topography  Elevation  Pests and diseases profile  Farm record keeping and documentation  Different reference materials and their sources  Ways of sourcing reference materials  Classifying soil types  Identifying ecosystems  Identifying climatic patterns and types  Determining topography and elevation of the site  Determining previous and current occurrence of prevalent pests and diseases  Communication skills and record keeping skills  Sourcing out of different reference materials 2. Select suitable seed variety 2.1 Varietal characterization is performed for suitability of variety in the site. 2.2 List of recommended varieties is sourced out for reference in selection process.  Morphology and growth stages of rice and corn plant  Varietal characteristics  Agronomic characteristics  Disease and insect  Identifying rice and corn varieties  Determining varietal characteristics  Sourcing of the recommended lists  Selecting variety for",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 31
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 29 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2.3 Suited variety is chosen based on site characterization pest reactions  Adaptability Test  Sources of the recommended lists of rice and corn varieties  Varietal selection procedures  National Seed Industry Council (NSIC) approved seed varieties the specific site 3. Select quality seed 3.1 Classes of seeds are enumerated based on NSIC 3.2 Characteristics of quality seeds are determined based on NSIC 3.3 Germination test is performed according to established procedures 3.4 Quality seeds are chosen based on NSIC 3.5 Return and exchange of non-germinating seeds to the source is done following industry procedures  Classes of seeds  NSIC  Characteristics of Quality seeds  Germination Tests o Date harvested o Computation of seed germination o Sampling  Selection procedures for quality seeds  Return and exchange of non-germinating seeds  Communication skills  Classifying seeds  Determining quality seeds  Conducting seed germination test  Computing seed germination  Selecting quality seeds  Negotiating for the return and exchange of non-germinating seeds to the source",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 32
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 30 RANGE OF VARIABLES VARIABLE RANGE 1. Soil type classification Soil type classification include: 1.1 Sandy loam 1.2 Clay loam 1.3 Silt 1.4 Clay 1.5 Sandy 1.6 Silty clay 2. Ecosystem Ecosystem includes: 2.1 Upland 2.2 Irrigated lowland 2.3 Rain fed lowland 2.4 Saline 2.5 Cool elevated 2.6 Riverine 3. Climatic pattern Climatic pattern includes: 3.1 Wet 3.2 Dry 4. Climatic type Climatic Type includes: 4.1 Type 1 4.2 Type 2 4.3 Type 3 4.4 Type 4 5. Topography Topography includes: 5.1 Hilly 5.2 Flat 5.3 Sloping 5.4 Mountainous 5.5 Plateau 6. Available reference Available reference includes: 6.1 Electronic 6.1.1 Website 6.1.2 Social media 6.1.3 Text messaging 6.2 Prints 6.2.1 Books 6.2.2 Manuals 6.2.3 Production guide 6.2.4 Comics 6.2.5 Pamphlets 6.2.6 Monographs",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 31 VARIABLE RANGE 7. Varietal characteristics Varietal characteristics refer to: 7.1 Agronomic characteristics 7.2 Disease and insect pest reactions 7.3 Seed characteristics 8. Classes of seeds Classes of seeds include: 8.1 Breeder 8.2 Foundation 8.3 Registered 8.4 Certified seeds 8.5 Good seeds 9. Quality seeds Quality seeds include: 9.1 Relatively pure 9.2 Clean 9.3 High germination 9.4 Fewer weed seeds 9.5 Free from seed borne pests and diseases 9.6 Full and uniform in size 9.7 Viable 9.8 Vigor 10. Germination test Germination test includes: 10.1 Rice 10.1.1 Rag doll method 10.1.2 Petri dish 10.2 Corn 10.2.1 Seed box method",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 32 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Characterized site. 1.2 Selected suitable seed variety. 1.3 Selected quality seed. 1.4 Matched rice and corn variety specific to site characteristics 2. Resource implications The following resources MUST be provided: 2.1 Farm site/ simulated workplace 2.2 Different classes of seeds 2.3 NSIC approved rice and corn seed varieties 2.4 PPE 2.5 Tools and equipment relevant to the proposed activity or tasks 2.6 Reference – PNS; Quality Standards and PNS; PhilGap (rice and corn) 3. Methods of assessment Competency in this unit may be assessed through: 3.1 Demonstration 3.2 Written examination 3.3 Oral questioning 4. Context for Assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 33 UNIT OF COMPETENCY: PERFORM LAND PREPARATION UNIT CODE: AFF 611306 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to perform pre-tillage operations, conduct tillage operation and perform post-tillage operation. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Perform pre-tillage operations 1.1 Land clearing activities are done according to topography 1.2 Tools, materials and equipment are made ready for land preparation 1.3 Safety procedures is followed according to OSHS 1.4 Machinery services are sourced out following work requirement 1.5 Dikes are constructed and repaired according to industry standard procedures  Land clearing activities o Importance of land cleaning in rice and corn production.  Different topography  Tools, materials, and equipment required in land preparations  Procedures in preparation of tools, material and equipment  OSHS  PPE  Different machinery services for land preparations  Philippine Good Agricultural Practices (PhilGAP)  Activities of repairing dikes  Clearing the area.  Preparing tools, materials and equipment  Practicing OSHS  Wearing PPE  Sourcing of machinery services  Communication skills  Practicing Phil GAP  Constructing and repairing dikes",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 34 2. Conduct tillage operations 2.1 Tillage operation is carried-out according to standard tillage practices. 2.2 Tillage operation is monitored following established industry procedures 2.3 Safety measures are practiced according to OSH standards.  Tillage operation and practices  Monitoring tillage operation  Characteristics of a well-prepared wetland and dryland fields  OSHS  Safety procedures for land preparation  Performing tillage operation  Monitoring tillage operation  Cleaning the area  Preparing tools, materials and equipment  Practicing OSHS  Wearing PPE  Communication skills  Practicing GAP  Repairing dikes 3. Perform post-tillage operations 3.1 Damaged dikes are repaired following standard industry procedures. 3.2 Proper waste disposal is practiced following environmental rules and regulations. 3.3 Transaction with the machinery service provider is completed with reference to work contract. 3.4 Record keeping is done following workplace procedures.  Activities of repairing dikes  Reinforce dikes using bamboo poles procedure  Proper waste disposal  Procedures in closing transaction with machinery services provider  Communication skills  Simple record keeping  Repairing damaged dikes  Disposing wastes  Completing transactions with machinery service provider  Performing record keeping",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 35 RANGE OF VARIABLES VARIABLE RANGE 1. Land clearing activities Land clearing activities include: 1.1 Cleaning of dikes/levees 1.2 Cleaning of irrigation and drainage canals 1.3 Spreading of remaining crop stubbles 2. Topography Topography includes: 2.1 Hilly 2.2 Flat 2.3 Sloping 2.4 Mountainous 2.5 Plateau 3. Tools, Materials, Equipment Tools, materials and equipment include: 3.1 Equipment 3.1.1 Grass cutter 3.1.2 Knapsack sprayer 3.1.3 PPE 3.1.4 Carabao 3.1.5 Farm Attachments 3.1.5.1 Tooth comb - harrow 3.1.5.2 Carabao - drawn plow 3.1.5.3 Puddler 3.1.5.4 Wooden planks 3.2 Tools 3.2.1 Bolo 3.2.2 Scythe 3.2.3 Spade or shovel 3.2.4 Spading fork 3.2.5 Garden hoe 3.2.6 Rake 3.2.7 A-frame (1 unit) 3.3 Materials 3.3.1 Fuel 3.3.2 Engine oil 3.3.3 Sharpening stone 4. Constructing and repairing dikes Constructing and repairing dikes include: 4.1 Sealing rat burrows, cracks and damaged dikes 4.2 Installing screen mesh to water inlets and outlets 4.3 Elevating water dikes 5. Tillage Operation Tilling operation includes: 5.1 Wet tillage practices 5.2 Dry land tillage practices 5.3 Wet and dry tillage practices. 6. Repairing damaged dikes Repairing damage dikes include: 6.1 Sealing and patching rat burrows, cracks, damaged dikes 6.2 Reinforcing dikes 6.3 Using bamboo poles 6.4 Elevating dikes",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 36 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Performed pre-tillage operations 1.2 Conducted tillage operation 1.3 Performed post-tillage operation 1.4 Practiced safety measures following OSH standards 1.5 Performed record keeping 2. Resource Implications The following resources MUST be provided: 2.1 Farm site/simulated workshop 2.2 Tools, materials, farm implements and equipment for land preparation activities 2.3 PPE 2.4 Operator’s manual 3. Method of Assessment Competency in this unit may be assessed through: 3.1 Demonstration 3.2 Written examination 3.3 Oral questioning 4. Context for Assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 37 UNIT OF COMPETENCY: CARRY OUT CROP ESTABLISHMENT UNIT CODE: AFF 611307 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to germinate seeds, conduct direct seeding operation and establish crop for transplanting. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Germinate seeds 1.1 Seed soaking is done according to industry standards 1.2 Seed is incubated following industry standards 1.3 Incubated seeds are examined for whitish dot as a sign of germination. 1.4 Germinated seeds are handled and transported to site following industry standards 1.5 Wearing of PPE is practiced following the OSHS standards  Procedures of seed soaking  Procedures of seed incubation  Indicators of seed germination  Practice OSHS  Wearing of PPE  Documentation and record keeping  Proper handling and transporting of germinated seeds o Avoidance from contamination of chemicals  Proper wastes disposal (Reduce, Reuse, Recycle - 3Rs)  Soaking of seeds  Incubating seeds  Identifying germinated seed  Handling and transporting of germinated seeds  Wearing PPE  Practicing proper wastes disposal 2. Conduct direct seeding operation 2.1 Tools, materials and equipment are prepared based on work requirements 2.2 Field is checked for readiness for direct seeding operation 2.3 Corrective measures are done based on the result of inspection 2.4 Prevention of pests is employed according to result of inspection 2.5 Direct seeding is performed following  Preparation of tools, materials and equipment  Ways of checking the field  Corrective measures  Prevention of pests  Direct seeding procedures o manual broadcasting  Preparing tools, materials and equipment  Checking field by ocular inspection  Analytical skills  Preventing pests  Using drum seeders  Broadcasting (manual) seeds  Wearing PPE  Using drum",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 38 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS industry recommendations 2.6 Wearing of PPE is practiced according to OSHS standards. 2.7 Drum seeder is used following manufacturer’s manual 2.8 Post operation activities are performed based on workplace procedure. o using of drum seeder  OSHS o PPEs for direct seeding operation  Parts and functions of drum seeder  Post operation activities seeder  Performing post - operation activities 3. Establish crop for transplanting 3.1 Tools, materials and equipment are prepared based on work requirements 3.2 Seedbed site is selected based on recommended criteria 3.3 Seedbed is prepared following industry standards 3.4 Seeds are sown following industry standards 3.5 Seedling management is applied following industry standards 3.6 Wearing of safety gears are practiced according to OSHS standards 3.7 Post operation activities are performed based on workplace procedure 3.8 Pre - transplanting activities are done following industry standards 3.9 Crop insurance is applied for based on recommendation of the industry  Preparation of tools, materials and equipment  Recommended criteria for site selection  Industry standards in seedbed preparations  Industry standards in seed sowing  Industry standards in seedling management  Computation of fertilizer rate  Safety gears used in transplanting  OSHS in transplanting  Pre - transplanting procedures  Post - operations activities  Types of insurances  Procedures in accomplishing insurance forms  Preparing tools, materials and equipment  Selecting seedbed site by ocular inspection  Preparing seedbed  Mathematical skills in measuring seedbed area  Sowing seed  Applying seedling management  Computing for fertilizer rate  Wearing safety gears  Performing pre - transplanting of seedlings  Performing post - operation activities  Applying for crop insurance",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 39 RANGE OF VARIABLES VARIABLE RANGE 1. Seed soaking Seed soaking include: 1.1 Washing of seeds 1.2 Cleaning of the seeds 1.3 Changing of water 2. Incubation Incubation include: 2.1 Transferring of seeds to sack (half-filled) 2.2 Draining of seeds 2.3 Loosening ties of sacks 2.4 Placing of sacks on top of pallet under shaded area 2.5 Covering of sacks 3. Transporting and handling of germinated seeds Transporting and handling of germinated seeds include: 3.1 Prevent germinated seeds from getting wet 3.2 Avoid too much exposure to sunlight 3.3 Cover the germinated seeds from direct sunlight 3.4 Avoid contamination from chemicals 4. Tools, materials and equipment Tools, materials and equipment include: Direct Seeding: Transplanting: 4.1 Tools  shovel  bolo 4.2 Materials  sacks  chemicals  record book  ballpen  germinated seeds  pail/container 4.3 Equipment  drum seeder  knapsack sprayer  PPE/safety gears 4.1 Tools  shovel  bolo  knife 4.2 Materials  sacks  chemicals  record book  ballpen  seedlings  pail/container  rope  planting guide  laminated sacks  tying materials for seedlings o leaves of talahib o leaves of cogon o leaves of lapat 4.3 Equipment  Knapsack sprayer  PPE/safety gears  Carabao 5. Checking of Field Checking of field includes:",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 40 VARIABLE RANGE 5.1 Field leveling 5.2 Excess water for drainage 5.3 presence of pests 6. Direct Seeding Direct seeding includes: 6.1 Manual 6.2 Mechanical 7. Pests Pests include: 7.1 Golden snail 7.2 Rats 7.3 Chicken 7.4 Other stray animals 8. Post operations activities for direct selling Post operation activities include: 8.1 Replanting of open spaces missing hills 8.2 Applying water and nutrient management 8.3 Replanting of open spaces missing hills 8.4 Employing 7s of Good Housekeeping 8.5 Cleaning tools and equipment 8.6 Storage of tools, material and equipment 8.7 Record keeping 8.8 Waste disposal 9. Recommended criteria Recommended criteria include: 9.1 Away from infected area 9.2 Away from artificial lights 9.3 Near water source 9.4 Good soil condition 9.5 Areas with good drainage 10. Seedbed preparation Seedbed preparation includes: 10.1 Dapog 10.2 Modified dapog 10.3 Mat tray 10.4 Wet bed 10.5 Dry bed 11. Safety gears Safety gears includes: 11.1 Masks 11.2 Goggles 11.3 Surgical gloves 11.4 Rubber boots 11.5 Long sleeves shirt 11.6 Hat 11.7 Towel 12. Seedling management Seedling management includes: 12.1 Nutrient management 12.2 Water management 12.3 Pests management",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 41 VARIABLE RANGE 13. Pre-transplanting activities Pre-transplanting activities include 13.1 Flooding of seed bed 13.2 Pulling and tying of seedlings 13.3 Washing of roots 13.4 Hauling and distribution of seedlings 14. Post operation activities for crop establishment Post operation activities include: 14.1 Replanting of missing hills 14.2 Employing 7s of Good Housekeeping 14.3 Cleaning tools and equipment 14.4 Storage of tools, material and equipment 14.5 Record keeping 14.6 Waste disposal 15. Insurance Insurance includes: 15.1 Crop 15.2 Farmer",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 42 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Germinated seeds 1.2 Conducted direct seeding operation 1.3 Established crop for transplanting 1.4 Pulled and transplanted plant 1.5 Applied for crop insurance 1.6 Practiced OSHS 2. Resource Implications The following resources MUST be provided: 2.1 Farm site/ simulated workplace 2.2 Tools, materials and equipment for crop establishment operations 2.3 Seeds and germinated seeds 2.4 Operator’s manual 2.5 PPE 3. Method of Assessment Competency in this unit may be assessed through: 3.1 Demonstration 3.2 Written examination 3.3 Oral questioning 4. Context for Assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 43 UNIT OF COMPETENCY : MANAGE CROP GROWTH UNIT CODE: AFF 611308 UNIT DESCRIPTOR : This unit covers the knowledge, skills and attitudes required to conduct nutrient management, perform water management, carry-out pest management, conduct management of abiotic stresses and conduct seed purification activity. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Conduct nutrient management 1.1 Soil fertility is determined using recommended assessment methods 1.2 Kinds of fertilizer are selected based on soil analysis and crop requirement 1.3 Amount of fertilizer is computed based on industry recommendations 1.4 Fertilizer is applied according to recommendations  Importance of soil analysis  Soil sampling technique/s  Kinds of fertilizer  Ratio and proportion computation for fertilizers  Calendar of fertilizer application o Maturity of variety o Type of soil  Application of fertilizer  Industry recommendations for fertilizer application o Kind o Right amount o Right timing o Right place  Assessing soil fertility  Selecting fertilizers  Computing for ratio and proportion of amount of fertilizer  Preparing calendar of fertilizer application  Applying fertilizer 2. Perform water management 2.1 Water need is assessed based on ecosystem 2.2 Water management strategy is applied based on different cultural crop management 2.3 Water conservation is employed based on established farm practices 2.4 Ocular monitoring is conducted to observe the  Importance of water management on the different growth stages of rice and corn  Water requirements in different ecosystems  Water level and content assessment methods  Importance of different water  Reading or interpreting the measuring instrument for water level  Assessing water level  Applying appropriate management strategies  Employing appropriate water conservation",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 44 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS depth of water management strategies. o Calendar of planting o Scheduling of farm irrigation activities  Water conservation methods and their applications  Different techniques of water impounding o Small farm reservoir o Small water impounding project o Shallow tube well  Procedures of monitoring activities  Monitoring checklist  Kinds of fertilizer  Ratio and proportion computation for fertilizers  Calendar of fertilizer application o Maturity of variety o Type of soil method/s  Conducting monitoring activities 3. Carry-out pest management 3.1 Occurrence of pests and diseases is assessed following industry standard procedures 3.2 Pests and diseases management is adopted based on industry standard procedures 3.3 Regular field monitoring is conducted based on industry procedures 3.4 Action is taken to prevent further crop damages and losses.  Knowledge on the origin/occurrence of a particular disease  Management options for a particular pest/disease (IPM)  Identify/Classify pests and diseases  Agro ecosystem Analysis (AESA) and its importance as a decision-making tool for pests and diseases  Assessing occurrence of pests and diseases  Adopting pests and diseases management  Conducting regular field monitoring  Applying preventive action",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 45 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS management  Different techniques of damage assessment o Cultural o Biological o Mechanical o Chemical  Preventive actions against pest and diseases 4. Conduct management of abiotic stresses 4.1 Assessment of abiotic stresses is done following industry standard procedures 4.2 Abiotic stress management is adopted based on industry standards 4.3 Regular field monitoring is conducted based on industry procedures 4.4 Action is taken based on the result of monitoring activities  Different abiotic stresses  Assessment of abiotic stresses  Abiotic stress management  Field monitoring procedures  Preventive action against abiotic stresses  OHSH practices  Performing assessment of abiotic stress  Adopting abiotic stress management  Conducting regular field monitoring  Applying regular action against abiotic stress 5. Conduct seed purification activity 5.1 Area is selected for seed purification activity based on recommended criteria. 5.2 Off-types are removed following established farm procedures 5.3 Disposal of off-types is done following established farm procedures 5.4 Seeds are harvested based on maturity indices. 5.5 Post-harvest operations are done separately for seed production  Selection criteria  Characteristics of off-types  Stages of rice and corn where rouging is best done  Sources of off-types o Plant height o Color of leaves o Presence/absence of awn o Panicle o Flag leaf o Maturity etc.  Harvest and post-harvest operations  Rouging procedures o Importance of rouging  Phil GAP for rouging  OSHS  Disposal procedures of off-  Understanding the importance of rouging  Identify the proper time of rouging  Selecting area for seed purification activity  Identifying different off-types  Rouging of off-types  Proper disposing of off-types  Performing separate harvesting and post-harvesting operations for seed production  Practicing OSHS  Documenting and record keeping",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 46 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS types and weeds  Environmental rules and regulations on solid wastes management  Phil GAP on agri-wastes disposal  Harvesting and post-harvesting procedures for seed production activity  Record keeping RANGE OF VARIABLES VARIABLE RANGE 1. Assessment methods Assessment methods include: 1.1 Soil analysis 1.2 Minus-One Element Technique 1.3 Leaf Color Chart 1.4 Nutrient Omission Plot Technique 1.5 Rice crop manager (electronic based) 1.6 Leaf tissue analysis 2. Kinds of fertilizer Kinds of fertilizers include: 2.1 Organic 2.2 Inorganic/Synthetic 3. Fertilizer computation Fertilizer computation includes: 3.1. Ratio and proportion 3.2. Simple substitution 4. Methods of fertilizer application Methods of fertilizer application include: 4.1. Basal (First Application) 4.2. Top dressing 4.3. Side dressing 4.4. Foliar Application",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 47 VARIABLE RANGE 5. Recommendations Recommendations include: 5.1 Right kind 5.2 Right amount 5.3 Right Timing 5.4 Right Place 6. Water assessment methods Water assessment methods include: 6.1 Conventional (Level of water in the Paddy) 6.2 Traditional (Stick method, feel method) 7. Water management strategy Water management strategy includes: 7.1 Schedule of irrigation 7.2 Water source 7.3 Water flooding 7.4 Water draining 8. Water conservation Water conservation includes: 8.1 Alternate wetting and drying 8.2 Water impounding 8.3 Mulching 9. Pests and diseases Pests and diseases include: 9.1 Insect pests 9.2 Weeds 9.3 Vertebrate pests (rats and birds) 9.4 Snail 10. Diseases Diseases include: 10.1 Fungal 10.2 Bacterial 10.3 Viral 10.4 Nematodes 11. Pest and diseases management Pests and disease management includes: 11.1 Cultural control 11.2 Biological control 11.3 Chemical control 11.4 Mechanical control 12. Crop damage Crop damages include: 12.1 Diseases infections 12.2 Insect Infestations 12.3 Other crop damages 13. Abiotic stresses Abiotic stresses include: 13.1 Drought 13.2 Extreme temperature 13.3 Light - intensity stress 13.4 Nutrient deficiencies 13.5 Nutrient toxicity",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 48 13.6 Excessive water 13.7 Typhoons/ Strong winds 13.8 Pollutants 13.9 Salinity 13.10 Acidity 13.11 Alkalinity 14. Abiotic stress management Abiotic stress management includes: 14.1 Cultural 14.2 Biological 14.3 Mechanical 14.4 Chemical 15. Action Action includes: 15.1 Exhaust all measures to prevent/ control abiotic stresses 15.2 Report and coordinate with proper authorities for quick response and assistance 15.3 Report and claim crop insurance 16. Selection criteria Selection criteria include: 16.1 Free from pests and diseases 16.2 Accessible to water 16.3 Fertile soil 16.4 Less occurrence of off-types/ rogues 16.5 Away from artificial lights 17. Disposal of off-types Disposal of off-types includes: 17.1 Remove and carry 17.2 Composting 17.3 Feeds for livestock 17.4 Remove and bury 18. Post-harvest Post-harvest includes: 18.1 Piling 18.2 Threshing 18.3 Drying 18.4 Cleaning 18.5 Sacking 18.6 hauling 18.7 Storage 18.8 Dehusking 18.9 Shelling 18.10 Record keeping",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 49 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Conducted nutrient management 1.2 Performed water management 1.3 Carried-out pest management 1.4 Conducted management of abiotic stresses 1.5 Conducted seed purification activity 2. Resource Implications The following resources MUST be provided: 2.1 Farm site/simulated workplace 2.2 Storage area 2.3 Tools, materials and equipment for crop management operations (see section 3.4 for list of equipment, tools and materials) 2.4 Operator’s manual 2.5 Sack (packaging material) 2.6 PPE 3. Method of Assessment Competency in this unit may be assessed through: 3.1 Written Exam 3.2 Oral questioning 3.3 Demonstration 4. Context for Assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 50 UNIT OF COMPETENCY : CONDUCT HARVEST AND POST - HARVEST OPERATIONS UNIT CODE : AFF 611309 UNIT DESCRIPTOR : This unit covers the knowledge, skills and attitudes required to carry out pre - harvest, carryout harvesting activity and carry out post - harvest operations. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Carry out pre - harvest operation 1.1 Matured crop is determined based on physiological growth and physical indicators 1.2 Records of crop agronomic history is verified and referenced for maturity 1.3 Records are verified for harvesting activities following established farm procedures 1.4 Weather condition is monitored based on weather forecast 1.5 Rice field is drained of water according to recommended industry practices 1.6 Obstructions from the field are removed for efficient harvesting 1.7 Harvesting tools and materials are prepared following work requirement. 1.8 Machinery services are obtained for harvest and post - harvest operations.  Physiological indicators of rice and corn crop maturity  Physical indicators of rice and corn crop maturity  Agronomic characteristics of different rice and corn varieties  Records verification  Weather condition and forecasting  Proper water management before harvest  Types of obstructions from the rice field and corn field  Appropriate harvesting tools and materials for rice and corn  Documentation and farm record keeping  The Art of Negotiating  Machinery service providers for rice and corn  Determining matured crop o Identifying physiological indicators of rice and corn crop maturity o Identifying physical indicators of rice and corn crop maturity  Verifying information on agronomic history  Verifying records for harvesting activities  Monitoring weather conditions and forecasts  Preparing contingency plan for weather disturbances  Draining of water from the rice field  Removing obstructions from the field  Preparing harvesting tools and materials  Identifying different",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 51 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS machineries for harvest and post-harvest operations  Negotiating with machinery service providers for rice  Obtaining machinery services 2. Carry out harvesting activity 2.1 Appropriate harvesting methods are implemented based on best cultural practices 2.2 Piling is done based on recommended practices 2.3 PPE is worn according to OSHS 2.4 Harvesting tools are used according to work requirement 2.5 Mechanical harvesting is monitored following work requirement  Harvesting methods o Manual o Mechanical  Piling practices  Procedures for Safety in the use of tools and equipment  Use of honesty tools  Monitoring procedures  Identifying factors affecting quality of grain at harvest  Estimating yield  Harvesting rice and corn crop  Implementing appropriate harvesting methods  Piling of harvested grains  Wearing appropriate PPE  Using harvesting tools  Monitoring mechanized harvesting 3. Carry out post-harvest operations 3.1 Postharvest operations are done based on recommended technologies 3.2 Use of post-harvest equipment and facilities are monitored to avoid grain damage and losses 3.3 Handling and packaging are done according to variety and destination 3.4 Bags of palay are stored in an appropriate storage area 3.5 Monitoring of storage pests and diseases is done based on recommended practices  Postharvest equipment and facilities for grains and their uses  Care & maintenance of post-harvest equipment & facilities  Postharvest grain damages and losses  Proper handling and packaging of grains  Proper storing and stacking of grains  Procedures in monitoring storage pest & diseases  Storage pests & diseases  Performing postharvest operations such as handling/hauling, threshing, cleaning, drying, milling and storing  Identifying different postharvest equipment & facilities  Distinguishing specific uses of the different postharvest equipment & facilities  Identifying grain",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 52 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS  Effective Communication & Coordination damages and estimating spillage/losses  Packaging, sorting and stacking of milled grain following recommended industry standards  Storing and stacking of grain following industry standards  Cleaning of used and infested sacks of grain  Separating old stocks from new ones  Communicating infestation to proper authorities",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 53 RANGE OF VARIABLES VARIABLE RANGE 1. Physiological growth Physiological growth includes: 1.1 Days after seeding 1.2 Days after transplanting 1.3 Days after panicle initiation 2. Physical indicators Physical indicators include: 2.1 Change in color from green to golden yellow panicles 2.2 From green to brown husks 2.3 Hardening of grains 2.4 Drying of silk 2.5 Translucent grain 3. Crop agronomic history Crop agronomic history includes: 3.1. Variety 3.2. Planting calendar (days after seeding and days after heading) 3.3. For rice, days after seeding and panicle initiation 3.4. For corn, days after sowing 4. Obstructions Obstructions may include but not limited to: 4.1 Weeds 4.2 Stakes 4.3 Wedges 5. Harvesting tools and materials Harvesting tools and materials may include: 5.1 Scythe 5.2 Sacks 5.3 Twines 5.4 Labels/Markers 5.5 Lumber 5.6 bamboos 5.7 Nails 5.8 Roofing material 6. Records Records include: 6.1 Crop history 6.2 Farm activity calendar 6.3 Farm records 7. Machinery services Machinery services include: 7.1 Harvester 7.2 Thresher 7.3 Mechanical dryer 7.4 Rice and corn mill 7.5 Truck hauler 8. Appropriate harvesting Appropriate harvesting methods include: 8.1 Manual 8.2 Mechanical",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 54 VARIABLE RANGE 9. Postharvest operations Postharvest operations include: 9.1 Handling/Hauling 9.2 Threshing 9.3 Dehusking 9.4 Shelling 9.5 Cleaning 9.6 Drying 9.7 Milling 9.8 Packaging and sacking 9.9 Storing 10. Postharvest equipment and facilities Postharvest equipment and facilities include: 10.1 Thresher 10.2 Mechanical dryer 10.3 Dehusker 10.4 Sheller 10.5 Solar dryer 10.6 Rice and corn mill 10.7 Warehouse 11. Damages and losses Damages and losses include: 11.1 Broken grains 11.2 Discolored grains 11.3 Grain impurities 11.4 Spoiled grains 11.5 Pest-infected grains 11.6 Moldy corn 11.7 Spillage due to improper 11.8 Handling 12. Packaging Packaging includes: 12.1 Sacks 12.2 Plastic bags 13. Appropriate storage area Appropriate storage area: 13.1 Cool 13.2 Dry 13.3 Secured 13.4 Free from pests and diseases 13.5 Clean 14. Recommended practices Recommended practices include: 14.1 Using new sacks or cleaning used sacks by removing insect pests 14.2 Separating old stocks from new ones to prevent infestation 14.3 Reporting to immediate authority when infestation is alarming",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 55 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Carried out pre-harvest operation 1.2 Carried out harvesting activity 1.3 Carried out post-harvest operations 2. Resource Implications The following resources MUST be provided: 2.1 Farm site/simulated workplace 2.2 Storage facilities/simulated workplace 2.3 Tools, materials, equipment and machineries for harvesting and post-harvesting operation 2.4 PPE 3. Method of Assessment Competency may be assessed through: 3.1 Written examination 3.2 Oral questioning 3.3 Demonstration 4. Context for Assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            }
        ]
    }
]