[
    {
        "name": "HEO (Hydraulic Excavator) NC II",
        "core_competencies": [
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 54 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM PRE AND POST-OPERATION PROCEDURES FOR HYDRAULIC EXCAVATOR UNIT CODE: CON 834219 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in performing visual and operation check before and after productive operation of hydraulic excavator. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Perform visual check 1.1 Size and capacity of hydraulic excavator is selected based on job requirements. 1.2 Operator-serviceable (OS) parts are checked in accordance with equipment checklist and manufacturer’s procedures. 1.3 Inspection of equipment is performed with checklist while engine is stopped/not running 1.4 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 Occupational Safety and Health Standards 1.5 Required output is completed based on accomplished checklist 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Procedures in conducting visual and walk-around check 1.3 Sizes versus capacity 1.4 Familiarization of parts and components of hydraulic excavator 1.5 Factors affecting productivity 1.6 Productivity work measurements 1.7 Ways of improving productivity 1.1 Performing visual and walk-around checking procedures 1.2 Calculating the capacity of hydraulic excavator 1.3 Identifying parts and components of hydraulic excavator and its functions 1.4 Accomplishing equipment checklist 1.5 Applying productive methods and techniques 1.6 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 55 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Perform “BLOWAF” check 2.1 “BLOWAF” check is performed using checklist with engine stopped/not running. 2.2 Fluid levels are maintained in accordance with equipment maintenance manual. 2.3 Abnormal conditions noted in checklist and reported to authorized person. 2.4 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 2.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 2.1 Procedures in performing “BLOWAF” check 2.2 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.3 Waste disposal procedures 2.4 Fluid’s level and contamination 2.5 Factors affecting productivity 2.6 Productivity work measurements 2.7 Ways of improving productivity 2.1 Accomplishing equipment checklist (DETR) 2.2 Applying waste disposal procedures 2.3 Following “BLOWAF” checking procedures 2.4 Determining fluid level and contamination 2.5 Applying productive methods and techniques 2.6 Using PPE 3. Perform visual check for upper, lower structure and attachments 3.1 Upper, lower structure and attachments are checked in accordance with checklist and manufacturer’s procedures 3.2 upper, lower structure and attachments are secured for safe operation 3.3 Abnormal conditions are noted in checklist and reported to authorized person 3.4 PPE is used in accordance with 3.1 Procedures in visual check for upper, lower structure and attachments 3.2 Functions of attachments 3.3 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.4 Factors affecting productivity 3.5 Productivity work measurements 3.1 Following visual checking for upper, lower structure and attachments 3.2 Identifying parts and functions 3.3 Applying productive methods and techniques 3.4 Accomplishing equipment checklist (DETR) 3.5 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 56 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS Rule 1080 Occupational Safety and Health Standards 3.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 3.6 Ways of improving productivity",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 57 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 4. Perform operation check 4.1 Starting/running check is performed with checklist and in accordance with manufacturer’s recommendations. 4.2 Controls are checked for normal function while engine is running 4.3 Safety devices are checked for proper functions in accordance with safe operating procedures. 4.4 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 4.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 4.1 Start-up and warming procedures 4.2 Procedures in Operation check 4.3 Signs and symbols 4.4 Functions of all components and safety devices 4.5 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 4.6 Factors affecting productivity 4.7 Productivity work measurements 4.8 Ways of improving productivity 4.1 Following inspection procedures while the engine is running 4.2 Testing of hydraulic excavator 4.3 Applying productive methods and techniques 4.4 Accomplishing equipment checklist (DETR) 4.5 Using PPE 5. Perform post-operation procedures 5.1 Hydraulic excavator is parked and turned off after productive operation in accordance to manufacturer’s manual. 5.2 Controls are set into neutral position and parking brakes are engaged in accordance to manufacturer’s manual. 5.1 Company rules and regulations 5.2 Parking and shut-down procedures 5.3 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 5.4 Factors affecting productivity 5.5 Productivity work measurements 5.6 Ways of improving productivity 5.1 Following rules and regulations in parking and shutting down hydraulic excavator 5.2 Performing post-operation procedures 5.3 Accomplishing DETR and equipment checklist 5.4 Applying productive methods and techniques 5.5 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 61
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 58 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 5.3 Safety locks are all engaged in accordance with manufacturer’s manual. 5.4 Walk-around inspection check is re-conducted after operation 5.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 5.6 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 62
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 59 RANGE OF VARIABLES VARIABLE RANGE 1. Size and capacity of hydraulic excavator May include: 1.1 0.018 – 0.056 cubic meters 1.2 0.30 - 0.72 cubic meters 1.3 0.45 – 1.50 cubic meters 2. Operator serviceable parts (OS) May include: 2.4 Air cleaner 2.5 Battery terminals/connection/clamp/case 2.6 Fan belt 2.7 Grease/lube points 2.8 Fuel water separator/radiator 2.9 Tire inflation 2.10 Fuel tank 2.11 Hydraulic oil filters 2.12 Engine oil fan 2.13 Lights 2.14 Steering/suspension 3. Inspection of equipment May include: 3.1 Power off 3.1.1 Leaks 3.1.2 Worn out/damaged parts 3.1.3 Fluid levels 3.1.4 Loose parts and accessories (nuts/bolts/belts) 3.1.5 Missing parts and accessories 3.1.6 Hydraulic Cylinder 3.1.7 Levers and controls 3.1.8 Counter weight 3.1.9 Rim, tires and stud bolts 3.1.10 Bucket 3.2 Power on 3.2.1 Gauges 3.2.2 Lever and controls 3.2.3 Safety devices 3.2.3 Oil leaks 3.2.4 Pedals 3.2.5 Brakes 3.2.6 Steering 3.2.7 Electrical system 3.3 Early warning device",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 63
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 60 VARIABLE RANGE 4. Personal Protective Equipment (PPE) May include: 4.1 Hard hat 4.2 Goggles 4.3 Gloves 4.4 Safety shoes 4.5 Safety vest 5. BLOWAF check May include: 5.1 Battery (starting and charging system) 5.2 Light (lighting system) 5.3 Oil (lubricating system) 5.4 Water (cooling system) 5.5 Air (intake and exhaust system) 5.6 Fuel 6. Fluid May include: 6.1 Engine oil 6.2 Hydraulic oil 6.3 Radiator coolant/radiator 6.4 Battery solution / Battery electrolyte/distilled water 6.5 Final drive oil 6.6 Transmission/Gear oil 6.7 Steering oil 6.8 Torque converter oil 6.9 Automatic transmission fluid 7. Authorized person May include: 7.1 Equipment Supervisor 7.2 Equipment Dispatcher/Foreman 7.3 Equipment Maintenance personnel",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 64
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 61 VARIABLE RANGE 8. Upper, lower structure and attachments May include: 8.1 Attachments 8.1.1 Bucket 8.1.2 Breaker 8.2 Structure 8.2.1 Transmission 8.2.2 Differential 8.2.3 Tires/ Stud and Bolts 8.2.4 Sprocket 8.2.5 Final drive 8.2.6 Track link 8.2.7 Track pad 8.2.8 Track roller 8.2.9 Track frame 8.2.10 Hydraulic pump 8.2.11 Hydraulic motors 8.2.12 Hydraulic control valve 8.2.13 Hydraulic tank 8.2.14 Outrigger 8.2.15 Arm/Stick 8.2.16 Boom 8.2.17 Hydraulic cylinder 8.2.18 Idler",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 65
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 629. Starting/running check May include: 9.1 Controls/Levers 9.1.1 Travel 9.1.2 Steering 9.1.3 Brake 9.1.4 Bucket in/out 9.1.5 Arm in/out 9.1.6 Boom up/down 9.1.7 Swing left/right 9.1.8 Clutch and torque converter 9.2 Gauges 9.2.1 Hour meter 9.2.2 Battery charging 9.2.3 Pressure (oil and air) 9.2.4 Temperature (oil and water) 9.2.5 RPM (Tachometer) 9.2.6 Fuel indicator 9.2.7 Speedometer 9.2.8 Hydraulic pressure 9.3 Leaks in 9.3.1 Fuel 9.3.2 Oil 9.3.3 Water 9.4 Electrical/switches 9.4.1 Lights 9.4.2 Horns 9.5 Wiper 9.5.1 Beacon 10. Safety devices May include: 10.1 Back horn/warning horn 10.2 Signal/stop light 10.3 Blinkers 10.4 Seat belt 10.5 Parking brake 10.6 Roll over protective structure (ROPS) 10.7 Side mirrors",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 66
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 63 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Performed visual check 1.2 Performed “BLOWAF” check 1.3 Performed visual check for upper, lower structure and attachments 1.4 Performed operation check 1.5 Performed post-operation procedures 1.6 Observed safety measures applicable to worksite operation 1.7 Communicated effectively with others to ensure effective work operation 2. Resource implications The following resources should be provided: 2.1 Work area for hydraulic excavator operation 2.2 Access to hydraulic excavator and manuals 2.3 Basic hand tools and portable powered tools 2.4 PPE 2.5 Safety signage/barricades 3. Method of assessment The following resources should be provided: 3.1 Written Examination 3.2 Direct observation / Demonstration with Oral Questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 67
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 64 UNIT OF COMPETENCY: PERFORM BASIC PREVENTIVE MAINTENANCE SERVICING FOR HYDRAULIC EXCAVATOR UNIT CODE: CON 834220 UNIT DESCRIPTOR: This unit involves the knowledge, skills and attitudes required in cleaning, greasing, adjusting and replacing operator-serviceable (OS) parts of hydraulic excavator. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Perform adjustment or replacement for noted defects 1.1 Minor defects are identified and repaired/replaced in accordance with manufacturer’s procedures. 1.2 Basic hand tools and portable powered tools are selected based on job requirements. 1.3 Major defects are identified using checklist and referred to authorized personnel for action. 1.4 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 1.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Waste disposal procedures 1.3 Volume/Capacity 1.4 Clearance and distances 1.5 Types of fluids and lubricants 1.6 Procedures in performing adjustments or replacements for noted defects. 1.7 Types and uses of basic hand tools and portable powered tools 1.8 Structure and function of hydraulic excavator components 1.9 Factors affecting productivity 1.10 Productivity work measurements 1.11 Ways of improving productivity 1.1 Application of different basic hand tools and portable powered tools 1.2 Identifying defects 1.3 Performing adjustments or replacements for minor defects 1.4 Handling, segregation and disposal of hazardous waste 1.5 Applying productive methods and techniques 1.6 Accomplishing equipment checklist (DETR) 1.7 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 68
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 65 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Perform basic preventive maintenance servicing (PMS) 2.1 Operator’s Serviceable parts are identified and serviced according to manufacturer’s recommendations. 2.2 Standard parameters are checked according to manufacturer’s recommendations. 2.3 Fluids and lubricants are used based on manufacturer’s manual. 2.4 Basic hand tools, portable powered tools and consumable materials are identified and used in accordance with job requirements. 2.5 Basic preventive maintenance servicing (PMS) is carried out in accordance with manufacturer’s and site regulations 2.6 Site conditions are considered during PMS 2.7 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 2.8 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 2.1 Understanding Operator’s Maintenance Manual (OMM) 2.2 Site and weather conditions 2.3 Waste disposal procedures 2.4 Volume/capacity 2.5 Clearance and distances 2.6 Types of fluids and lubricants 2.7 Procedures in basic preventive maintenance servicing 2.8 Types and uses of basic hand tools and portable powered tools 2.9 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.10 Factors affecting productivity 2.11 Productivity work measurements 2.12 Ways of improving productivity 2.1 Performing basic preventive maintenance servicing (PMS) 2.2 Application of basic hand tools and portable powered tools 2.3 Application of fluids and lubricants 2.4 Handling, segregation and disposal of hazardous waste 2.5 Applying productive methods and techniques 2.6 Accomplishing equipment checklist (DETR) 2.7 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 69
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 66 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Prepare equipment reports 3.1 Equipment checklist is accomplished in accordance with manufacturer’s/Company requirements. 3.2 Equipment defects are reported to appropriate personnel. 3.3 Document control procedures is observed based on company requirements 3.4 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 3.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.2 Completion of checklist and defects reports 3.3 Document control procedures 3.1 Accomplishing equipment checklist 3.2 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 70
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 67 RANGE OF VARIABLES VARIABLE RANGE 1. Minor defects May include: 1.1 Weak battery 1.2 Tire inflation 1.3 Belt tension 1.4 Clogged air cleaner 1.5 Defective radiator cap 1.6 Loose battery clamps 1.7 Bolts and mountings 1.8 Presence of water in fuel separator 2. Basic hand tools and portable powered tools May include: 2.1 Hand tools 2.1.1 Wrenches 2.1.2 Pliers 2.1.3 Brush (steel, paint) 2.1.4 Grease gun 2.1.5 Hammer (ball-peen, rubber, test) 2.1.6 Vice grip 2.1.7 Meter tape 2.1.8 Screw driver (Philips and flat tip) 2.1.9 Tire gauge (instrument) 2.2 Portable Powered Tools 2.2.1 High pressure washer 2.3 Air compressor 2.4 Battery charger 3. Major defects May include: 3.1 Busted hydraulic hose 3.2 Hard starting engine 3.3 Excessive engine oil consumption 3.4 Leakage on 3.4.1 Air 3.4.2 Fuel 3.4.3 Cooling 3.4.4 Hydraulic system 3.5 Weak brakes 3.6 Busted/flat tires 3.7 Defective electrical system 3.7.1 Charging 3.7.2 Lighting 3.7.3 Starting 3.7.4 Gauges 4. Authorized personnel May include: 4.1 Equipment supervisor 4.2 Equipment Dispatcher/Foreman 4.3 Equipment Maintenance personnel",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 71
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 68 VARIABLE RANGE 5. Operator serviceable (OS) parts May include: 5.1 Battery clamps, battery distilled water 5.2 Belts 5.3 Filters 5.3.1 Air cleaner 5.3.2 Water fuel separator/drain valve 5.3.3 Hydraulic filter 5.3.4 Fuel filter 5.4 All fluid caps 5.5 All grease points and fittings 5.6 Tire inflation 6. Standard parameters May include: 6.1 Oil pressure 6.2 Air pressure 6.3 Temperatures 6.4 Tension 6.5 Clearance and distances 7. Fluids and lubricants May include: 7.1 Engine oil 7.2 Hydraulic oil 7.3 Brake fluid 7.4 Grease 7.5 Coolant 7.6 Battery solutions 7.7 Transmission oil 7.8 Differential oil 7.9 Power steering oil 8. Basic preventive maintenance servicing May include: 8.1 Check battery clamps 8.2 Check fan belt conditions (cracked or worn-out) 8.3 Adjust belt tensions (if necessary) 8.4 Clean/replace filters 8.4.1 Air cleaner 8.4.2 Water separator 8.4.3 Hydraulic filter 8.4.4 Fuel filter 8.5 Replace defective fluid caps 8.6 Grease all fittings on lube points 8.7 Tire inflation/Tire air pressure",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 72
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 69 VARIABLE RANGE 9. Site regulations May include: 9.1 Instructions 9.2 Signages 9.3 Work schedules 9.4 Work bulletin boards 9.5 Charts 9.6 Memos 9.7 Site Map 9.8 Emergency response plan 9.9 Permits 10. Site conditions May include: 10.1 Dusty 10.2 Windy 10.3 Sunny 10.4 Rainy 10.5 Crowded 10.3 Terrain (muddy and slippery)",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 73
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 70 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Performed adjustment or replacement for noted minor defects 1.2 Performed basic preventive maintenance servicing (PMS) 1.3 Prepared equipment reports 1.4 Observed safety measures applicable to worksite operation 1.5 Communicated effectively with others to ensure effective work operation 2. Resource implications The following resources should be provided: 2.1 Access to hydraulic excavator and manuals 2.2 Access to hydraulic excavator 2.3 Basic hand tools and portable powered tools 2.4 Fluids and lubricants 2.5 PPE 2.6 Safety signage’s/barricades 3. Method of assessment Competency in this unit may be assessed through: 3.1 Written Examination 3.2 Direct observation / Demonstration with Oral Questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 74
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 71 UNIT OF COMPETENCY: PERFORM PRODUCTIVE OPERATION FOR HYDRAULIC EXCAVATOR UNIT CODE: CON 834221 UNIT DESCRIPTOR: This unit involves the knowledge, skills and attitudes in excavation work, loading and lifting operation using hydraulic excavator. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Travel the hydraulic excavator 1.1 Road conditions are considered before travelling the hydraulic excavator. 1.2 Work area is surveyed for potential hazards in accordance with safe operating procedures. 1.3 Travel distance, speed and position of hydraulic excavator are observed in accordance with manufacturer’s manual and/or company rules and regulations 1.4 Unexpected situations are responded in line with company rules and regulations. 1.5 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 Occupational Safety and Health Standards 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Company rules and regulations 1.3 Site and weather conditions 1.4 Road worthiness 1.5 Clearance and distances 1.6 Speed limit 1.7 Procedures in travelling and positioning of hydraulic excavator 1.8 Factors affecting productivity 1.9 Productivity work measurements 1.10 Ways of improving productivity 1.1 Following company rules and regulations 1.2 Travelling the hydraulic excavator 1.3 Using PPE 1.4 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 75
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 72 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Load and unload hydraulic excavator to low-bed trailer/truck 2.1 Low-bed trailer/truck for transporting the hydraulic excavator is selected according to job requirements. 2.2 Attachments are positioned and secured based on manufacturer’s manual. 2.3 Verbal instructions and signals are conveyed with authorized spotter during loading and unloading as per standard operating procedures. 2.4 All safety locks and control levers are secured at neutral position before and after loading based on manufacturer's specifications. 2.5 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 2.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.2 Hand signals 2.3 Site and weather conditions 2.4 Clearance and distances 2.5 Speed limit 2.6 Procedures in loading and unloading 2.7 Factors affecting productivity 2.8 Productivity work measurements 2.9 Ways of improving productivity 2.1 Following verbal instructions and signals 2.2 Operating skills in loading and unloading hydraulic excavator to low-bed trailer/truck 2.3 Using PPE 2.4 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 76
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 73 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Perform excavation work 3.1 Site and weather conditions are considered before excavating 3.2 Engine RPM is set at desired operating condition. 3.3 Safe work procedures and practices are observed during excavation operation based on OSH standards and manufacturer’s manual 3.4 Work equipment is positioned according to operating procedures. 3.5 Bucket penetration angle position is observed. 3.6 Operation of arm and boom is observed during scooping of excavated materials. 3.7 Required excavation dimensions are observed according to work specifications. 3.8 Unexpected situations are responded in line with company rules and regulations 3.9 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 3.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.2 Signs and symbols 3.3 Company rules and regulations 3.4 Manufacturer’s manual 3.5 Site and weather conditions 3.6 Conversion of units 3.7 Clearance and distances 3.8 Safety devices 3.9 Procedures in excavation 3.10 Factors affecting productivity 3.11 Productivity work measurements 3.12 Ways of improving productivity 3.1 Performing excavation work 3.2 Interpreting signals and symbols 3.3 Identifying aspects and hazards 3.4 Following company rules and regulations 3.5 Interpreting manufacturer’s manual 3.6 Using PPE 3.7 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 77
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 74 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 4. Perform loading operation 4.1 Hydraulic Excavator is properly positioned according to ground condition 4.2 Engine RPM is set at desired operating condition 4.3 Swing angle is maintained according to the required distance and position of mobile/stationary equipment. 4.4 Loading sequence is observed based on standard operating procedure 4.5 Unexpected situations are responded to in line with company rules and regulations in a manner that minimizes risk to personnel and equipment 4.6 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 4.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 4.2 Signs and signals 4.3 Company rules and regulations 4.4 Manufacturer’s manual 4.5 Site and weather conditions 4.6 Conversion of units 4.7 Clearance and distances 4.8 Safety devices 4.9 Procedures in loading operation 4.10 Factors affecting productivity 4.11 Productivity work measurements 4.12 Ways of improving productivity 4.1 Performing loading operation 4.2 Interpreting signals and symbols 4.3 Identifying aspects and hazards 4.4 Following company rules and regulations 4.5 Interpreting manufacturer’s manual 4.6 Using PPE 4.7 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 78
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 75 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 5. Perform lifting operation 5.1 Engine RPM is set at desired operating condition 5.2 Weight and classification of the load is determined according to load information 5.3 Interpreting load chart is observed based on manufacturer’s manual 5.4 Rigging of load is observed in accordance with safe lifting procedures 5.5 Tipping radius is checked and confirmed according to lifting capacity of the hydraulic excavator 5.6 Unexpected situations are responded to in line with company rules and regulations in a manner that minimizes risk to personnel and equipment 5.7 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 5.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 5.2 Signs and signals 5.3 Company rules and regulations 5.4 Manufacturer’s manual 5.5 Load chart 5.6 Site and weather conditions 5.7 Conversion of units 5.8 Clearance and distances 5.9 Safety devices 5.10 Procedures in lifting operation 5.11 Factors affecting productivity 5.12 Productivity work measurements 5.13 Ways of improving productivity 5.1 Performing lifting operation 5.2 Interpreting signals and symbols 5.3 Identifying aspects and hazards 5.4 Following company rules and regulations 5.5 Interpreting manufacturer’s manual 5.6 Interpreting load chart 5.7 Using PPE 5.8 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 79
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 76 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 6. Perform operation using various attachments 6.1 Site and weather conditions are considered before operation 6.2 Engine RPM is set at desired operating condition. 6.3 Safe work procedures and practices are observed during operation based on OSH standards and manufacturer’s manual 6.4 Hydraulic excavator is positioned according to operating procedures. 6.5 Various attachments are positioned according to manufacturer’s manual 6.6 Operation of various attachments are observed during operation 6.7 Unexpected situations are responded in line with company rules and regulations 6.8 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 6.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 6.2 Signs and symbols 6.3 Company rules and regulations 6.4 Manufacturer’s manual 6.5 Site and weather conditions 6.6 Conversion of units 6.7 Clearance and distances 6.8 Safety devices 6.9 Procedures in using various attachments 6.10 Factors affecting productivity 6.11 Productivity work measurements 6.12 Ways of improving productivity 6.1 Performing operation using various attachments 6.2 Interpreting sign and symbols 6.3 Identifying aspects and hazards 6.4 Following company rules and regulations 6.5 Interpreting manufacturer’s manual 6.6 Using PPE 6.7 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 80
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 77 RANGE OF VARIABLES VARIABLE RANGE 1. Potential hazards May include: 1.1 Other equipment 1.2 Building 1.3 Deep excavation 1.4 Sloping ground 1.5 Uneven terrain 1.6 Overhead “live” electrical wires 1.7 Underground utilities 1.8 Unstable ground 2. Unexpected situations May include: 2.1 Sudden engine breakdown 2.2 Busted hydraulic hose and oil leakages 2.3 Hitting high tension wire 2.6 Sudden ground failure 2.8 Force majeure e.g., earthquake, tornado, typhoon 2.9 Operator fatigue or sickness/condition 2.10 Accidents/incidents 3. Attachments May include: 3.1 Bucket 3.2 Hammer 3.3 Pulverizers 3.4 Augers 3.5 Shears 3.6 Grapples 3.7 Magnets 3.8 Breaker 4. Work equipment May include: 4.1 Boom 4.2 Arm 4.3 Bucket 4.4 Blade (small and medium size unit) 5. Excavated materials May include: 5.1 Boulders 5.2 Soil 5.3 Sand 5.4 Limestone 5.5 Debris 5.6 Coal 5.7 Landfill 5.8 Ore 5.9 Silt",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 81
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 78 VARIABLE RANGE 6. Excavation dimensions May include: 6.1 Depth 6.2 Reach 6.3 Width 6.4 Height 7. Ground condition 7.1 Soft 7.2 Hard 7.3 Muddy 7.4 Rocky 6.5 Loose 8. Mobile/stationary equipment 8.1 Rigid and articulated hauler truck 8.2 Dump truck 8.3 Hopper 8.4 Conveyor 8.5 Bottom dump trailer 9. Classification of the load May include: 9.1 Reinforced concrete pipes 9.2 Rebars 9.3 Steel pipes 9.4 Water pump 10. Load information May include: 10.1 Bill of ladings 10.2 Packing and shipping list 10.3 Delivery receipt 10.4 Dimension",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 82
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 79 EVIDENCE GUIDE 1. Critical aspects of evidence to be considered Assessment requires evidence that the candidate: 1.1 Travelled the hydraulic excavator 1.2 Load and unload hydraulic excavator to low-bed trailer/truck 1.3 Perform excavation work 1.4 Performed loading operation 1.5 Performed lifting operation 1.6 Observed safety measures applicable to worksite operation 1.7 Communicated effectively with others to ensure effective work operation 2. Resource implications The following resources should be provided: 2.1 Access to hydraulic excavator and job site/terrain 2.2 Available loads 2.3 Informative signages 2.4 PPE 3. Method of assessment Competency in this unit may be assessed through: 3.1 Written Examination 3.2 Direct observation / Demonstration with Oral Questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 83
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "HEO (Rigid On-Highway Dump Truck) NC II",
        "core_competencies": [
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 51 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM PRE AND POST-OPERATION PROCEDURES FOR RIGID ON-HIGHWAY DUMP TRUCK UNIT CODE: CON 834222 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in performing visual and operation check before and after productive operation of rigid on-highway dump truck. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Perform visual check of rigid on-highway dump truck 1.1 Capacity of rigid on-highway dump truck is selected based on job requirements 1.2 Operator-serviceable (OS) parts are checked in accordance with equipment checklist and manufacturer’s procedures 1.3 Inspection is performed with equipment checklist and with engine stopped/not running 1.4 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 Occupational Safety and Health Standards 1.5 Required output is completed based on accomplished checklist 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Procedures in conducting visual check 1.3 Determining dump box capacity of rigid on-highway dump truck 1.4 Functions of parts and components of rigid on-highway dump truck 1.5 Factors affecting productivity 1.6 Productivity work measurements 1.7 Ways of improving productivity 1.1 Following visual and inspection procedures 1.2 Determining dump box capacity 1.3 Identifying parts and functions 1.4 Accomplishing equipment checklist 1.5 Using PPE 1.6 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 52 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Perform “BLOWAF” check 2.1 “BLOWAF” check is performed using checklist with engine stopped/not running. 2.2 Fluid levels are maintained in accordance with equipment maintenance manual. 2.3 Abnormal conditions noted in checklist and reported to authorized person. 2.4 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 2.5 Required output is completed based on accomplished checklist 2.1 Procedures in performing “BLOWAF” check 2.2 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.3 Waste disposal procedures 2.4 Fluid’s level and contamination 2.5 Factors affecting productivity 2.6 Productivity work measurements 2.7 Ways of improving productivity 2.1 Accomplishing equipment checklist 2.2 Applying waste disposal procedures 2.3 Following “BLOWAF” checking procedures 2.4 Determining fluid level and contamination 2.5 Using PPE 2.6 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 53 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Perform operation check 3.1 Starting/running check is performed with checklist and in accordance with manufacturer’s recommendations 3.2 Mechanical components are checked for normal functioning based on manufacturer's specifications 3.3 Safety devices are checked for proper functions in accordance with safe operating procedures 3.4 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 3.5 Required output is completed based on accomplished checklist 3.1 Start-up and warming procedures 3.2 Procedures in inspection while the engine is running 3.3 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.4 Warning signs and symbols 3.5 Functions of all components and safety devices 3.6 Factors affecting productivity 3.7 Productivity work measurements 3.8 Ways of improving productivity 3.1 Accomplishing equipment checklist 3.2 Following inspection procedures while the engine is running 3.3 Testing of rigid on-highway dump truck 3.4 Using PPE 3.5 Applying productive methods and techniques 4. Perform post-operation procedures 4.1 Rigid on-highway dump truck is parked and turned off after productive operation in accordance to manufacturer’s manual 4.2 Controls are set into neutral position and parking brakes are engaged in accordance to manufacturer’s manual 4.3 Safety locks and brakes are all engaged in accordance manufacturer’s manual 4.4 Inspection is re-conducted while doing engine cool down 4.1 Company rules and regulations 4.2 Parking and shut-down procedures 4.3 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 4.4 Factors affecting productivity 4.5 Productivity work measurements 4.6 Ways of improving productivity 4.1 Accomplishing DETR and equipment checklist 4.2 Following rules and regulations in parking and shutting rigid on-highway dump truck Performing post-operation procedures 4.3 Using PPE 4.4 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 54 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 4.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 4.6 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 4.7 Required output is completed based on accomplished checklist",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 55 RANGE OF VARIABLES VARIABLE RANGE 1. Capacity of rigid on-highway dump truck May include: 1.1 2 to 5 cubic meters 1.2 6 to 10 cubic meters 1.3 11 to 15 cubic meters 1.4 16 to 20 cubic meters 1.5 21 to 25 cubic meters 2. Operator serviceable parts (OS) May include: 2.4 Air cleaner 2.5 Battery terminals/ connection/ clamp/ case 2.6 Fan belt 2.7 Grease/lube points 2.8 Fuel water separator/radiator 2.9 Tire inflation 2.10 Fuel tank 2.11 Hydraulic and brake master cylinder 2.12 Engine oil fan 2.13 Lights 2.14 Steering/suspension 3. Inspection May include: 3.1 Engine off 3.1.1 Leaks 3.1.2 Worn out/damaged parts 3.1.3 Fluid levels 3.1.4 Loose parts and accessories (nuts/bolts/belts) 3.1.5 Missing parts and accessories 3.2 Engine on 3.2.1 Gauges and controls 3.2.2 Safety devices 3.2.3 Oil and air leaks 3.2.4 Levers and controls 3.2.4.1 Steering wheels 3.2.4.2 Pedals 3.2.4.3 Hand brake 3.2.4.4 Power Take-off (PTO) 3.2.5 Electrical lighting system 3.2.6 Horn 3.3 Early warning devices 3.4 Spare tire",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 56 VARIABLE RANGE 4. Personal Protective Equipment (PPE) May include: 4.1 Hard hat 4.2 Goggles 4.3 Gloves 4.4 Safety shoes 4.5 Safety vest 5. BLOWAF check May include: 5.1 Battery (starting and charging system) 5.2 Light (lighting system) 5.3 Oil (lubricating system) 5.4 Water (cooling system) 5.5 Air (intake and exhaust system) 5.6 Fuel (fuel system) 6. Fluid May include: 6.1 Engine oil 6.2 Hydraulic oil 6.3 Radiator coolant/radiator 6.4 Battery electrolyte/distilled water 6.5 Brake/clutch fluid 6.6 Transmission/Gear oil 6.7 Steering oil 6.8 Fuel 6.9 Torque converter oil 6.10 Automatic transmission fluid 7. Authorized person May include: 7.1 Equipment Supervisor 7.2 Equipment Dispatcher/Foreman 7.3 Equipment Maintenance personnel",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 57 VARIABLE RANGE 8. Starting/running check/operation check May include: 8.1 Controls 8.1.1 PTO 8.1.2 Brakes 8.1.3 Travel 8.1.4 Steering 8.2 Gauges 8.2.1 Hour meter 8.2.2 Battery charging 8.2.3 Pressure (oil and air) 8.2.4 Temperature (oil and water) 8.2.5 RPM (Tachometer) 8.2.6 Fuel indicator 8.2.7 Speedometer 8.3 Leaks in 8.3.1 Fuel 8.3.2 Water 8.3.3 Oil 8.3.4 Air 8.4 Electrical/switches 8.4.1 Lights 8.4.2 Horns 8.4.3 Wiper 9. Mechanical components May include: 9.1 Brakes 9.2 Steering 9.3 Power Take-off (PTO) 9.4 Tires 9.5 Dump box 9.6 Dump box cylinder 9.7 Chassis 9.8 Transmission 9.9 Clutch 9.10 Differential 10. Safety devices May include: 10.1 Back horn/warning horn 10.2 Signal/stop light 10.3 Blinkers 10.4 Seat belt 10.5 Parking brake 10.6 Dump body sensor",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 61
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 58 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Performed visual check of on-highway dump truck (rigid) 1.2 Performed “BLOWAF” check 1.3 Performed operation check 1.4 Performed post operation procedures 1.5 Observed safety measures applicable to worksite operation 1.6 Communicated effectively with others to ensure effective work operation 2. Resource implications The following resources should be provided: 2.1 Work area for on-highway dump truck (rigid) operation 2.2 Access to on-highway dump truck (rigid) and manuals 2.3 Basic hand tools and portable powered tools 2.4 PPE 2.5 Safety signage/barricades 3. Method of assessment Competency in this unit may be assessed through: 3.1 Written examination 3.2 Direct observation/Demonstration with oral questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 62
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 59 UNIT OF COMPETENCY: PERFORM BASIC PREVENTIVE MAINTENANCE SERVICING FOR RIGID ON-HIGHWAY DUMP TRUCK UNIT CODE: CON 834223 UNIT DESCRIPTOR: This unit involves the knowledge, skills and attitudes required in cleaning, greasing, adjusting and replacing operator-serviceable (OS) parts of rigid on-highway dump truck. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Perform adjustment or replacement for noted defects 1.1 Minor defects are identified and repaired/replaced in accordance with manufacturer’s procedures. 1.2 Basic hand tools and portable powered tools are selected based on job requirements. 1.3 Major defects are identified using checklist and referred to authorized personnel for action. 1.4 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 1.5 Required output is completed based on accomplished checklist 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Waste disposal procedures 1.3 Volume/capacity 1.4 Clearance and distances 1.5 Types of fluids and lubricants 1.6 Procedures in performing adjustments or replacements for noted defects. 1.7 Types and uses of basic hand tools and portable powered tools 1.8 Structure and function of On-Highway Dump Truck [rigid] components 1.9 Factors affecting productivity 1.10 Productivity work measurements 1.11 Ways of improving productivity 1.1 Application of different basic hand tools and portable powered tools 1.2 Applying waste disposal procedures 1.3 Identifying defects 1.4 Performing adjustments or replacements for minor defects 1.5 Accomplishing DETR and equipment checklist 1.6 Using PPE 1.7 Handling, segregation and disposal of hazardous waste",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 63
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 60 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Perform basic preventive maintenance servicing (PMS) 2.1 Operator’s Serviceable parts are identified and serviced according to manufacturer’s recommendations. 2.2 Standard parameters are checked according to manufacturer’s recommendations. 2.3 Fluids and lubricants are used based on manufacturer’s manual. 2.4 Basic hand tools, portable powered tools and consumable materials are identified and used in accordance with job requirements. 2.5 Basic preventive maintenance servicing (PMS) is carried out in accordance with manufacturer’s and site regulations 2.6 Site conditions are considered during PMS 2.7 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 2.8 Required output is completed based on accomplished checklist 2.1 Understanding Operator’s Maintenance Manual (OMM) 2.2 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.3 Site and weather conditions 2.4 Waste disposal procedures 2.5 Volume / capacity 2.6 Clearance and distances 2.7 Types of fluids and lubricants 2.8 Procedures in basic preventive maintenance servicing 2.9 Types and uses of basic hand tools and portable powered tools 2.10 Factors affecting productivity 2.11 Productivity work measurements 2.12 Ways of improving productivity 2.1 Performing basic preventive maintenance servicing (PMS) 2.2 Application of basic hand tools and portable powered tools 2.3 Application of fluids and lubricants 2.4 Handling, segregation and disposal of hazardous waste 2.5 Using PPE 2.6 Accomplishing DETR and equipment checklist 2.7 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 64
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 61 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Prepare equipment reports 3.1 Equipment checklist is accomplished in accordance with manufacturer’s/ company requirements. 3.2 Equipment defects are reported to authorized personnel. 3.3 Document control procedures is observed based on company requirements 3.4 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 3.1 Completion of checklist and defects reports 3.2 Document control procedures 3.3 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.1 Accomplishing equipment checklist (DETR) 3.2 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 65
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 62 RANGE OF VARIABLES VARIABLE RANGE 1. Minor defects May include: 1.1 Weak battery 1.2 Tire inflation / Tire air pressure 1.3 Belt tension 1.4 Clogged air cleaner 1.5 Defective radiator cap 2. Basic hand tools and portable powered tools May include: 2.1 Hand tools 2.1.1 Wrenches 2.1.2 Pliers 2.1.3 Brush (steel, paint) 2.1.4 Grease gun 2.1.5 Hammer (ball-peen, rubber, test) 2.1.6 Vice grip 2.1.7 Meter tape 2.1.8 Screw driver (Philips and flat tip) 2.1.9 Tire gauge (instrument) 2.2 Portable Powered Tools 2.1.1 High pressure washer 2.3 Air compressor 3. Major defects May include: 3.1 Weak brakes 3.2 Hard starting engine 3.3 Excessive engine oil consumption 3.4 Leakage on 3.4.1 Air 3.4.2 Fuel 3.4.3 Cooling 3.4.4 Fluid 3.5 Damaged/broken pulley 3.6 Engine low power 3.7 Smoke belching 3.8 Defective electrical components 3.8.1 Charging 3.8.2 Lighting 3.8.3 Starting 3.8.4 Monitoring/ gauges 4 Authorized personnel May include: 4.1 Equipment supervisor 4.2 Equipment Dispatcher/Foreman 4.3 Equipment Maintenance personnel",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 66
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 63 VARIABLE RANGE 5 Operator serviceable (OS) parts May include: 5.1 Battery clamps, Battery distilled water 5.2 Belts 5.3 Filters 5.3.1 Air cleaner 5.3.2 Water fuel separator/drain valve 5.3.3 Hydraulic filter 5.3.4 Fuel filter 5.4 All fluid caps 5.5 All grease points and fittings 5.6 Tire inflation 6. Standard parameters May include: 6.1 Oil pressure 6.2 Air pressure 6.3 Water temperatures 6.4 Belt tension 6.5 Tire pressure 7. Fluids and lubricants May include: 7.1 Engine oil 7.2 Hydraulic oil 7.3 Brake fluid 7.4 Grease 7.5 Coolant 7.6 Battery solutions/Battery electrolyte/distilled water 7.7 Transmission/Torque converter oil 7.8 Fuel 7.9 Differential oil 7.10 Power steering oil 8. Basic preventive maintenance servicing May include: 8.1 Check battery clamps 8.2 Check fan belt conditions (cracked or worn-out) 8.3 Cleaning the unit 8.4 Clean/Replace filters 8.4.1 Air cleaner 8.4.2 Water separator 8.4.3 Hydraulic filter 8.4.4 Fuel filter 8.5 Replace defective fluid caps 8.6 Grease all fittings on lube points 8.7 Tire inflation/Tire Air Pressure 9. Site regulations May include: 9.1 Instructions 9.2 Signages 9.3 Work schedules 9.4 Work bulletin boards 9.5 Charts 9.6 Memos 9.7 Site Map 9.8 Emergency response plan 9.9 Permits",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 67
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 64 VARIABLE RANGE 10. Site conditions May include: 10.1 Dusty 10.2 Windy 10.3 Sunny 10.4 Rainy 10.5 Crowded 10.3 Terrain (muddy and slippery)",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 68
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 65 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Performed adjustment or replacement for noted minor defects 1.2 Perform basic preventive maintenance servicing (PMS) 1.3 Prepare equipment reports 1.4 Observed safety measures applicable to worksite operation 1.5 Communicated effectively with others to ensure effective work operation 2. Resource implications The following resources should be provided: 2.1 Access to On-Highway Dump Truck [rigid] and manuals 2.2 Basic hand tools and portable powered tools 2.3 Fluids and lubricants 2.4 PPE 2.5 Safety signage's/barricades 3. Method of assessment Competency in this unit may be assessed through: 3.1 Written examination 3.2 Direct observation/Demonstration with oral questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 69
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 66 UNIT OF COMPETENCY: PERFORM PRODUCTIVE OPERATION FOR RIGID ON-HIGHWAY DUMP TRUCK UNIT CODE: CON 834224 UNIT DESCRIPTOR: This unit deals with the knowledge, skills and attitude required for preparing for loading operation, performing hauling and dumping operation for rigid on-highway dump truck. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Prepare for loading operation 1.1 Safe work practices are observed in accordance with company rules and regulations 1.2 Communication is established with the station during operation. 1.3 Positioning of rigid on-highway dump truck is observed at the loading area 1.4 Required control levers are applied according to operations manual. 1.5 Engine is set at low idle speed while waiting/loading operation 1.6 Unexpected situations are responded in line with company rules and regulations 1.7 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Traffic rules and regulations 1.3 Site and weather conditions 1.4 Road worthiness 1.5 Clearance and distances 1.6 Speed limit 1.7 Procedures in operating, travelling of rigid on-highway dump truck 1.8 Factors affecting productivity 1.9 Productivity work measurements 1.10 Ways of improving productivity 1.1 Following safe work practices 1.2 Positioning/maneuvering highway dump truck 1.3 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 70
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 67 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Perform hauling operation 2.1 Communication is maintained with the station during operation 2.2 Worksite conditions and safe operating techniques are identified according to safe operating practices 2.3 Traffic rules and regulations are observed 2.4 Retarder/exhaust brake is applied with allowable speed prior to downhill operation 2.5 Engine RPM and required travel speed is observed according to work site condition 2.6 Brake is applied based on the situation 2.7 Power take-off switch is disengaged during operations 2.8 Differential and inter axle lock are engaged and disengaged according to terrain conditions 2.9 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 2.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.2 Hand signals 2.3 Traffic rules and regulations 2.4 Site and weather conditions 2.5 Clearance and distances 2.6 Hauling operation procedures 2.7 Factors affecting productivity 2.8 Productivity work measurements 2.9 Ways of improving productivity 2.1 Perform hauling operation procedures of rigid on-highway dump truck 2.2 Interpreting and following hand signals, traffic rules and regulation 2.3 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 71
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 68 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Perform dumping operation 3.1. Communication is maintained with the station during operation. 3.2. Illumination of dumpsite is checked in line with site conditions 3.3. Assistance from spotter is obtained when required 3.4. Dumping operation is performed following established / recommended procedures 3.5. PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 3.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.2 Hand signals or radio 3.3 Conversion of units 3.4 Procedures in dumping operation 3.5 Factors affecting productivity 3.6 Productivity work measurements 3.7 Ways of improving productivity 3.1 Interpreting hand signal or radio communication 3.2 Perform dumping operation procedures 3.3 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 72
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 69 RANGE OF VARIABLES VARIABLE RANGE 1. Safe work practices May include: 1.1 Observed safety awareness 1.2 Observed firm and flat ground for the loading and dumping area 1.3 Wear PPE 1.4 Checked illumination of work site 1.5 Observed 3-point contact in embarking on and alighting from equipment 1.6 All controls must be in neutral position and parking brake applied before alighting from equipment 1.7 Observed housekeeping 2. Communication May include: 2.1 Hand signal 2.2 Radio / mobile phone and GPS 2.3 Horn / Light signal 3. Control levers May include: 3.1 Parking brake 3.2 Retarder / Exhaust brake 3.3 Transmission gear shift 3.4 Steering 3.5 Differential lock 3.6 Power take-off 4. Unexpected situations May include: 4.1 Sudden engine breakdown 4.2 Busted hydraulic hose and oil leakages 4.3 Sudden loss of brake 4.4 Loss control of steering 4.5 Sudden ground failure 4.6 Force majeure e.g., earthquake, fire, tornado 4.7 Operator fatigue or sickness/condition 4.8 Accidents/incidents 5. Worksite conditions May include: 5.1 Muddy 5.2 Sandy 5.3 Slippery 5.4 Uneven / unstable terrain",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 73
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 70 VARIABLE RANGE 6. Safe operating techniques May include: 6.1 Dump box is maintained in float position during traveling 6.2 Differential lock is engaged/disengaged during full stop 6.3 Running dumping is applied at lower gear operation 6.4 Reverse operation is not allowed during dumping operation 7. Engine RPM May include: 7.1 700 – 1,200 RPM 7.2 1,200 – 2,200 RPM 8. Brake May include: 8.1 Service 8.2 Secondary / Emergency 8.3 Exhaust brake/Engine brake 8.4 Parking brake 9. Established / recommended procedures May include: 9.1 Dump truck is positioned in the dumping area in accordance with site condition. 9.2 Transmission is set at neutral position and parking brake is engaged. 9.3 Horn is sounded prior to dump box raising / lowering position. 9.4 Dump box is raised / lowered in smooth and controlled engine RPM. 9.5 Unexpected situations are responded in line with company rules and regulations.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 74
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 71 EVIDENCE GUIDE 1. Critical aspects of competency to be considered Assessment must confirm evidence that the candidate: 1.1 Prepared for loading operation 1.2 Performed hauling operation 1.3 Performed dumping operation 1.4 Observed safety measures applicable to worksite operation 1.5 Communicated effectively with others to ensure effective work operation 2. Resource implications Things necessary for the conduct of assessment 2.1. Access to dump truck and job site/terrain 2.2. Operation and maintenance manual 2.3. Available loads 2.4. PPE 2.5. Spotter 2.6 Safety signage’s/barricades 3. Method of assessment Competency in this unit may be assessed through: 3.1 Written examination 3.2 Direct observation/Demonstration with oral questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 75
                },
                "type": "Document"
            }
        ]
    }
]