[
    {
        "name": "Grains Production NC II",
        "core_competencies": [
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 28 CORE COMPETENCIES UNIT OF COMPETENCY : CONDUCT VARIETY AND SEED SELECTION UNIT CODE : AFF 611305 UNIT DESCRIPTOR : This unit covers the knowledge, skills and attitudes required to conduct site characterization, select suitable seed variety and select quality seed. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Conduct site characterization 1.1 Soil characterization is performed according to soil type classification 1.2 Ecosystem is identified according to established classification 1.3 Climatic pattern is identified based on Climatic Type from PAG - ASA 1.4 Topography and elevation of the site are determined based on ocular observation 1.5 Information on the occurrence of prevalent pests and diseases are determined. 1.6 Record keeping is done based on workplace procedures 1.7 Available reference materials are sourced out based on work requirements.  Soil characterization procedures o Soil Sampling o Feel Method o Visual examination  Soil type classification  Types of ecosystem  Types of climatic pattern  Climatic types  Types of land topography  Elevation  Pests and diseases profile  Farm record keeping and documentation  Different reference materials and their sources  Ways of sourcing reference materials  Classifying soil types  Identifying ecosystems  Identifying climatic patterns and types  Determining topography and elevation of the site  Determining previous and current occurrence of prevalent pests and diseases  Communication skills and record keeping skills  Sourcing out of different reference materials 2. Select suitable seed variety 2.1 Varietal characterization is performed for suitability of variety in the site. 2.2 List of recommended varieties is sourced out for reference in selection process.  Morphology and growth stages of rice and corn plant  Varietal characteristics  Agronomic characteristics  Disease and insect  Identifying rice and corn varieties  Determining varietal characteristics  Sourcing of the recommended lists  Selecting variety for",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 31
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 29 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2.3 Suited variety is chosen based on site characterization pest reactions  Adaptability Test  Sources of the recommended lists of rice and corn varieties  Varietal selection procedures  National Seed Industry Council (NSIC) approved seed varieties the specific site 3. Select quality seed 3.1 Classes of seeds are enumerated based on NSIC 3.2 Characteristics of quality seeds are determined based on NSIC 3.3 Germination test is performed according to established procedures 3.4 Quality seeds are chosen based on NSIC 3.5 Return and exchange of non-germinating seeds to the source is done following industry procedures  Classes of seeds  NSIC  Characteristics of Quality seeds  Germination Tests o Date harvested o Computation of seed germination o Sampling  Selection procedures for quality seeds  Return and exchange of non-germinating seeds  Communication skills  Classifying seeds  Determining quality seeds  Conducting seed germination test  Computing seed germination  Selecting quality seeds  Negotiating for the return and exchange of non-germinating seeds to the source",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 32
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 30 RANGE OF VARIABLES VARIABLE RANGE 1. Soil type classification Soil type classification include: 1.1 Sandy loam 1.2 Clay loam 1.3 Silt 1.4 Clay 1.5 Sandy 1.6 Silty clay 2. Ecosystem Ecosystem includes: 2.1 Upland 2.2 Irrigated lowland 2.3 Rain fed lowland 2.4 Saline 2.5 Cool elevated 2.6 Riverine 3. Climatic pattern Climatic pattern includes: 3.1 Wet 3.2 Dry 4. Climatic type Climatic Type includes: 4.1 Type 1 4.2 Type 2 4.3 Type 3 4.4 Type 4 5. Topography Topography includes: 5.1 Hilly 5.2 Flat 5.3 Sloping 5.4 Mountainous 5.5 Plateau 6. Available reference Available reference includes: 6.1 Electronic 6.1.1 Website 6.1.2 Social media 6.1.3 Text messaging 6.2 Prints 6.2.1 Books 6.2.2 Manuals 6.2.3 Production guide 6.2.4 Comics 6.2.5 Pamphlets 6.2.6 Monographs",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 31 VARIABLE RANGE 7. Varietal characteristics Varietal characteristics refer to: 7.1 Agronomic characteristics 7.2 Disease and insect pest reactions 7.3 Seed characteristics 8. Classes of seeds Classes of seeds include: 8.1 Breeder 8.2 Foundation 8.3 Registered 8.4 Certified seeds 8.5 Good seeds 9. Quality seeds Quality seeds include: 9.1 Relatively pure 9.2 Clean 9.3 High germination 9.4 Fewer weed seeds 9.5 Free from seed borne pests and diseases 9.6 Full and uniform in size 9.7 Viable 9.8 Vigor 10. Germination test Germination test includes: 10.1 Rice 10.1.1 Rag doll method 10.1.2 Petri dish 10.2 Corn 10.2.1 Seed box method",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 32 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Characterized site. 1.2 Selected suitable seed variety. 1.3 Selected quality seed. 1.4 Matched rice and corn variety specific to site characteristics 2. Resource implications The following resources MUST be provided: 2.1 Farm site/ simulated workplace 2.2 Different classes of seeds 2.3 NSIC approved rice and corn seed varieties 2.4 PPE 2.5 Tools and equipment relevant to the proposed activity or tasks 2.6 Reference – PNS; Quality Standards and PNS; PhilGap (rice and corn) 3. Methods of assessment Competency in this unit may be assessed through: 3.1 Demonstration 3.2 Written examination 3.3 Oral questioning 4. Context for Assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 33 UNIT OF COMPETENCY: PERFORM LAND PREPARATION UNIT CODE: AFF 611306 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to perform pre-tillage operations, conduct tillage operation and perform post-tillage operation. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Perform pre-tillage operations 1.1 Land clearing activities are done according to topography 1.2 Tools, materials and equipment are made ready for land preparation 1.3 Safety procedures is followed according to OSHS 1.4 Machinery services are sourced out following work requirement 1.5 Dikes are constructed and repaired according to industry standard procedures  Land clearing activities o Importance of land cleaning in rice and corn production.  Different topography  Tools, materials, and equipment required in land preparations  Procedures in preparation of tools, material and equipment  OSHS  PPE  Different machinery services for land preparations  Philippine Good Agricultural Practices (PhilGAP)  Activities of repairing dikes  Clearing the area.  Preparing tools, materials and equipment  Practicing OSHS  Wearing PPE  Sourcing of machinery services  Communication skills  Practicing Phil GAP  Constructing and repairing dikes",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 34 2. Conduct tillage operations 2.1 Tillage operation is carried-out according to standard tillage practices. 2.2 Tillage operation is monitored following established industry procedures 2.3 Safety measures are practiced according to OSH standards.  Tillage operation and practices  Monitoring tillage operation  Characteristics of a well-prepared wetland and dryland fields  OSHS  Safety procedures for land preparation  Performing tillage operation  Monitoring tillage operation  Cleaning the area  Preparing tools, materials and equipment  Practicing OSHS  Wearing PPE  Communication skills  Practicing GAP  Repairing dikes 3. Perform post-tillage operations 3.1 Damaged dikes are repaired following standard industry procedures. 3.2 Proper waste disposal is practiced following environmental rules and regulations. 3.3 Transaction with the machinery service provider is completed with reference to work contract. 3.4 Record keeping is done following workplace procedures.  Activities of repairing dikes  Reinforce dikes using bamboo poles procedure  Proper waste disposal  Procedures in closing transaction with machinery services provider  Communication skills  Simple record keeping  Repairing damaged dikes  Disposing wastes  Completing transactions with machinery service provider  Performing record keeping",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 35 RANGE OF VARIABLES VARIABLE RANGE 1. Land clearing activities Land clearing activities include: 1.1 Cleaning of dikes/levees 1.2 Cleaning of irrigation and drainage canals 1.3 Spreading of remaining crop stubbles 2. Topography Topography includes: 2.1 Hilly 2.2 Flat 2.3 Sloping 2.4 Mountainous 2.5 Plateau 3. Tools, Materials, Equipment Tools, materials and equipment include: 3.1 Equipment 3.1.1 Grass cutter 3.1.2 Knapsack sprayer 3.1.3 PPE 3.1.4 Carabao 3.1.5 Farm Attachments 3.1.5.1 Tooth comb - harrow 3.1.5.2 Carabao - drawn plow 3.1.5.3 Puddler 3.1.5.4 Wooden planks 3.2 Tools 3.2.1 Bolo 3.2.2 Scythe 3.2.3 Spade or shovel 3.2.4 Spading fork 3.2.5 Garden hoe 3.2.6 Rake 3.2.7 A-frame (1 unit) 3.3 Materials 3.3.1 Fuel 3.3.2 Engine oil 3.3.3 Sharpening stone 4. Constructing and repairing dikes Constructing and repairing dikes include: 4.1 Sealing rat burrows, cracks and damaged dikes 4.2 Installing screen mesh to water inlets and outlets 4.3 Elevating water dikes 5. Tillage Operation Tilling operation includes: 5.1 Wet tillage practices 5.2 Dry land tillage practices 5.3 Wet and dry tillage practices. 6. Repairing damaged dikes Repairing damage dikes include: 6.1 Sealing and patching rat burrows, cracks, damaged dikes 6.2 Reinforcing dikes 6.3 Using bamboo poles 6.4 Elevating dikes",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 36 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Performed pre-tillage operations 1.2 Conducted tillage operation 1.3 Performed post-tillage operation 1.4 Practiced safety measures following OSH standards 1.5 Performed record keeping 2. Resource Implications The following resources MUST be provided: 2.1 Farm site/simulated workshop 2.2 Tools, materials, farm implements and equipment for land preparation activities 2.3 PPE 2.4 Operator’s manual 3. Method of Assessment Competency in this unit may be assessed through: 3.1 Demonstration 3.2 Written examination 3.3 Oral questioning 4. Context for Assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 37 UNIT OF COMPETENCY: CARRY OUT CROP ESTABLISHMENT UNIT CODE: AFF 611307 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to germinate seeds, conduct direct seeding operation and establish crop for transplanting. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Germinate seeds 1.1 Seed soaking is done according to industry standards 1.2 Seed is incubated following industry standards 1.3 Incubated seeds are examined for whitish dot as a sign of germination. 1.4 Germinated seeds are handled and transported to site following industry standards 1.5 Wearing of PPE is practiced following the OSHS standards  Procedures of seed soaking  Procedures of seed incubation  Indicators of seed germination  Practice OSHS  Wearing of PPE  Documentation and record keeping  Proper handling and transporting of germinated seeds o Avoidance from contamination of chemicals  Proper wastes disposal (Reduce, Reuse, Recycle - 3Rs)  Soaking of seeds  Incubating seeds  Identifying germinated seed  Handling and transporting of germinated seeds  Wearing PPE  Practicing proper wastes disposal 2. Conduct direct seeding operation 2.1 Tools, materials and equipment are prepared based on work requirements 2.2 Field is checked for readiness for direct seeding operation 2.3 Corrective measures are done based on the result of inspection 2.4 Prevention of pests is employed according to result of inspection 2.5 Direct seeding is performed following  Preparation of tools, materials and equipment  Ways of checking the field  Corrective measures  Prevention of pests  Direct seeding procedures o manual broadcasting  Preparing tools, materials and equipment  Checking field by ocular inspection  Analytical skills  Preventing pests  Using drum seeders  Broadcasting (manual) seeds  Wearing PPE  Using drum",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 38 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS industry recommendations 2.6 Wearing of PPE is practiced according to OSHS standards. 2.7 Drum seeder is used following manufacturer’s manual 2.8 Post operation activities are performed based on workplace procedure. o using of drum seeder  OSHS o PPEs for direct seeding operation  Parts and functions of drum seeder  Post operation activities seeder  Performing post - operation activities 3. Establish crop for transplanting 3.1 Tools, materials and equipment are prepared based on work requirements 3.2 Seedbed site is selected based on recommended criteria 3.3 Seedbed is prepared following industry standards 3.4 Seeds are sown following industry standards 3.5 Seedling management is applied following industry standards 3.6 Wearing of safety gears are practiced according to OSHS standards 3.7 Post operation activities are performed based on workplace procedure 3.8 Pre - transplanting activities are done following industry standards 3.9 Crop insurance is applied for based on recommendation of the industry  Preparation of tools, materials and equipment  Recommended criteria for site selection  Industry standards in seedbed preparations  Industry standards in seed sowing  Industry standards in seedling management  Computation of fertilizer rate  Safety gears used in transplanting  OSHS in transplanting  Pre - transplanting procedures  Post - operations activities  Types of insurances  Procedures in accomplishing insurance forms  Preparing tools, materials and equipment  Selecting seedbed site by ocular inspection  Preparing seedbed  Mathematical skills in measuring seedbed area  Sowing seed  Applying seedling management  Computing for fertilizer rate  Wearing safety gears  Performing pre - transplanting of seedlings  Performing post - operation activities  Applying for crop insurance",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 39 RANGE OF VARIABLES VARIABLE RANGE 1. Seed soaking Seed soaking include: 1.1 Washing of seeds 1.2 Cleaning of the seeds 1.3 Changing of water 2. Incubation Incubation include: 2.1 Transferring of seeds to sack (half-filled) 2.2 Draining of seeds 2.3 Loosening ties of sacks 2.4 Placing of sacks on top of pallet under shaded area 2.5 Covering of sacks 3. Transporting and handling of germinated seeds Transporting and handling of germinated seeds include: 3.1 Prevent germinated seeds from getting wet 3.2 Avoid too much exposure to sunlight 3.3 Cover the germinated seeds from direct sunlight 3.4 Avoid contamination from chemicals 4. Tools, materials and equipment Tools, materials and equipment include: Direct Seeding: Transplanting: 4.1 Tools  shovel  bolo 4.2 Materials  sacks  chemicals  record book  ballpen  germinated seeds  pail/container 4.3 Equipment  drum seeder  knapsack sprayer  PPE/safety gears 4.1 Tools  shovel  bolo  knife 4.2 Materials  sacks  chemicals  record book  ballpen  seedlings  pail/container  rope  planting guide  laminated sacks  tying materials for seedlings o leaves of talahib o leaves of cogon o leaves of lapat 4.3 Equipment  Knapsack sprayer  PPE/safety gears  Carabao 5. Checking of Field Checking of field includes:",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 40 VARIABLE RANGE 5.1 Field leveling 5.2 Excess water for drainage 5.3 presence of pests 6. Direct Seeding Direct seeding includes: 6.1 Manual 6.2 Mechanical 7. Pests Pests include: 7.1 Golden snail 7.2 Rats 7.3 Chicken 7.4 Other stray animals 8. Post operations activities for direct selling Post operation activities include: 8.1 Replanting of open spaces missing hills 8.2 Applying water and nutrient management 8.3 Replanting of open spaces missing hills 8.4 Employing 7s of Good Housekeeping 8.5 Cleaning tools and equipment 8.6 Storage of tools, material and equipment 8.7 Record keeping 8.8 Waste disposal 9. Recommended criteria Recommended criteria include: 9.1 Away from infected area 9.2 Away from artificial lights 9.3 Near water source 9.4 Good soil condition 9.5 Areas with good drainage 10. Seedbed preparation Seedbed preparation includes: 10.1 Dapog 10.2 Modified dapog 10.3 Mat tray 10.4 Wet bed 10.5 Dry bed 11. Safety gears Safety gears includes: 11.1 Masks 11.2 Goggles 11.3 Surgical gloves 11.4 Rubber boots 11.5 Long sleeves shirt 11.6 Hat 11.7 Towel 12. Seedling management Seedling management includes: 12.1 Nutrient management 12.2 Water management 12.3 Pests management",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 41 VARIABLE RANGE 13. Pre-transplanting activities Pre-transplanting activities include 13.1 Flooding of seed bed 13.2 Pulling and tying of seedlings 13.3 Washing of roots 13.4 Hauling and distribution of seedlings 14. Post operation activities for crop establishment Post operation activities include: 14.1 Replanting of missing hills 14.2 Employing 7s of Good Housekeeping 14.3 Cleaning tools and equipment 14.4 Storage of tools, material and equipment 14.5 Record keeping 14.6 Waste disposal 15. Insurance Insurance includes: 15.1 Crop 15.2 Farmer",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 42 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Germinated seeds 1.2 Conducted direct seeding operation 1.3 Established crop for transplanting 1.4 Pulled and transplanted plant 1.5 Applied for crop insurance 1.6 Practiced OSHS 2. Resource Implications The following resources MUST be provided: 2.1 Farm site/ simulated workplace 2.2 Tools, materials and equipment for crop establishment operations 2.3 Seeds and germinated seeds 2.4 Operator’s manual 2.5 PPE 3. Method of Assessment Competency in this unit may be assessed through: 3.1 Demonstration 3.2 Written examination 3.3 Oral questioning 4. Context for Assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 43 UNIT OF COMPETENCY : MANAGE CROP GROWTH UNIT CODE: AFF 611308 UNIT DESCRIPTOR : This unit covers the knowledge, skills and attitudes required to conduct nutrient management, perform water management, carry-out pest management, conduct management of abiotic stresses and conduct seed purification activity. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Conduct nutrient management 1.1 Soil fertility is determined using recommended assessment methods 1.2 Kinds of fertilizer are selected based on soil analysis and crop requirement 1.3 Amount of fertilizer is computed based on industry recommendations 1.4 Fertilizer is applied according to recommendations  Importance of soil analysis  Soil sampling technique/s  Kinds of fertilizer  Ratio and proportion computation for fertilizers  Calendar of fertilizer application o Maturity of variety o Type of soil  Application of fertilizer  Industry recommendations for fertilizer application o Kind o Right amount o Right timing o Right place  Assessing soil fertility  Selecting fertilizers  Computing for ratio and proportion of amount of fertilizer  Preparing calendar of fertilizer application  Applying fertilizer 2. Perform water management 2.1 Water need is assessed based on ecosystem 2.2 Water management strategy is applied based on different cultural crop management 2.3 Water conservation is employed based on established farm practices 2.4 Ocular monitoring is conducted to observe the  Importance of water management on the different growth stages of rice and corn  Water requirements in different ecosystems  Water level and content assessment methods  Importance of different water  Reading or interpreting the measuring instrument for water level  Assessing water level  Applying appropriate management strategies  Employing appropriate water conservation",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 44 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS depth of water management strategies. o Calendar of planting o Scheduling of farm irrigation activities  Water conservation methods and their applications  Different techniques of water impounding o Small farm reservoir o Small water impounding project o Shallow tube well  Procedures of monitoring activities  Monitoring checklist  Kinds of fertilizer  Ratio and proportion computation for fertilizers  Calendar of fertilizer application o Maturity of variety o Type of soil method/s  Conducting monitoring activities 3. Carry-out pest management 3.1 Occurrence of pests and diseases is assessed following industry standard procedures 3.2 Pests and diseases management is adopted based on industry standard procedures 3.3 Regular field monitoring is conducted based on industry procedures 3.4 Action is taken to prevent further crop damages and losses.  Knowledge on the origin/occurrence of a particular disease  Management options for a particular pest/disease (IPM)  Identify/Classify pests and diseases  Agro ecosystem Analysis (AESA) and its importance as a decision-making tool for pests and diseases  Assessing occurrence of pests and diseases  Adopting pests and diseases management  Conducting regular field monitoring  Applying preventive action",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 45 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS management  Different techniques of damage assessment o Cultural o Biological o Mechanical o Chemical  Preventive actions against pest and diseases 4. Conduct management of abiotic stresses 4.1 Assessment of abiotic stresses is done following industry standard procedures 4.2 Abiotic stress management is adopted based on industry standards 4.3 Regular field monitoring is conducted based on industry procedures 4.4 Action is taken based on the result of monitoring activities  Different abiotic stresses  Assessment of abiotic stresses  Abiotic stress management  Field monitoring procedures  Preventive action against abiotic stresses  OHSH practices  Performing assessment of abiotic stress  Adopting abiotic stress management  Conducting regular field monitoring  Applying regular action against abiotic stress 5. Conduct seed purification activity 5.1 Area is selected for seed purification activity based on recommended criteria. 5.2 Off-types are removed following established farm procedures 5.3 Disposal of off-types is done following established farm procedures 5.4 Seeds are harvested based on maturity indices. 5.5 Post-harvest operations are done separately for seed production  Selection criteria  Characteristics of off-types  Stages of rice and corn where rouging is best done  Sources of off-types o Plant height o Color of leaves o Presence/absence of awn o Panicle o Flag leaf o Maturity etc.  Harvest and post-harvest operations  Rouging procedures o Importance of rouging  Phil GAP for rouging  OSHS  Disposal procedures of off-  Understanding the importance of rouging  Identify the proper time of rouging  Selecting area for seed purification activity  Identifying different off-types  Rouging of off-types  Proper disposing of off-types  Performing separate harvesting and post-harvesting operations for seed production  Practicing OSHS  Documenting and record keeping",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 46 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS types and weeds  Environmental rules and regulations on solid wastes management  Phil GAP on agri-wastes disposal  Harvesting and post-harvesting procedures for seed production activity  Record keeping RANGE OF VARIABLES VARIABLE RANGE 1. Assessment methods Assessment methods include: 1.1 Soil analysis 1.2 Minus-One Element Technique 1.3 Leaf Color Chart 1.4 Nutrient Omission Plot Technique 1.5 Rice crop manager (electronic based) 1.6 Leaf tissue analysis 2. Kinds of fertilizer Kinds of fertilizers include: 2.1 Organic 2.2 Inorganic/Synthetic 3. Fertilizer computation Fertilizer computation includes: 3.1. Ratio and proportion 3.2. Simple substitution 4. Methods of fertilizer application Methods of fertilizer application include: 4.1. Basal (First Application) 4.2. Top dressing 4.3. Side dressing 4.4. Foliar Application",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 47 VARIABLE RANGE 5. Recommendations Recommendations include: 5.1 Right kind 5.2 Right amount 5.3 Right Timing 5.4 Right Place 6. Water assessment methods Water assessment methods include: 6.1 Conventional (Level of water in the Paddy) 6.2 Traditional (Stick method, feel method) 7. Water management strategy Water management strategy includes: 7.1 Schedule of irrigation 7.2 Water source 7.3 Water flooding 7.4 Water draining 8. Water conservation Water conservation includes: 8.1 Alternate wetting and drying 8.2 Water impounding 8.3 Mulching 9. Pests and diseases Pests and diseases include: 9.1 Insect pests 9.2 Weeds 9.3 Vertebrate pests (rats and birds) 9.4 Snail 10. Diseases Diseases include: 10.1 Fungal 10.2 Bacterial 10.3 Viral 10.4 Nematodes 11. Pest and diseases management Pests and disease management includes: 11.1 Cultural control 11.2 Biological control 11.3 Chemical control 11.4 Mechanical control 12. Crop damage Crop damages include: 12.1 Diseases infections 12.2 Insect Infestations 12.3 Other crop damages 13. Abiotic stresses Abiotic stresses include: 13.1 Drought 13.2 Extreme temperature 13.3 Light - intensity stress 13.4 Nutrient deficiencies 13.5 Nutrient toxicity",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 48 13.6 Excessive water 13.7 Typhoons/ Strong winds 13.8 Pollutants 13.9 Salinity 13.10 Acidity 13.11 Alkalinity 14. Abiotic stress management Abiotic stress management includes: 14.1 Cultural 14.2 Biological 14.3 Mechanical 14.4 Chemical 15. Action Action includes: 15.1 Exhaust all measures to prevent/ control abiotic stresses 15.2 Report and coordinate with proper authorities for quick response and assistance 15.3 Report and claim crop insurance 16. Selection criteria Selection criteria include: 16.1 Free from pests and diseases 16.2 Accessible to water 16.3 Fertile soil 16.4 Less occurrence of off-types/ rogues 16.5 Away from artificial lights 17. Disposal of off-types Disposal of off-types includes: 17.1 Remove and carry 17.2 Composting 17.3 Feeds for livestock 17.4 Remove and bury 18. Post-harvest Post-harvest includes: 18.1 Piling 18.2 Threshing 18.3 Drying 18.4 Cleaning 18.5 Sacking 18.6 hauling 18.7 Storage 18.8 Dehusking 18.9 Shelling 18.10 Record keeping",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 49 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Conducted nutrient management 1.2 Performed water management 1.3 Carried-out pest management 1.4 Conducted management of abiotic stresses 1.5 Conducted seed purification activity 2. Resource Implications The following resources MUST be provided: 2.1 Farm site/simulated workplace 2.2 Storage area 2.3 Tools, materials and equipment for crop management operations (see section 3.4 for list of equipment, tools and materials) 2.4 Operator’s manual 2.5 Sack (packaging material) 2.6 PPE 3. Method of Assessment Competency in this unit may be assessed through: 3.1 Written Exam 3.2 Oral questioning 3.3 Demonstration 4. Context for Assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 50 UNIT OF COMPETENCY : CONDUCT HARVEST AND POST - HARVEST OPERATIONS UNIT CODE : AFF 611309 UNIT DESCRIPTOR : This unit covers the knowledge, skills and attitudes required to carry out pre - harvest, carryout harvesting activity and carry out post - harvest operations. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Carry out pre - harvest operation 1.1 Matured crop is determined based on physiological growth and physical indicators 1.2 Records of crop agronomic history is verified and referenced for maturity 1.3 Records are verified for harvesting activities following established farm procedures 1.4 Weather condition is monitored based on weather forecast 1.5 Rice field is drained of water according to recommended industry practices 1.6 Obstructions from the field are removed for efficient harvesting 1.7 Harvesting tools and materials are prepared following work requirement. 1.8 Machinery services are obtained for harvest and post - harvest operations.  Physiological indicators of rice and corn crop maturity  Physical indicators of rice and corn crop maturity  Agronomic characteristics of different rice and corn varieties  Records verification  Weather condition and forecasting  Proper water management before harvest  Types of obstructions from the rice field and corn field  Appropriate harvesting tools and materials for rice and corn  Documentation and farm record keeping  The Art of Negotiating  Machinery service providers for rice and corn  Determining matured crop o Identifying physiological indicators of rice and corn crop maturity o Identifying physical indicators of rice and corn crop maturity  Verifying information on agronomic history  Verifying records for harvesting activities  Monitoring weather conditions and forecasts  Preparing contingency plan for weather disturbances  Draining of water from the rice field  Removing obstructions from the field  Preparing harvesting tools and materials  Identifying different",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 51 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS machineries for harvest and post-harvest operations  Negotiating with machinery service providers for rice  Obtaining machinery services 2. Carry out harvesting activity 2.1 Appropriate harvesting methods are implemented based on best cultural practices 2.2 Piling is done based on recommended practices 2.3 PPE is worn according to OSHS 2.4 Harvesting tools are used according to work requirement 2.5 Mechanical harvesting is monitored following work requirement  Harvesting methods o Manual o Mechanical  Piling practices  Procedures for Safety in the use of tools and equipment  Use of honesty tools  Monitoring procedures  Identifying factors affecting quality of grain at harvest  Estimating yield  Harvesting rice and corn crop  Implementing appropriate harvesting methods  Piling of harvested grains  Wearing appropriate PPE  Using harvesting tools  Monitoring mechanized harvesting 3. Carry out post-harvest operations 3.1 Postharvest operations are done based on recommended technologies 3.2 Use of post-harvest equipment and facilities are monitored to avoid grain damage and losses 3.3 Handling and packaging are done according to variety and destination 3.4 Bags of palay are stored in an appropriate storage area 3.5 Monitoring of storage pests and diseases is done based on recommended practices  Postharvest equipment and facilities for grains and their uses  Care & maintenance of post-harvest equipment & facilities  Postharvest grain damages and losses  Proper handling and packaging of grains  Proper storing and stacking of grains  Procedures in monitoring storage pest & diseases  Storage pests & diseases  Performing postharvest operations such as handling/hauling, threshing, cleaning, drying, milling and storing  Identifying different postharvest equipment & facilities  Distinguishing specific uses of the different postharvest equipment & facilities  Identifying grain",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 52 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS  Effective Communication & Coordination damages and estimating spillage/losses  Packaging, sorting and stacking of milled grain following recommended industry standards  Storing and stacking of grain following industry standards  Cleaning of used and infested sacks of grain  Separating old stocks from new ones  Communicating infestation to proper authorities",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08  TR – Grains Production NC II (New) Promulgated December 16, 2015 53 RANGE OF VARIABLES VARIABLE RANGE 1. Physiological growth Physiological growth includes: 1.1 Days after seeding 1.2 Days after transplanting 1.3 Days after panicle initiation 2. Physical indicators Physical indicators include: 2.1 Change in color from green to golden yellow panicles 2.2 From green to brown husks 2.3 Hardening of grains 2.4 Drying of silk 2.5 Translucent grain 3. Crop agronomic history Crop agronomic history includes: 3.1. Variety 3.2. Planting calendar (days after seeding and days after heading) 3.3. For rice, days after seeding and panicle initiation 3.4. For corn, days after sowing 4. Obstructions Obstructions may include but not limited to: 4.1 Weeds 4.2 Stakes 4.3 Wedges 5. Harvesting tools and materials Harvesting tools and materials may include: 5.1 Scythe 5.2 Sacks 5.3 Twines 5.4 Labels/Markers 5.5 Lumber 5.6 bamboos 5.7 Nails 5.8 Roofing material 6. Records Records include: 6.1 Crop history 6.2 Farm activity calendar 6.3 Farm records 7. Machinery services Machinery services include: 7.1 Harvester 7.2 Thresher 7.3 Mechanical dryer 7.4 Rice and corn mill 7.5 Truck hauler 8. Appropriate harvesting Appropriate harvesting methods include: 8.1 Manual 8.2 Mechanical",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 54 VARIABLE RANGE 9. Postharvest operations Postharvest operations include: 9.1 Handling/Hauling 9.2 Threshing 9.3 Dehusking 9.4 Shelling 9.5 Cleaning 9.6 Drying 9.7 Milling 9.8 Packaging and sacking 9.9 Storing 10. Postharvest equipment and facilities Postharvest equipment and facilities include: 10.1 Thresher 10.2 Mechanical dryer 10.3 Dehusker 10.4 Sheller 10.5 Solar dryer 10.6 Rice and corn mill 10.7 Warehouse 11. Damages and losses Damages and losses include: 11.1 Broken grains 11.2 Discolored grains 11.3 Grain impurities 11.4 Spoiled grains 11.5 Pest-infected grains 11.6 Moldy corn 11.7 Spillage due to improper 11.8 Handling 12. Packaging Packaging includes: 12.1 Sacks 12.2 Plastic bags 13. Appropriate storage area Appropriate storage area: 13.1 Cool 13.2 Dry 13.3 Secured 13.4 Free from pests and diseases 13.5 Clean 14. Recommended practices Recommended practices include: 14.1 Using new sacks or cleaning used sacks by removing insect pests 14.2 Separating old stocks from new ones to prevent infestation 14.3 Reporting to immediate authority when infestation is alarming",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TESD - SOP - QSO - 01 - F08 TR – Grains Production NC II (New) Promulgated December 16, 2015 55 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Carried out pre-harvest operation 1.2 Carried out harvesting activity 1.3 Carried out post-harvest operations 2. Resource Implications The following resources MUST be provided: 2.1 Farm site/simulated workplace 2.2 Storage facilities/simulated workplace 2.3 Tools, materials, equipment and machineries for harvesting and post-harvesting operation 2.4 PPE 3. Method of Assessment Competency may be assessed through: 3.1 Written examination 3.2 Oral questioning 3.3 Demonstration 4. Context for Assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Grains Production NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Hairdressing NC II",
        "core_competencies": [
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 26 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM PRE- AND POST-HAIR CARE ACTIVITIES UNIT CODE: HCS5153 01 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in performing pre- and post-hair care activities. These include the draping of the client, the application of shampoo and conditioner on hair and the blow-drying of hair. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare client 1.1 Client is assisted in accordance with salon procedures 1.2 Built of the client is assessed to determine appropriate size of drapery to be used 1.3 Appropriate clothing is provided according to the desired type of service, size and built of the client 1.4 Client is advised to remove all jewelries and accessories 2. Apply shampoo and/or conditioner on the client 2.1 Necessary tool, supplies and materials are selected and prepared according to the type of service 2.2 Hair is checked and analyzed to determine appropriate shampoo and/or conditioner to be used in accordance with the type of hair damage 2.3 Hair is shampooed and or/conditioned in accordance with the type of service and established or acceptable procedures 2.4 Where necessary, first-aid treatment is provided to the client or health personnel 2.5 Client’s safety and comfort is ensured during the entire process 3. Blow-dry hair 3.1 Hair is toweled dried and combed according to service requirements 3.2 Hair is blow-dried according to service requirements and established or acceptable procedures 3.3 Finishing product is applied on blow-dried hair according to product specifications 3.4 Client’s safety and comfort are ensured during the entire process 4. Perform post-service activities 4.1 Tools and equipment are cleaned, sanitized and stored according to OH&S requirements 4.2 Waste materials are segregated and disposed according to OH&S requirements",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 29
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 27 RANGE OF VARIABLES VARIABLE RANGE 1. Clients’ built 1.1 Small 1.2 Medium 1.3 Large 1.4 Extra Large 2. Type of services 2.1 Hair Treatment 2.2 Hair Color 2.3 Hair Bleach 2.4 Perming 2.5 Straightening 2.6 Hair Cut 3. Tools 3.1 Blower 3.2 Brush 3.3 Skeleton Brush 3.4 Roller Brush 3.5 Paddle Brush 3.6 Mirror 3.7 Hand/back Mirror 3 4. Supplies/Materials 4.1 Shampoo 4.2 Conditioner 4.3 Towel 4.4 Tissue/neck strip 5. Established or acceptable procedures in hair shampooing and/or conditioning May include but are not limited to: 5.1 Comb/brush hair to free from entanglement before actual shampooing and/or conditioning 5.2 Apply shampoo and/or conditioner according to the clients’ hair length and volume, and type of service 5.3 Apply appropriate water temperature 5.4 Follow shampooing and/or conditioning technique 5.5 Rinse hair thoroughly and towel dry 6. Established or acceptable procedures in blow-drying hair May include but are not limited to: 6.1 Set blower with correct temperature 6.2 Apply appropriate sectioning using hair implements to achieve optimum results 6.3 Apply blow-dry technique according to service requirements 7. Hair finishing products 7.1 Gel/Hair setting lotion 7.2 Mouse 7.3 Spray Net/hair spray 7.4 Hair Polish/Serum 7.5 Hair wax (wet and dry) 7.6 Leave-on conditioner",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 30
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 28 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Prepared client according to salon policies and procedures 1.2 Prepared and used of tools, supplies/materials according to type of service and OH&S requirements 1.3 Applied correct techniques in draping, shampooing and/or conditioning and blow-drying of hair in accordance with service requirements and established or acceptable procedures 1.4 Ensured client’s safety and comfort during the entire process 1.5 Applied questioning and listening skills in assessing the need of clients 2. Underpinning knowledge 2.1 Salon Policies and Procedures 2.2 Different Types of Shampoo and Conditioners 2.3 Proper Use of Tools, Supplies and Materials 2.4 Code of Ethics 2.5 Different Types and Condition of Hair 2.6 OH & S Rules and Regulations 2.7 Hair Analysis 2.8 Water Temperature 2.9 Proper Hygiene 2.10 Hair Finishing Products 2.11 Different Salon Services 3. Underpinning skills 3.1 Conducting hair analysis 3.2 Communication skills 3.3 Draping technique 3.4 Shampooing and conditioning technique 3.5 Hair blow-drying technique 3.6 Setting and using of tools and equipment 3.7 Following salon policies and procedures 3.8 Hair sectioning 3.9 Using supplies/materials and implements 3.10 Observing code of ethics 4. Resource implications The following resources MUST be provided: 4.1 Model 4.2 Tools, equipment and supplies/materials relevant to the activity to be performed 4.3 Work area/facilities 5. Method of assessment Competency MUST be assessed through: 5.1 Demonstration with oral questioning 5.2 Third-Party Report 5.3 Portfolio 6. Context of assessment Competency may be assessed in the workplace or TESDA accredited assessment center",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 31
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 29 UNIT OF COMPETENCY: PERFORM HAIR AND SCALP TREATMENT UNIT CODE: HCS5153 02 UNIT DESCRIPTOR: This unit covers the knowledge and skills required to treat a range of hair and scalp conditions of clients. It involves preparation of clients, tools and equipment, actual treatment of hair and scalp and performance of post-treatment activities. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare client 1.1 Client’s health and restrictions are determined through consultation 1.2 Client’s scalp and hair condition are analyzed following salon safety policies and procedures 1.3 Protective clothing is prepared and used according to OH&S requirements and salon procedures 2. Treat hair condition 2.1 Supplies/materials and hair treatment product are selected and prepared according to client’s hair condition 2.2 Hair treatment is performed in accordance with established or acceptable procedures 2.3 Result is checked according to client’s desired outcome 2.4 Client’s safety and comfort is ensured during the entire process 2.5 Where necessary, first-aid treatment is provided to the client or referred to health personnel 3. Treat scalp condition 3.1 Scalp treatment product is selected and prepared based on client’s scalp condition 3.2 Scalp treatment is performed in accordance with established or acceptable procedures 3.3 Result is checked according to client desired outcome 3.4 Clients’ comfort and safety is ensured during the process 3.5 Where necessary, first-aid treatment is provided to the client or referred to health personnel 4. Perform post-service activities 4.1 Treatment products used are stored following salon procedures 4.2 Tools and equipment are cleaned, sanitized and stored according to OH&S requirements 4.3 Waste materials are segregated and disposed according to OH&S requirements 4.4 Client is advised on appropriate hair and scalp maintenance",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 32
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 30 RANGE OF VARIABLES VARIABLE RANGE 1. Type of client 1.1 Adult 1.2 Young Adult 1.3 Teenager 2. Scalp condition 2.1 Normal 2.2 Oily 2.3 Dry 3. Hair condition 3.1 Porous / Damaged 3.2 Dry 3.3 Oily 3.4 Normal 3.5 Chemically Treated 4. Protective clothing 4.1 Facial mask 4.2 Apron 4.3 Bath Towel 4.4 Head Band 5. Tools and equipment 5.1 Steamer 5.2 Blower 5.3 Hair brush 5.4 Wide Toothed Comb 5.5 Mixing bowls 5.6 Hair clamps & clips 5.7 Spatula 6. Supplies and materials 6.1 Aluminum Foil 6.2 Tissue Paper 6.3 Cling Wrap 6.4 Silicon brush 6.5 Different treatment products 7. Hair and scalp treatment product form 7.1 Cream Form 7.2 Liquid Form 7.3 Gel Form 8. Established or acceptable procedures in hair and scalp treatment May include but are not limited to: 8.1 Apply treatment product according to product specifications and massage hair and/or scalp 8.2 Expose hair and/or scalp to heat if necessary, according to product specifications 8.3 Follow correct timeline according to product specification 8.4 Rinse hair thoroughly and towel or blow dry. 9. Waste 9.1 Biodegradable 9.2 Non-Biodegradable 10. Hair and scalp maintenance Hair and Scalp Frequent Treatment Use of Hair and Scalp Treatment Product",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 31 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Prepared client through consultation according to salon policies and procedures 1.2 Prepared and used tools, equipment, supplies and materials for hair and scalp treatment according to specifications and OH&S requirements 1.3 Used appropriate protective clothing and gadget following salon policies and procedure 1.4 Performed hair and scalp treatment according to product specifications and established or acceptable procedures 1.5 Ensured client’s safety and comfort during the entire process 1.6 Performed post-service activities according to salon policies and procedures, and OH&S requirements 2. Underpinning knowledge 2.1 Safety Practices 2.2 Different Treatment Products 2.3 Measurements/Ratio and Proportion 2.4 Code of Ethics 2.5 Salon Policies and Procedures 2.6 Hair and Scalp Treatment Procedures and Processes 2.7 Hair Analysis 2.8 Hair types and condition 2.9 Time Management 2.10 DOH and OH&S requirements 3. Underpinning skills 3.1 Proper handling of tools 3.2 Operation of equipment 3.3 Communication skills 3.4 Application of treatment product 3.5 Application of massage technique 3.6 Checking of hair and scalp condition 3.7 Compliance with DOH, OH&S requirements 3.8 Safekeeping of equipment and tools 3.9 Compliance to target treatment timeline 3.10 Observing code of ethics 4. Resource implications The following resources MUST be provided: 4.1 Model 4.2 Tools, equipment and supplies/materials relevant to the activity to be performed 4.3 Work area/facilities 5. Method of assessment Competency may be assessed through: 5.1 Demonstration with oral questioning 5.2 Third-Party Report 5.3 Portfolio 6. Context of assessment Assessment may be conducted in the actual workplace or TESDA accredited assessment center",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 32 UNIT OF COMPETENCY: PERFORM BASIC HAIR PERMING UNIT CODE: HCS5153 03 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in performing basic hair perming. It involves assessing and preparing the client, actual performance of hair perming, checking of result and doing necessary finishing touches to achieve optimum result. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare client 1.1 Client is advised to remove all personal accessories 1.2 Client is provided with and advised to wear protective clothing 1.3 Condition and type of hair are checked and analyzed 1.4 Previous chemical treatment applied on hair is determined 1.5 Scalp condition is checked if free from scratches and open wounds 1.6 Where necessary, client is advised to defer hair perming based on adverse scalp and health conditions 1.7 Types of hair curls is confirmed with client and recorded 2. Perm hair 2.1 Tools and equipment, supplies/materials are prepared and used according to salon policies and procedures and OH&S requirements 2.2 Perm solution is selected and prepared according to client’s hair type, texture/condition and product specifications 2.3 Hair perming is performed in accordance with established or acceptable procedures and product specifications 2.4 Hair is rinsed thoroughly, towel-dried and conditioner is applied 2.5 Clients’ safety and comfort are ensured during the entire process 3. Apply finishing touches 3.1 Hair is checked according to client’s desired outcome 3.2 Hair is tapered/trimmed and styled if necessary 3.3 Client’s satisfaction is confirmed and adjustments are made if required 4. Perform post-service activities 4.1 Client is advised on hair and care maintenance 4.2 Tools, equipment, supplies and materials are cleaned and stored after use in accordance with salon procedures 4.3 Waste items are properly disposed of in accordance with OH&S requirements 4.4 Workstation is cleaned and prepared for next activity",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 33 RANGE OF VARIABLES VARIABLE RANGE 1. Hair Conditions 1.1 Damaged 1.2 Tinted 1.3 Lightened 1.4 Porous 1.5 Dry 1.6 Greasy or Oily 1.7 Normal 2. Scalp Condition 2.1 Dry or Oily 2.2 Dandruff 2.3 Greasy 2.4 Waxy 2.5 Scaly 3. Types of hair curls 3.1 Wavy 3.2 Curly 4. Tools and Equipment 4.1 Dryer 4.1.1 Handheld, Hood, Infrared 4.2 Curler 4.2.1 Small, Medium, Large, Extension, Extra Large, Jumbo 4.2.2 Wooden Spindle, Nooping, Spiral, Zigzag, Telephone Wire 4.3 Applicator 4.4 Shower Cap 4.5 Flannel Headband 4.6 Drip Pan 4.7 Cape 4.8 Bath Towel 4.9 Bath Comb 4.10 Razor/Scissor 4.11 Hairclips 4.12 Apron 4.13 End Paper 4.14 Ear Pads 4.15 Tail Comb 4.16 Rubber Band 4.17 Rubber Gloves 5 Supplies Materials 5.1 Shampoo 5.2 Perm solution 5.3 Neutralizer 5.4 Conditioner 5.5 End Paper 5.6 Powder 5.7 Roll tissue 5.8 Cotton 5.9 Rubber Band 5.10 Disposable Gloves 6. Established or acceptable procedures in hair perming May include but are not limited to: 6.1 Shampoo hair without conditioner and without scratching the scalp 6.2 Towel dry, section and wind hair according to selected types of hair curls and apply selected perm solution 6.3 Cover wounded hair with plastic cap/cling wrap or expose to dry heat",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 34 VARIABLE RANGE 6.4 Check progress of wave from time to achieve optimum result 6.5 Rinse thoroughly without removing the curlers and towel blot 6.6 Apply hair with neutralizer and leave-on on specified time 6.7 Remove curlers / rollers and slightly massage hair and scalp 6.8 Shampoo and condition hair thoroughly, rinse and towel-dry 7. Hair care and maintenance 7.1 Use of wide toothed comb 7.2 Application of hair polishing products 7.3 Daily hair wash with appropriate shampoo and conditioner 7.4 Regular hair treatment",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 35 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Consulted client on the type of curls required 1.2 Assessed hair and scalp condition as free from scratches and open wounds 1.3 Provided protective clothing to client 1.4 Selected and prepared perming solution according to client’s requirements and manufacturer’s specifications 1.5 Performed hair perming in accordance with established or acceptable procedures 1.6 Ensured client's safety and comfort throughout the whole process 1.8 Applied final touch on hair according to client’s requirements 1.9 Applied appropriate measures in response to emergencies or unavoidable circumstances 1.10 Performed post-service activities according to salon policies and procedures, and OH&S requirements 2. Underpinning knowledge 2.1 Code of Ethics 2.2 OH&S Requirements 2.3 Hair Texture / Condition 2.4 Different Scalp Condition 2.5 Heating Procedures 2.6 Different Perm Maintenance Program 2.7 Time Management 2.8 Principles of Customer Relations 2.9 Different Perming Products 2.10 DOH – IRR and OH&S rules and regulations 2.11 First-aid treatments 3. Underpinning skills 3.1 Listening and Questioning Skills 3.2 Customer Relation Skills 3.3 Observing hair sectioning 3.4 Applying winding technique 3.5 Applying massage technique 3.6 Trimming 3.7 Applying shampooing and blow-drying techniques 3.8 Handling Tools and Equipment 3.9 Using Perming Product 3.10 Observing code of ethics 3.11 Applying first-aid treatments 4. Resource implications The following resources MUST be provided: 4.1 Model 4.2 Tools, equipment and supplies/materials relevant to the activity to be performed 4.3 Work area/facilities 5. Methods of assessment Competency may be assessed through: 5.1 Demonstration with Oral Questioning 5.2 Portfolio 5.3 Third-Party Report 6. Context of assessment Competency may be assessed in the workplace or TESDA accredited assessment center",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 36 UNIT OF COMPETENCY: PERFORM BASIC HAIR COLORING UNIT CODE: HCS5153 04 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in the performance of basic hair coloring. This involves preparing the client prior to treatment, the actual application of coloring and post-coloring activity. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare client 1.1 Client is consulted and advised on color options, and checked for possible skin allergies 1.2 Condition of the hair and scalp are checked and analyzed 1.3 Protective clothing and materials are prepared and used according to OH&S requirements 1.4 Client is draped following established procedures to avoid stains from hair coloring 1.5 Where necessary, client’s hair is shampooed to remove remaining conditioners and styling products, making sure the scalp is not scratched 2. Apply hair color 2.1 Tools, materials, implements are prepared and used following OH&S requirements 2.2 Color and developer are selected and mixed according to client’s hair condition and length and desired outcome 2.3 Color is applied according to product specifications and established or acceptable procedures 2.4 Where necessary, hair is styled according to client’s particular requirements 2.4 Client’s safety and comfort are ensured during the process 3. Perform post-service activities 3.1 Client is advised on hair care and maintenance for colored/dyed hair 3.2 Tools, materials, implements are cleared, sanitized and stored according to OH&S rules and regulations 3.3 Wastes are disposed of according to OH&S requirements 3.4 Workstation is cleaned and prepared for the next activity",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 37 RANGE OF VARIABLES VARIABL E RANGE 1. Color Options 1.1 Penetrating Tint 1.1.1 Semi-permanent 1.1.2 Permanent 1.2 Coating Dyes 1.2.1 Liquid (Blackening Shampoo) 1.2.2 Powder 1.3 Temporary 2. Hair condition 2.1 Damaged 2.2 Tinted 2.3 Lightened 2.4 Porous 2.5 Dry 2.6 Greasy or Oily 2.7 Normal 3. Scalp condition 3.1 Dry/Oily 3.2 Dandruff 3.3 Greasy 3.4 Waxy 3.5 Scaly 4. Protective clothings and materials 4.1 Ear Pads 4.2 Coloring Pads 4.3 Towels 4.4 Apron 4.5 Cape 4.6 Gloves 5. Established procedures in draping May include but are not limited to: 5.1 Client is draped with bath towel with horizontal edge folded 2 inches outward 5.2 Protective material is wrapped around the neck 5.3 Coloring cape is wrapped around the shoulder 6. Styling products 6.1 Gel/Setting Lotion 6.2 Hair wax (Wet and Dry) 6.3 Hair serum 6.4 Hair spray 6.5 Mousse 6.6 Leave-on conditioner",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 38 VARIABLE RANGE 7. Tools, materials and Implements 7.1 Tinting Brush 7.2 Mixing Bowl 7.3 Measuring Cap 7.4 Timer 7.5 Clips 7.6 Clamps 7.7 Blower 7.8 Infrared 7.9 Frosting Cap w/ Hook 7.10 Squeezer 7.11 Tissue 7.12 Foil 7.13 Cotton 7.14 Colorants 7.15 Kinds of Developers (depending on the brands) 8. Color Applications 8.1 Fullhead Color 8.2 Regrowth/retouch 8.3 Highlights (Frosting, streaking, wearing, slicing) 8.4 Color Correction 8.5 Pre – pigmentation 9. Established or acceptable procedures in hair coloring May include but are not limited to: 9.1 Section hair 9.2 Sub-section hair and follow application techniques 9.3 Emulsify product to achieve color balance 9.4 Check evenness of color through hair strand test and expose to proper lighting following the required development time 9.5 Rinse hair thoroughly with shampoo and conditioner 10. Hair maintenance product 10.1 Shampoo and conditioner for colored hair 10.2 Finishing Product 10.3 Hot Oil 10.4 Hair Spa 10.5 Styling Aids",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 39 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Consulted client on color options and performed skin test prior to hair coloring 1.2 Checked and analyzed hair condition and scalp 1.3 Selected, prepared and used tools, materials and implements according to client’s requirements and OH&S requirements 1.4 Selected and mixed color products and developer based on client’s desired outcome and hair condition following product specifications 1.5 Performed hair coloring following established or acceptable procedures and product specifications 1.6 Ensured client’s safety and comfort during the entire process 1.7 Applied appropriate measures in response to emergencies or unavoidable circumstances 1.8 Performed post-service activities in accordance with standard procedures and salon policies 2. Underpinning knowledge 2.1 Skin Test (Patch test as per client safety precautions) 2.2 Hair Analysis (Consultation) 2.3 Fundamentals and Principles in Hair Coloring 2.4 Classification of Hair Coloring 2.5 Color Product Knowledge 2.6 Kinds of Developer and Their Uses 2.7 Chemical Mixtures and Their Uses 2.8 Color Development Timeline 2.9 Mensuration, Mixing Ratio and Proportion 2.10 Basic Mathematics (Computation) 2.11 Color Theory/Harmony 2.12 Hair Texture and Condition 2.13 Basic Color Selection 2.14 Basic Application of Hair Coloring 2.15 Hair Maintenance Program 2.16 DOH-IRR and OH&S rules and regulations 2.17 Code of Ethics 3. Underpinning skills 3.1 Applying hair coloring techniques 3.2 Applying shampooing techniques 3.3 Handling tools 3.4 Observing hair sectioning 3.5 Proper Storage of Products and Tools 3.6 Draping Procedures 3.7 Performing Skin Test Procedures 3.8 Observing mixing procedures 3.9 Observing code of ethics 4. Resource implications The following resources MUST be provided: 4.1 Model 4.2 Tools, equipment and supplies/materials relevant to the activity to be performed 4.3 Work area/facilities 5. Method of assessment Competency MUST be assessed either of the following: 5.1 Demonstration with Oral Questioning 5.2 Portfolio 5.3 Third-Party Report 6. Context of assessment Competency may be assessed in the workplace or TESDA accredited assessment center",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 40 UNIT OF COMPETENCY: PERFORM BASIC HAIRCUTTING UNIT CODE: HCS5153 05 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in performing basic haircut service. It involves conducting initial consultation with the client, assessing their needs, actual cutting of the hair, checking and applying finishing touches and performing post-hair cutting activities. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare client 1.1 Appropriate courtesy is extended to the client at all times 1.2 Shape of the client’s face, head, length and width are assessed according to his/her built and height 1.3 Texture of hair is analyzed according to style requirements and kind of cutting to be administered 1.4 Hair catalog is presented to the client and the haircut style is selected and agreed upon by both parties 1.5 Protective clothing is provided and used according to health and sanitation regulations 1.6 Hair is shampooed and/or conditioned following salon procedures 2. Cut hair 2.1 Appropriate materials, tools and hair implements are prepared and used according to client’s desired haircut and OH&S requirements 2.2 Haircut is performed according to haircut style and established or acceptable procedures 2.3 Client’s safety and comfort are ensured during the entire process 2.4 Where necessary, first-aid treatment is provided to the client or referred to health personnel 3. Check hair and apply appropriate finishing touches 3.1 Hair is blow-dried and checked for accuracy and finishing touches 3.2 Finishing cutting tools are used according to haircut style 3.6 Hair finishing product is applied as per client’s requirements and style 3.4 Client’s acceptance is confirmed and adjustments are made if required 4. Perform post-service activities 4.1 Client is advised on proper hair care and maintenance 4.2 Tools, implements and equipment are cleaned, sterilized and stored in accordance with salon policy 4.3 Waste items are properly disposed of in accordance with OH&S required practice 4.4 Working area is cleaned in preparation for the next client",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 41 RANGE OF VARIABLES VARIABLE RANGE 1. Protective clothing 1.1 Towels 1.2 Apron 1.3 Cape 4 Hair Catalog 2.1 Men’s Cut Catalog 2.2 Ladies Cut Catalog 2.3 Kid’s Cut Catalog 5 Hair Cut Styles 3.1 Straight Cut 3.1.1 Long straight cut 3.1.2 Short straight cut 3.2 Layered Cut 3.2.1 Long layered cut 3.2.2 Short layered cut 3.3 Graduated Layers 4. Hair Texture 4.1 Fine 4.2 Medium 4.3 Coarse 4.4 Wiry 5. Shape of face 5.1 Rectangle or Elongated 5.2 Inverted /Pear 5.3 Heart 5.4 Oval 5.5 Triangular 5.6 Square 5.7 Diamond 5.8 Round 6 Materials, Tools and Implements 7.1 Supplies/Materials 7.1.1 Powder 7.1.2 Blade 7.2 Implements 7.2.1 Clamps 7.2.2 Clips 7.3 Tools 7.4.1. Blower 7.4.2. Spray Gun 7.4.3. Hair brush 7.4.4. Barber brush 7.4.5. Comb 6. Established or acceptable procedures in haircutting May include but are not limited to: 6.1 Shampoo hair and towel dry 6.2 Section hair according to haircut style 6.3 Apply cutting technique and style to achieve desired haircut 7. Finishing Cutting Tools 7.1 Thinning Scissor 7.2 Cutting Scissor 7.3 Razor 7.4 Clippers 8. Hair Finishing Products 8.1 Gel/Styling gel 8.2 Mousse 8.3 Spray Net/Hair spray 8.4 Hair Polish/hair serum 8.5 Hair Wax (wet and dry)",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 42 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Consulted and prepared client according to desired haircut 1.2 Prepared and used appropriate tools, equipments and implements according to OH & S requirements 1.3 Used protective clothing according to health and sanitation regulations 1.4 Performed haircutting and techniques according to desired hair cut and established or acceptable procedures 1.5 Performed cross checking and applied appropriate finishing touches 1.6 Client’s safety and comfort is ensured during the entire process 1.7 Applied appropriate measures in response to emergencies or unavoidable circumstances 1.8 Performed post-service activities in accordance with standard procedures and salon policies 2. Underpinning knowledge 2.1 Different basic hair cut styles and techniques 2.2 Principles of hair analysis 2.3 Tricology (Anatomy of Hair/Hair Theory) 2.4 Different types equipments and cutting tools: Their uses and specifications 2.5 First Aid treatment 2.6 DOH-IRR and OH&S rules and regulations 2.7 Client relation and handling and consultation technique 2.8 Principle of sanitation procedures 2.9 Code of ethics 3. Underpinning skills 3.1 Using appropriate cutting tools, equipment implements 3.2 Applying first aid treatment 3.3 Analyzing client facial shape and hair analysis 3.4 Complying with DOH-IRR and OH&S requirements 3.5 Performing different haircut and styling procedure and techniques 3.6 Consulting and dealing with clients 3.7 Demonstrating sanitation 3.8 Observing code of ethics 3.9 Applying first-aid treatment 4. Resource implications The following resources MUST be provided: 4.1 Model 4.2 Tools, equipment and supplies/materials relevant to the activity to be performed 4.3 Working area/facilities 5. Method of assessment Competency may be assessed through: 5.1 Demonstration with Oral Questioning 5.2 Portfolio 5.3 Third-Party Report 6. Context of assessment Competency may be assessed in the workplace or TESDA accredited assessment center",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 43 UNIT OF COMPETENCY: PERFORM HAIR BLEACHING UNIT CODE: HCS5153 06 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in the performance of hair bleaching activity. It involves the preparation of the client, the actual bleaching of hair and performing necessary post-bleaching activity. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare client 1.1 Client is consulted on health condition and previous hair chemical treatment availed 1.2 Client is advised on possible service options and outcome results 1.3 Conditions of the hair and scalp is checked and analyzed 1.4 Client is advised to remove all personal accessories 1.5 Client is provided with protective clothing and gadgets following salon procedures 1.6 Where necessary, client’s hair is shampooed without scratching the scalp and blow-dried 2. Bleach hair 2.1 Supplies, materials, tools, equipment, and implements are prepared and used according to OH&S requirements 2.2 Bleaching product is mixed with right volume of developer according to manufacturers’ instructions and client’s hair texture 2.3 Hair bleaching is performed according to established or acceptable procedures and product specifications 2.4 Clients’ safety and comfort are ensured during the process 2.5 Where necessary, first-aid treatment is provided to client or referred to health personnel 3. Perform post-service activities 3.1 Client is advised on hair care and maintenance 3.2 Tools and equipment and implements are sanitized and stored after use according to salon procedures 3.3 Wastes are disposed of according to OH&S requirements 3.4 Workstation is cleaned and prepared for the next activity",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 44 RANGE OF VARIABLES VARIABLE RANGE 1. Health Condition 1.1 Pregnant 1.2 With skin allergies / irritation 1.3 With Asthma 2. Previous Hair Chemical Treatment 2.1 Straightening 2.2 Perming 2.3 Relax 2.4 Coloring 2.5 Rebonding 2.6 Hair bleaching 3. Hair Conditions 3.1 Normal 3.2 Dry 3.3 Porous 3.4 Damaged 3.5 Tinted 4. Scalp conditions 4.1 Open wounds 4.2 Irritated scalp 4.3 Dried scalp 4.4 Oily scalp 5. Protective Clothing and Gadgets 5.1 Neck Strip (Cloth/tissue) 5.2 Cape 5.3 Towel (White) 5.4 Apron 5.5 Gloves 5.6 Ear Pads 5.7 Disposable Mask 6. Supplies/Materials 6.1 Bleaching Product 6.2 Developer 6.3 Shampoo 6.4 Conditioner 6.5 Cling Wrap 6.6 Aluminum foil/Paper strip",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 45 VARIABLE RANGE 7. Tools, Equipment, Implements 7.1 Gloves 7.2 Mixing Bowl 7.3 Tinting Brush 7.4 Timer 7.5 Clamps or Clips 7.6 Infrared 7.7 Blower 7.8 Measuring Glass 7.9 Weighing Cup 7.10 Hook 7.11 Frosting Cap 7.12 Steamer 8. Bleaching Product 8.1 Powder 8.2 Cream 8.3 Liquid 9. Developers 6% or 20 volume 9% or 30 volume 12% or 40 volume 10. Bleach Mixing Ratio 10.1 1:1 10.2 1:1.5 10.3 1:2 10.4 According to manufacturers’ instruction 11. Established or acceptable procedures in hair bleaching May include but are not limited to: 11.1 Section hair 11.2 Apply mixed bleaching product according to client’s specification 11.3 Determine bleaching development through visual check and touch following level of lightness according to desired outcome 11.4 Check bleached for evenness from roots to ends all over and corrective measures are applied on areas with uneven results 11.5 Rinse hair thoroughly and dry according to client’s requirement 11.6 Where necessary, apply hairstyling product on bleached hair and style according to client’s desire 12. Hair care and maintenance 12.1 Hot Oil Treatment 12.2 Hair Spa 12.3 Hair Reborn / Hair reconstruction 12.4 Daily application of hair care products",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 46 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Consulted client and analyzed his/her hair and scalp condition 1.2 Selected and used appropriate supplies, materials, tools, equipment and implements 1.3 Performed proper mixing procedures of different bleaching products according to product specifications 1.4 Performed hair bleaching according to client’s requirements, product specifications and established or set procedures 1.7 Ensured client’s safety and comfort during the entire process 1.8 Applied appropriate measures in response to emergencies or unavoidable circumstances 1.9 Performed post-service activities according to salon policies and procedures, and OH&S requirements 2. Underpinning knowledge 2.1 Hair and Scalp Analysis 2.2 Bleaching Procedures 2.3 Levels of Lightening 2.4 Mixing Procedures 2.5 Safety Sanitation Rules 2.6 Code of Ethics 2.7 Different Forms of Bleaching Products 2.8 Different Types of Developers 2.9 Different Service Options 2.10 Types of Hair and Scalp Conditions 2.11 DOH-IRR and OH&S Rules and Regulations 2.12 First-aid Treatment 3. Underpinning skills 3.1 Different Methods of Application 3.2 Hair Sectioning 3.3 Handling of Tools and Equipment 3.4 Using of Supplies and Materials 3.5 Waste Disposal Practice 3.6 Draping Procedure 3.7 Bleaching Application 3.8 Observing Code of Ethics 3.9 Applying First-aid Treatment 4. Resource implications The following resources MUST be provided: 4.1 Model 4.2 Tools, equipment and supplies/materials relevant to the activity to be performed 4.3 Work area/facilities 5. Method of assessment Competency MUST be assessed either of the following: 5.1 Demonstration with Oral Questioning 5.2 Portfolio 5.3 Third-Party Report 6. Context of assessment Competency may be assessed in the workplace or TESDA accredited assessment center",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 47 UNIT OF COMPETENCY: PERFORM HAIR STRAIGHTENING UNIT CODE: HCS5153 08 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in straightening hair. This includes preparing the client, applying hair straightening product, ironing of hair and checking and retouching on the result. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare client 1.1 Client is advised to remove all personal accessories 1.2 Protective clothing and gadgets are used to ensure client's safety and comfort 1.3 Client hair texture and condition, together with scalp are checked and analyzed 1.4 Previous hair treatment is confirmed with the client before doing the desired service 1.5 Client is draped and shampooed without scratching the scalp 2. Apply hair straightening product 2.1 Necessary tools and materials are prepared and used according to OH&S requirements 2.2 Different forms of products are identified and/or mixed based on types of hair and desired hair straightening service in accordance with manufacturers' instruction 2.3 Hair straightening is performed in accordance with product specifications and established or acceptable procedures 2.4 Client's safety and comfort are ensured during the entire process 2.5 Where necessary, first-aid treatment is provided to client or referred to health personnel 3. Iron Hair 3.1 Hair is blow-dried according to salon procedures 3.2 Protective hair product is applied through the hair before actual ironing 3.3 Iron plate is set in accordance with hair condition 3.4 Hair is sub-sectioned according to salon procedures 3.5 Hair is ironed in accordance with salon procedures 4. Apply hair fixing solution 4.1 Fixing solution is applied on the hair in accordance with manufacturer's instructions 4.2 Processing time is followed according to manufacturer's instructions 4.3 Hair is rinsed thoroughly and applied with necessary treatment products according to manufacturers' instructions 4.4 Result is checked and hair is styled according to clients' desired outcome 5. Perform post service activities 5.1 Client is advised on hair care and maintenance 5.2 Tools, implements and equipment are cleaned, sterilized/sanitized and stored after use in accordance with salon procedures 5.3 Waste items are properly disposed of in accordance with OH&S requirements 5.4 Working area is cleaned in preparation for the next client",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 48 RANGE OF VARIABLES VARIABLE RANGE 1. Personal accessories 1.1 Earrings 1.2 Necklace 2. Protective clothing and gadgets 2.1 Rubber Cape 2.2 Bath Towel 2.3 Ear Pads 2.4 Apron 2.5 Gloves 2.6 Mask 3. Hair Texture 3.1 Fine 3.2 Medium 3.3 Thick 4. Hair Condition 4.1 Dry 4.2 Porous / Damaged 4.3 Sensitized 5. Tools 5.1 Mixing Bowl 5.2 Scoop or Spatula 5.3 Tail Comb 5.4 Hand Blower 5.5 Hair Brush 5.6 Clips or Clamps 5.7 Large Tooth Comb 5.8 Hair Iron 6. Supplies and Materials 6.1 Shampoo 6.2 Straightening 6.3 Conditioner 6.4 Styling Products 6.5 Neutralizer 6.6 Tissue 7. Different forms of straightening product 7.1 Cream 7.2 Liquid 7.3 Powder 8. Types of hair 8.1 Wavy 8.2 Curly 8.3 Straight 9. Types of hair straightening services 9.1 Relaxing 9.2 Rebonding 9.3 Permanent Blow Dry 10. Established or acceptable procedures in hair straightening May include but are not limited to: 10.1 Section hair 10.2 Apply hair straightening product on the hair and leave-on on specified time 10.3 Check hair to monitor progress of straightening 10.4 Follow development time according to product specifications and hair condition 10.5 Rinse hair thoroughly and towel dry 11. Protective hair and scalp product 11.1 Liquid form 11.2 Talcum Powder 11.3 Cream 12. Setting of iron plate temperature 12.1 120 degrees F 12.2 160 degrees F 12.3 180 degrees F 12.4 200 degrees F 13. Hair care and maintenance program undergo weekly hair treatment. 13.1 Hair Spa 13.2 Hair Reborn 13.3 Hot-Oil Treatment 13.4 Frequent or Regular Salon Visit",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 49 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Consulted and prepared client on the desired type of hair straightening services and its procedures 1.2 Prepared and used tools, supplies/materials and protective clothing according to job requirements and OH&S requirements 1.3 Selected and prepared hair-straightening products according to client’s type of hair and product specifications 1.4 Performed hair straightening in accordance with established or acceptable procedures 1.5 Applied protective product on the hair before ironing it 1.6 Ironed hair according to appropriate direction, timeline and temperature following salon procedures 1.7 Ensured client’s safety and comfort during the entire process 1.8 Applied appropriate measures in response to emergencies and unavoidable circumstances 1.9 Performed post-service activities according to salon policies and procedures, and OH&S requirements 2. Underpinning knowledge 2.1 Code Of Ethics 2.2 Salon Procedures/Policies 2.3 Hair Sectioning 2.4 Hair Blow-dry Technique 2.5 Hair Types and Texture 2.6 Hair and Scalp Condition 2.7 Different Tools And Materials: Their uses and specifications 2.8 Different Supplies And Products 2.9 Straightening Product and Its Application Procedures 2.10 DOH – IRR and OH&S Rules and Regulations 2.11 Hair Iron Temperature 2.12 Development Time Requirements 2.13 First-aid Treatment 3. Underpinning skills 3.1 Conducting hair and scalp analysis 3.2 Using tools and materials 3.3 Using and applying straightening product of different forms 3.4 Applying hair and scalp protective products 3.5 Performing hair sectioning 3.6 Blow-drying technique 3.7 Ironing technique 3.8 Shampooing technique 3.9 Checking of result 3.10 Draping of clients 3.11 Observing code of ethics 3.12 Applying first-aid treatment 4. Resource implications The following resources MUST be provided: 4.1 Model 4.2 Tools, equipment and supplies/materials relevant to the activity to be performed 4.3 Work area/facilities 5. Method of assessment Competency may be assessed through: 5.1 Demonstration with Oral Questioning 5.2 Portfolio 5.3 Third-Party Report 6. Context of assessment Competency may be assessed in the workplace or TESDA accredited assessment center",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 50 UNIT OF COMPETENCY: APPLY BASIC MAKE-UP UNIT CODE: HCS515314 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude in applying basic facial make-up. It also involves the preparation of the client, application of make-up and the performance of post-facial make-up activities. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare clients 1.1 Client is advised to remove all personal accessories 1.2 Client is consulted on specific make-up requirements 1.3 Shapes of face and skin type/tones of client are analyzed according to make-up requirements 1.4 Client is seated in a comfortable position during the entire process 1.5 Client is provided with protective clothing following salon procedures 2. Apply make-up 2.1 Hand is sanitized before actual application of make-up 2.2 Make-up products and accessories, tools, supplies and materials are selected and prepared according to client make-up requirement 2.3 Make-up application is performed in accordance with established or acceptable procedures 2.4 Make-up result is checked before application of finishing touches 2.5 Client’s comfort and safety are ensured during the entire process 3. Perform post-service activities 4.1 Client is advised on appropriate product and procedure in applying retouch and removing make-up 4.2 Make-up products, tools, materials and implements are cleaned and stored after use in accordance with salon procedures 4.3 Waste items are properly disposed of in accordance with OH&S requirements 4.4 Workstation is cleaned and prepared for the next activity",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 51 RANGE OF VARIABLES VARIABLE RANGE 1 Personal Accessories 1.1 Earrings 1.2 Necklace 1.3 Any pierced items in the face 2 Basic make-up requirements 2.1 Day Make-Up 2.2 Evening Make-Up 2.3 Bridal 3 Shapes of face 3.1 Rectangle or Elongated 3.2 Inverted/Pear 3.3 Heart 3.4 Oval 3.5 Triangular 3.6 Square 3.7 Diamond 3.8 Round 4 Skin type 4.1 Dry 4.2 Normal 4.3 Oily 5 Skin tones 5.1 Fair 5.2 Light 5.3 Medium 5.4 Dark 6 Protective clothing 6.1 Towel 6.2 Headband 6.3 Bib 7. Make-up Product and accessories 7.1 Make-up products may include but are not limited: 7.1.1. Concealer 7.1.2. Cake of Liquid Foundation 7.1.3. Blusher 7.1.4. Eyeshadow 7.1.5. Eye Liner (liquid/pencil/cake) 7.1.6. Eye Brow Pencil 7.1.7. Lip Pencil 7.1.8. Lip Stick 7.1.9. Mascara 7.1.10. Face Powder 7.2 Make-up accessories may include but are limited to: 7.2.1. Eye Gel 7.2.2. Powder Glitter 7.2.3. Artificial eye lashes",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 52 VARIABLE RANGE 8. Make-up tools, supplies and materials 8.1 Sponge 8.2 Sharpener 8.3 Cotton Buds 8.4 Eyelash Curler 8.5 Powder Applicator 8.6 Flat brush 8.6.1. Lip Brush 8.6.2. Eye Liner Brush 8.6.3. Eye Shadow Brush 8.6.4. Large Eyebrow Brush 8.6.5. Small Eyebrow Brush 8.6.6. Large Blusher Brush 8.6.7. Powder Brush 8.6.8. Brow with Comb Brush 8.7 Eye Brow Scissor 8.8 Eye Brow Blade 8.9 Tweezers 9. Established or acceptable procedures in basic make-up application May include but are not limited to: 9.1 Clean or wash face using cleansing products 9.2 Apply foundation and concealer evenly on face and neck 9.3 Apply cheek rouge to cover dark spots of the face 9.4 Apply eyeshadow 9.5 Apply fresh powder 8.6 Enhance or curl eyelashes with mascara 8.7 Define eyebrow 8.8 Enhance eyelid with eyeliner 8.9 Apply lipstick 10. Make-up result 10.1 Evenness of make-up application and proper distribution (lightness and darkness of make-up) 10.2 Essential application of make-up 10.3 Blending of colors 10.4 Appropriateness of make-up with the occasion 10.5 Symmetry and balance of eyebrow arc and shape, and blush-on 10.6 Face and lips contouring is achieved",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 53 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Consulted clients on specific basic make-up requirements 1.2 Performed analysis of client’s face, skin tone and type in accordance with make-up requirements 1.3 Prepared and used appropriate make-up tools, materials and accessories according to client’s make-up requirements 1.4 Applied make-up products based on product specifications 1.5 Performed checking before applying finishing touches on client 1.6 Performed safe and sanitary procedures in handling client 1.7 Applied appropriate measures in response to emergencies or unavoidable circumstances 1.8 Performed post-service activities according to salon policies and procedures, and OH&S requirements 2. Underpinning knowledge 2.1 Code of Ethics 2.2 Different Facial Shapes 2.3 Basic Facial Make-up Techniques 2.4 Make-Up Procedure/Sequence 2.5 Facial Skin and Type Analysis 2.6 Make-Up Products 2.7 Make-Up Techniques 2.8 DOH-IRR and OH&S rules and regulations 3. Underpinning skills 3.1 Handling clients 3.2 Contouring of face 3.3 Handling of tools and materials 3.4 Applying make-up/blending of colors as per requirement 3.5 Finishing touches/recommendation for touch-up 3.6 Observing code of ethics 3.7 Applying first-aid treatment 4. Resource implications The following resources MUST be provided: 4.1 Model 4.2 Tools and supplies/materials relevant to the activity to be performed 4.3 Work area/facilities 5. Method of assessment Competency may be assessed through: 5.1 Demonstration with Oral Questioning 5.2 Portfolio 5.3 Third-Party Report 6. Context of assessment Competency may be assessed in the workplace or TESDA accredited assessment center",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 54 SECTION 3 TRAINING STANDARDS This set of standards provides Technical and Vocational Education and Training (TVET) providers with information and other important requirements to consider when designing training programs for HAIRDRESSING NC II. This includes information on curriculum design; training delivery; trainee entry requirements; tools and equipment; training facilities; trainers qualification and institutional assessment. 3.1 CURRICULUM DESIGN Course Title: HAIRDRESSING NC Level: NC II Nominal Training Duration: 18 Hrs (Basic) 18 Hrs (Common) 620 Hrs (Core) 656 Total Hours Course Description: This course is designed to enhance the knowledge, skills and attitudes of hairdressers in accordance with industry standards. It covers the basic, common and core competencies in Hairdressing NC II. BASIC COMPETENCIES (18 Hours) Unit of Competency Learning Outcomes Methodology Assessment Approach 1. Participate in workplace communication 1.1 Obtain and convey workplace information 1.2 Complete relevant work related documents 1.3 Participate in workplace meeting and discussion • Group discussion • Interaction • Written test • Practical/performance test • Interview 2. Work in a team environment 2.1 Describe and identify team role and responsibility in a team. 2.2 Describe work as a team member. • Group discussion • Interaction • Observation • Simulation • Role playing 3. Practice career professionalism 3.1 Integrate personal objectives with organizational goals 3.2 Set and meet work priorities 3.3 Maintain professional growth and development • Group discussion • Interaction • Demonstration • Observation • Interviews/questioning 4. Practice occupational health and safety 4.1 Evaluate hazards and risks 4.2 Control hazards and risks 4.3 Maintain occupational health and safety awareness • Group Discussion • Plant tour • Symposium • Observation • Interviews",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 55 COMMON COMPETENCIES (18 Hours) Unit of Competency Learning Outcomes Methodology Assessment Approach 1. Apply quality standards 1.1 Assess clients service needs 1.2 Assess own work 1.3 Engage in quality improvement • Group Discussion • Interaction • Written Test • Practical/ Performance Test • Interview 2. Maintain a safe, clean and efficient work environment 2.1 Comply with health regulations 2.2 Prepare and maintain work area 2.3 Check and maintain tools and equipment 2.4 Check and maintain stocks 2.5 Provide a relaxed and caring environment • Group Discussion • Interaction • Written Test • Practical/ Performance Test • Interview 3. Maintain an effective relationship with clients/ customers 3.1 Maintain a professional image 3.2 Build credibility with customers/clients • Group Discussion • Interaction • Written Test • Practical/ Performance Test • Interview 4. Manage own performance 4.1 Plan completion of own workload 4.2 Maintain quality of own performance • Group Discussion • Interaction • Written Test • Practical/ Performance Test • Interview",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "TR - Hairdressing NC II Amended November 2010 56 CORE COMPETENCIES (620 Hours) Unit of Competency Learning Outcomes Methodology Assessment Approach 1. Perform pre and post hair care activities 1.1 Prepare client 1.2 Apply shampoo and/or conditioner to client 1.3 Blow-dry hair • Lecture • Discussion • Demonstration • Written Test • Practical/ Performance Test • Interview 2. Perform hair and scalp treatment 2.1 Prepare client 2.2 Treat hair and scalp condition 2.3 Perform post-service activities • Lecture • Discussion • Demonstration • Written Test • Practical/ Performance Test • Interview 3. Perform basic hair perming 3.1 Prepare client 3.2 Perm hair 3.3 Apply finishing touches 3.4 Perform post-service activities • Lecture/ Demonstration • OJT • Written Examination • Demonstration • Observation 4. Perform basic hair coloring 4.1 Prepare client 4.2 Apply hair color 4.3 Perform post-service activities • Lecture/ Demonstration • OJT • Written Examination • Demonstration 5. Perform basic haircutting 5.1 Prepare client 5.2 Cut hair 5.3 Check and apply appropriate finishing touches 5.4 Perform post-service activities • Lecture/ Demonstration • OJT • Written Examination • Demonstration • Observation 6. Perform hair bleaching 6.1 Prepare client, 6.2 Bleach hair 6.3 Perform post-service activities • Lecture/ Demonstration • OJT • Written Examination • Demonstration • Observation 7. Perform hair straightening 7.1 Prepare client 7.2 Apply hair straightening product 7.3 Iron hair 7.4 Apply fixing solution 7.5 Perform post-service activities • Lecture/ Demonstration • OJT • Written Examination • Demonstration • Observation 8. Apply basic make-up 8.1 Prepare client 8.2 Apply make-up 8.3 Perform post-service activities • Lecture/ Demonstration • OJT • Written Examination • Demonstration • Observation",
                "metadata": {
                    "source": "datasets\\raw\\Hairdressing NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "Health Care Services NC II",
        "core_competencies": [
            {
                "page_content": "TR Health Care Services NC II - 30 - CORE COMPETENCIES UNIT OF COMPETENCY: PREPARE AND MAINTAIN BEDS UNIT CODE: HCS323314 UNIT DESCRIPTOR: This unit of competency covers the knowledge, skills and attitudes required in preparing and making beds and performing after-care activities. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare area for bed making 1.1 Personal protective equipment is used, according to institutional policy 1.2 Bed height is adjusted as necessary 1.3 Bed surroundings are cleared of medical and other equipment before bed is stripped, where necessary 1.4 Patient privacy, comfort and safety is provided at all times 1.5 Bed linen is checked for displaced personal items, aids and equipment and such aids/equipment are placed in appropriate area/container 2. Make bed 2.1 Bed linen is stripped, where necessary 2.2 Clinical waste and soiled linen are removed and placed in appropriate container 2.3 Bed is cleaned according to established procedures, where necessary 2.4 Clean bed linen is placed on bed in accordance with institution procedures 2.5 Existing bed linen is remade, as needed 2.6 Patient is asked whether he/she is comfortable, or if he/she has any preferred bed needs 2.7 Reusable clean bed linen is handled in accordance with institution procedures 2.8 Mattresses and pillows are cleaned and disinfected, in accordance with established procedures 2.9 Bed height is adjusted for occupancy and brakes are applied according to bed type 3. Perform after-care activities 3.1 Beds and equipment/aids are kept accessible and bed is left ready for occupancy 3.2 Damaged and/or faulty beds, equipment mattresses, pillows and linen are reported to appropriate personnel and documented accordingly. 3.3 Soiled linen and clinical wastes are discarded according to established protocol 3.4 Cleaning implements are cleaned and returned to designated storage areas or disposed of appropriately.",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 33
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 31 - RANGE OF VARIABLES VARIABLE RANGE 1. Personal Protective Equipment (PPE) PPE include but not limited to: 1.1 Gloves 1.2 Mask 1.3 Cap 1.4 Gown 2. Beds 2.1 Electro-mechanical bed 2.2 Maternity delivery bed 2.3 Hospital bed 2.4 Folding bed 2.5 Renal chair 2.6 Balkan frame 2.7 Trolley 2.8 Pediatric bed 2.9 Isolettes 3. Equipment 3.1 Pressure care devices e.g. floatation mattress, egg carton mattress, foam mattress 3.2 Bedside table 3.3 Over bed table 3.4 Bed end note holder 3.5 Chair lifts 3.6 Walking frames / sticks 3.7 Commodes 3.8 Sling 3.9 Straps 3.10 Splints 3.11 Monkey grips 3.12 Foot stool 3.13 Personal aids such as eye glasses, hearing aids, glass eyes, false teeth, breast prosthesis, false limbs 4. Bed Linen 4.1 Sheets 4.2 Blankets 4.3 Pillow cases 4.4 Under-blankets 4.5 Mattress protectors 4.6 Personal bed linen",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 34
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 32 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Prepared area for bed making 1.2 Made bed 1.3 Performed after care 1.4 Used appropriate PPE 1.5 Handled soiled linen safely 1.6 Performed bed cleaning procedures 1.7 Followed instructions according to institutional policies and guidelines 2. Underpinning knowledge 2.1 Types of bed 2.2 Types of linen 2.3 OSH policies and procedures 2.4 Hygiene policies and procedures 2.5 Infection control policies and procedures 3. Underpinning skills 3.1 Cleaning different types of beds 3.2 Safe manual handling techniques 3.3 Correct disposing clinical waste 3.4 Correct bed making procedures in hospital corners 3.5 Oral and written communication skills 3.6 Problem solving skills required include the ability to use available resources and priorities workload 3.7 Working with others and display empathy and courtesy with patient and their relatives 4. Resource implications The following resources MUST be provided; 4.1 Access to relevant workstation 4.2 Relevant institutional policies, guidelines, procedures and protocol 4.3 Equipment and materials relevant to the proposed activities 5. Method of assessment Competency may be assessed through: 5.1 Demonstration with questioning 5.2 Interview 5.3 Third party report 6. Context of assessment 6.1 Competency may be assessed in the workplace or in a simulated work setting.",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 35
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 33 - UNIT OF COMPETENCY: COLLECT AND MAINTAIN LINEN STOCKS AT END-USER LOCATIONS UNIT CODE: HCS323315 UNIT DESCRIPTOR: This unit of competency covers the knowledge, skills and attitudes required to collect soiled linen from end-user locations, deliver soiled linen to a designated holding area, distribute clean linen and maintain linen stock levels at end-user locations. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Collect soiled linen 1.1 Soiled linen is collected as scheduled from end user locations 1.2 Soiled linen bag is replaced in accordance with institution policies and procedures 1.3 Soiled linen is transported to designated holding area using appropriate equipment and safe handling techniques 1.4 Collection of soiled linen is carried out in a manner that minimizes the risk of cross contamination and complies with OHS policy and procedures 1.5 Hazards are identified and reported to supervisor 1.6 Appropriate procedures for dealing with accidents, including sharp injuries are followed correctly 2. Distribute clean linen 2.1 Clean linen is transported as scheduled to end-user locations using appropriate equipment and safe handling techniques 2.2 Linen is replaced to ensure adequate supply for users 2.3 Linen stock is rotated and old stock returned for reprocessing 3. Maintain linen stock levels 3.1 Optimum stock levels are maintained to ensure linen availability 3.2 Linen is requisitioned to par level quantity 3.3 Linen is stored in linen storage facilities and maintained according to institution requirements 3.4 Linen stock records are maintained according to institution requirements 3.5 Linen inventory is done according to institution policies and procedures",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 36
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 34 - RANGE OF VARIABLES VARIABLE RANGE 1. End-User Locations 1.1 Hospital 1.2 Aged care facility 1.3 Residential accommodation 1.4 Operating room 1.5 Out-Patient Services 1.6 Central Supply Room 1.7 Health Clinics 1.8 Community health facilities 2. Institutional policies & procedures 2.1 Linen stock delivery, inventory management and stock rotation 2.2 Collection locations and procedures 2.3 Standard work practice for safe handling of soiled linen 2.4 Use of protective clothing 2.5 Notification of hazards and accidents 2.6 Data recording (manual or electronic) 2.7 Security and safe storage of clean and soiled linen 3. Equipment 3.1 Linen trolleys of various sizes 3.2 Linen bags 3.3 Baskets 3.4 Bins 4. Hazards 4.1 Exposure to heat 4.2 Sharp objects 4.3 Potentially infectious materials 4.4 Exposure to harmful chemicals 5. Maintenance of optimum linen stock levels 5.1 Review of inventory levels for each linen item 5.2 Assessment of user requirements based on past and expected utilization of linen 6. Linen Stock Records 6.1 Patients 6.2 Requisition of forms 6.3 Stock cards 6.4 Inventory forms 6.5 Philippine standards, infection control and quality standards 7. Linen storage facilities 7.1 Shelves 7.2 Racks 7.3 Trolleys 7.4 Cabinets 7.5 Linen bags",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 35 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Complied with institutional requirements, OSH laws, infection control and manual handling procedures and relevant health regulations 1.2 Collected soiled linen 1.3 Distributed clean linen 1.4 Maintained stock levels of linen accurately and in a timely and safe manner 1.5 Completed work systematically with attention to details, without injury to patient and self, damage to goods, equipment or risk to personnel. 1.6 Communicated effectively with user - locations in relation to linen utilization, inventory and stock levels. 2. Underpinning knowledge 2.1 Types of linen and individual uses 2.2 Relevant OSH regulations, laws and infection control practice, institutional policies and procedures 2.3 Safety and environmental aspects related to workplace operation and manual handling, including workplace hazards 2.4 Delivery and collection schedules 2.5 Quality standards 2.6 Inventory procedures and documentation 3. Underpinning skills 3.1 Handling linen products appropriately 3.2 Assessing and maintaining linen requirements 3.3 Selecting and using appropriate equipment 3.4 Meeting patient and institution specifications/requirements 3.5 Communicating effectively within the workplace 3.6 Applying defined procedures i.e. OSH and infection control 3.7 Recognizing and adapting to cultural differences in the workplace, including modes of behavior and interactions among staff and others 3.8 Basic arithmetic skills 3.9 Oral and written communication skills 4. Resource implications The following resources MUST be provided: 4.1 Relevant policies and procedures manuals 4.2 Institution mission statement, strategic and business plan 4.3 Other documents relevant to the work context such as: - organizational charts - floor plans - instructions for the use of equipment and materials relevant to the proposed activities - specific instructions for staff - workstation 5. Method of assessment Competency may be assessed through at least two of the following Method: 5.1 Observation of performance 5.2 Interview 5.3 Third party report 5.4 Portfolio 5.5 Demonstration with questioning 6. Context of assessment 6.1 Competency assessment may be done in the workplace or in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 36 - UNIT OF COMPETENCY: ASSIST IN PATIENT MOBILITY UNIT CODE: HCS323316 UNIT DESCRIPTOR: This unit of competency covers the knowledge, skills and attitudes required to assist incapacitated patients in basic physical movements. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare to assist with patient mobility 1.1 Requirements for assisting with patient mobility are confirmed with concerned health personnel and care plan 1.2 Equipment are selected according to prescribed plan of care 1.3 Environment is prepared according to established guidelines 1.4 Procedure is explained to patient as required using appropriate communication techniques 2. Assist with patient mobility 2.1 Patient mobility is carried out using safe handling Method and equipment as required 2.2 Appropriate action is taken to ensure patient comfort and safety throughout positioning or transfer 2.3 Communication with patients during movement is undertaken according to established procedures 3. Complete patient mobility assistance 3.1 Patient is moved to prescribed position and concerned health personnel are informed accordingly 3.2 Equipment is cleaned in accordance with established procedures 3.3 Equipment’s working condition is reported immediately in accordance with established procedures",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 37 - RANGE OF VARIABLES VARIABLE RANGE 1. Equipment Equipment may include but not limited to: 1.1 Wheelchair 1.2 Chairlifts 1.3 Crutches 1.4 Commodes 1.5 Slings 1.6 Splints 1.7 Stretcher 1.8 Cot 1.9 Bed with side rails 1.10 Hoist with mechanical lifter 2. Environment 2.1 Hospital room 2.2 Health care facility 2.3 Home 2.4 Ambulance 3. Communication techniques 3.1 Oral 3.2 Written 3.3 Sign language 4. Safe handling Method 4.1 Assisting patient to walk 4.2 Assisting patient to change position 4.3 Placing patient to wheelchair 4.4 Assisting patient to crutches or other walking aids 4.5 Transporting patient by wheelchair or stretcher 4.6 Assisting the patient to use a hoist or mechanical lifter for transfer",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 38 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Performed safe handling Method in assisting with patient mobility 1.2 Ensured patient privacy at all times 1.3 Implemented comfort and safety measures according to established procedures 1.4 Utilized appropriate communication techniques in instructing patients 1.5 Cleaned equipment in accordance with established procedures 1.6 Reported condition of equipment according to established procedures 1.7 Observed strict infection control guidelines 2. Underpinning knowledge 2.1 Patient confidentiality and privacy requirements 2.2 Cleaning policy and procedures for lifting and transferring equipment 2.3 Patient condition as it relates to patient mobility 2.4 OSH procedures 2.5 Infection control guidelines 2.6 Appropriate communication techniques 2.7 Equipment use and specifications 3. Underpinning skills 3.1 Using appropriate equipment for patient mobility 3.2 Communicating effectively with patients and concerned health care personnel 3.3 Safe handling skills 3.4 Oral and written communication skills 3.5 Dealing with conflicts 3.6 Working with others and display empathy with patient and relatives 4. Resource implications The following resources MUST be provided during assessment except in cases where portfolio or third-party report will be used: 4.1 Workplace health and safety manual 4.2 Infection control manual 4.3 Standard Operating Procedures manual 4.4 Equipment manufacturer’s instructions 4.5 Equipment as described in the range of variables 5. Method of assessment Competency may be assessed through: 5.1 Demonstration with questioning 5.2 Portfolio 5.3 Third party report 6. Context of assessment 6.1 Competency assessment may be done in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 39 - UNIT OF COMPETENCY: ASSIST IN TRANSPORTING PATIENTS UNIT CODE: HCS323317 UNIT DESCRIPTOR: This unit of competency covers the knowledge, skills and attitudes required to safely and efficiently assist in transporting patients from one location to another. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Prepare patient for transport 1.1 Transportation requirements are confirmed with appropriate health care personnel 1.2 Transport procedures are explained to patient as required 1.3 Preparations are made for the safe and efficient transport of the patient as per instructions 1.4 Equipment for transportation is readied according to requirements and checked to ensure that it is clean, complete and functional 2. Assist in patient transport 2.1 Patient is transported to designated location in accordance with established procedures 2.2 Equipment is adjusted to ensure patient comfort and safety with minimal risk to self 2.3 Patient is brought to designated location and reported to appropriate health care personnel 3. Perform post-transport procedures 3.1 Equipment is cleaned in accordance with established procedures 3.2 Equipment is returned according to standard operating procedures 3.3 Working condition of equipment is reported immediately in accordance with established procedures.",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 40 - RANGE OF VARIABLES VARIABLE RANGE 1. Transportation requirements These may include but not limited to: 1.1 Mode of transport 1.2 Destination 1.3 Information specific to the patient 1.4 Accompanying health professionals e.g. nurse or medical officer 1.5 Patient clothing requirements 1.6 Documentation requirements 2. Transportation equipment 2.1 Transportation equipment:  Wheelchair  Stretcher  Bed  Ambulance 2.2 Other equipment  Oxygen trolley  IV Stand  oxygen gauge  Oxygen tank  Ambu bag 3.6 Communication equipment  Cellular phone  2 way radios 3. Relevant personnel 3.1 Medical officers 3.2 Nursing staff 3.3 Other health personnel",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 41 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Confirmed the transportation requirements with appropriate health care personnel 1.2 Explained the transport procedures to the patient 1.3 Checked and reported the condition of the equipment for transportation 1.4 Adjusted equipment to ensure the patient’s comfort and safety with minimal risk to self 1.5 Interpreted and followed instructions and guidance of health professionals with the care of patients 1.6 Transported and delivered patient to correct destination 2. Underpinning knowledge 2.1 Patient handling procedures 2.2 Procedures for securing a patient 2.3 Infection control procedures 2.4 Patient confidentiality and privacy requirements 2.5 When patient issues need to be referred to an appropriate health professional 3. Underpinning skills 3.1 Applying safe working practices, including manual handling techniques 3.2 Interpreting and following the instructions and guidance of health professionals regarding care of the patients 3.3 Reading and writing skills 3.4 Oral communications skills 3.5 Working with others and display empathy with patient and relatives 4. Resource implications The following resources MUST be provided: 4.1 Access to equipment used for transporting patients 4.2 Relevant policies and procedures manuals 4.3 Organizational charts 4.4 Instructions for the use of equipment 5. Method of assessment Competency may be assessed through: 5.1 Observation 5.2 Demonstration with questioning 5.3 Portfolio 6. Context of assessment 6.1 Assessment may be done in the workplace or in a simulated workplace setting",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 42 - UNIT OF COMPETENCY: ASSIST IN BIO-PSYCHOSOCIAL SUPPORT CARE OF PATIENTS UNIT CODE: HCS323318 UNIT DESCRIPTOR: This unit of competency covers the basic knowledge, skills and attitudes which apply to the provision of bio-psychosocial support care of patients in various healthcare situations. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Establish and maintain rapport with the patient 1.1 Initial contact is made with patient care and its appropriate time according to the care plan and/or established procedures 1.2 Courtesy is demonstrated in all communication with patients and staff in the workplace 1.3 Interpersonal exchanges are initiated with patient as appropriate 1.4 Communication is developed and maintained for effective relationship with patients 1.5 Trust and confidence of patient is consistently generated in all of the relevant work activities that are undertaken 1.6 Confidentiality and privacy of patient is consistently maintained 1.7 Patient’s rights and roles in decision-making is respected 2. Obtain information regarding the bio-psychosocial needs of the patient 2.1 Patient information is obtained from the family/significant others and concerned health personnel 2.2 Patient bio-psychosocial care needs are determined and recognized 2.3 Scope, nature and frequency of patient support needs and confirmed with patient and appropriate health personnel as required 2.4 Patient information is reported as appropriate and conforms with ethico-moral, legal, professional and institutional requirements 3 Provide assistance to meet patient needs as directed 3.1 Comfort and safety measures are provided according to the care plan and direction of the health professional 3.2 Assistance and support is provided with minimum physical and emotional discomfort to patients and with minimum risk to self 3.3 Assistance is provided in emergency situations according to prescribed protocol",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 43 - RANGE OF VARIABLES VARIABLE RANGE 1. Patients Patients include: Individuals with impairment such as: - Vision impairment - Hearing impairment - Physical disability or frailty - Mental or intellectual disability - Cognitive impairment 1.1 Frail aged 1.2 Young disabled 1.3 Elderly discharge 1.4 Medical condition or illness 1.5 Other family members 1.6 A range of cultures and language backgrounds 2. Communication Communication may include: 2.1 Oral 2.2 Written 2.3 Sign language 2.4 Vernacular/Filipino/English 3. Communication May be by: 3.1 Telephone 3.2 Cell phone 3.3 Face to Face 3.4 Electronic media 3.5 Fax message 3.6 Letters, notes 4. Confidentiality and Privacy 4.1 Written details (medical and consent forms) 4.2 Conversation 4.3 Information disclosed to appropriate person consistent with one’s level of accountability 4.4 Legal and ethical requirements 5. Patient information 5.1 Demographic details 5.2 Lifestyle practice 5.3 Patient care plan 5.4 History (medical and mental) 6. Concerned health personnel 6.1 Nurses 6.2 Doctors 6.3 Social workers 6.4 Nutritionists 6.5 Therapists 6.6 other members of the health team 7. Bio-psychosocial care needs Bio-psychosocial care needs may include but not limited to: 7.1 Nutrition 7.2 Responsive to changes: physical, psychological, financial 7.3 Bio-psychosocial support system 7.4 Activities of daily living 7.5 Adjustment to illness and disability 8. Emergency situations 8.1 Falls/slipping 8.2 Choking/aspiration/suffocation 8.3 Equipment related accidents 8.4 Burns",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 44 - VARIABLE RANGE 8.5 Depression/suicide 8.6 Acute Confusion 8.7 Poisoning 8.8 Fire 8.9 Assault 8.10 Other life threatening situations 9. Comfort and Safety Measures Comfort and safety measures may include but not limited to: 9.1 Creating a therapeutic environment 9.2 Practicing body mechanics 9.3 Measuring and assessing cardinal signs 9.4 Personal hygiene and grooming 9.5 Cleansing/tepid sponge bath 9.6 Bed shampoo 9.7 Child/adult complete bed bath 9.8 Perineal Care 9.9 Hot and cold applications 9.10 Ensuring intake and output 9.11 Positioning and removing 10. Physical, social, emotional, spiritual and culture 10.1 Fees 10.2 Health fund entitlements 10.3 Welfare entitlements 10.4 Payment Method and records 10.5 Public environment 10.6 Legal and ethical requirements 10.7 Writing details i.e. medical and consent forms 10.8 Conversations on the telephone 10.9 Secure location for written records 10.10 Offering a private location for discussions 10.11 Information disclosed to an appropriate person consistent with one’s level of responsibility",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 45 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Established rapport with the patient 1.2 Maintained confidentiality and privacy 1.3 Complied with established policies and procedures 1.4 Communicated effectively with patients and significant others and concerned health personnel 1.5 Responded effectively to patient's lifestyle and psychosocial care needs 1.6 Provided care with minimum risk to patient, self and other health personnel 2. Underpinning knowledge 2.1 Basic knowledge on common diseases/ailments of target groups i.e. diabetes, Parkinson’s strokes etc 2.2 Basic life support 2.3 Infection control guidelines 2.4 Existing health services/facilities 2.5 Rights and responsibilities of patient and health personnel 2.6 Literacy and numeracy relative to delivery of patient care 2.7 Living skills (activities of daily living) 2.8 Occupational Safety and Health 2.9 HACC (home and community care) guidelines 2.10 Basic knowledge on how to handle difficult and challenging behavior 2.11 Institutional policies and procedures 2.12 Basic knowledge on impact of lifestyle change 2.13 Impact of own values and beliefs on others 3. Underpinning skills 3.1 Oral and written communication skills 3.2 Exercising patience and tolerance 3.3 Using time management strategies to set priorities 3.4 Following institution policies and procedures relating to work performance 3.5 Basic problem-solving skills required include the ability to use available resources and priority workload 3.6 Dealing with conflict 3.7 Working with others and display empathy with patient and significant others 4. Resource implications The following resources MUST be provided: 4.1 Documented patient health information 4.2 Relevant policies and procedures manuals 4.3 Patient care-related forms 4.4 Workstation 5. Method of assessment Competency may be assessed through: 5.1 Third party report 5.2 Observation of work performance at workstation 5.3 Portfolio 5.4 Interview 6. Context of assessment 6.1 Assessment may be done in a workplace or in a simulated workplace setting.",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 46 - UNIT OF COMPETENCY: HANDLE WASTE IN A HEALTH CARE ENVIRONMENT UNIT CODE: HCS323319 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes to handle and dispose of waste in a safe manner within the health care environment. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Determine job requirements 1.1 Work sheets are reviewed to determine waste handling requirements 1.2 Appropriate equipment required for waste handling tasks is selected and obtained to maximize work effectiveness and efficiency 1.3 Health care sites are organized and set up to ensure safe, effective and efficient handling of waste in accordance with workplace requirements and relevant legislation 1.4 Potential risks and hazards to work are identified and managed in accordance with workplace requirements, OSH, infection control and other relevant legislation 1.5 Reporting identified risks are followed in accordance with workplace procedures 1.6 Emergency and personal protective equipment are selected and fitted in accordance with job requirements, manufacturers’ specifications, workplace requirements and relevant legislation 2. Identify and segregate waste 2.1 Hazardous, dangerous and non-conforming waste is clearly identified and handled in accordance with workplace policies and procedures as well as relevant legislation 2.2 All waste are accurately identified, labeled and segregated according to waste types in accordance with workplace policies and procedures and relevant legislation 2.3 All sorted waste are carefully placed into correct waste category containers to prevent litter in work areas and avoid cross-contamination 2.4 Waste containers are frequently monitored to ensure adequate available containers and to secure containment of waste 2.5 Full waste containers are emptied or replaced promptly to minimize disruption to the workplace in accordance with policies and procedures and job requirements 2.6 Segregated waste is clearly labeled in accordance with job requirements, workplace policies and procedures and relevant legislation 3. Transport and store waste 3.1 Appropriate transport equipment is selected for waste transport activities to maximize work effectiveness and efficiency and in accordance with workplace policies and procedures and relevant legislation",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 47 - ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 3.2 All transport equipment are color-coded and labeled in accordance with workplace policies and procedures and relevant legislation 3.3 Transport loads are secured and not overloaded according to workplace requirements and relevant legislation 3.4 Waste collection rounds are performed as often as required to minimize waste overflow hazards. 3.5 Storage areas are enclosed and secured in accordance with workplace requirement and relevant legislation 3.6 Waste types are stored in accordance with relevant legislation and workplace requirements 4. Conduct quality control activities 4.1 Waste is inspected and checked to ensure that it is placed in the correct waste receptacle 4.2 Storage areas are inspected and checked to ensure that they are secured in accordance with workplace requirements and relevant legislation 4.3 All details of quality control activities are documented accurately and promptly in accordance with workplace requirements and relevant legislation 5. Clean up work areas 5.1 Waste storage sites and all equipment are cleaned to ensure safe and effective future operation in accordance with company requirements 5.2 Waste from cleaning activities is disposed of in accordance with workplace requirements, council requirements and relevant legislation",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 48 - RANGE OF VARIABLES VARIABLE RANGE 1. Health Care sites 1.1 Hospitals 1.2 Nursing homes 1.3 Clinics 1.4 Community settings 1.5 Home settings 2. Waste categories 2.1 Clinical waste 2.2 Body fluids, blood, suctioned fluids, excretions 2.3 Sharps 2.4 Cytotoxic waste 2.5 Pharmaceutical waste 2.6 Chemical waste 2.7 Radioactive waste 2.8 Organic products 2.9 Liquid waste 2.10 General waste 3. Equipment Equipment include but not limited to: 3.1 Barriers and warning signs 3.2 Spill kits 3.3 Mobile garbage bins and trolleys 3.4 Appropriate waste containers 4. Potential risks and hazards 4.1 Risks and hazards that could lead to injury or illness of employees, contractors, visitors or the public 4.2 Damage to plant 4.3 Vehicles or property 4.4 Harm the environment 4.5 Manual handling 4.6 Contamination 4.7 Compaction equipment 4.8 Gases and fumes 4.9 Hazardous waste i.e. sharps 5. Emergency and personal protective equipment May include but not limited to: 5.1 Gloves 5.2 Overalls and protective clothing 5.3 Eye protection 5.4 Appropriate footwear 5.5 Fire extinguisher 5.6 First aid Kit 5.7 Spill Kit 5.8 Emergency Procedures Guide 5.9 Material Safety Data Sheet information 5.10 Breathing apparatus 5.11 Face shield or mask 5.12 Hearing protection 6. Waste characteristics Waste characteristics may include but not limited to: 6.1 Waste streams 6.2 Waste types 6.3 Waste generation 6.4 Disposal Method 6.5 Recycling 6.6 Reuse 6.7 Contamination",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 49 - VARIABLE RANGE 7. Cleaning Method 7.1 Shoveling 7.2 Sweeping out 7.3 Vacuuming 7.4 Use of decontamination products 7.5 Water hosing 7.6 Cleaning products/fluids 8. Workplace procedures Workplace procedures may include but not limited to: 8.1 Cleaning procedures 8.2 Quality activities 8.3 Team meetings 8.4 Incident notification 8.5 Work performance requirements 8.6 Infection control practices",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TR Health Care Services NC II - 50 - EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Interpreted job requirements 1.2 Organized work areas and waste containers 1.3 Selected appropriate emergency and personal protective equipment 1.4 Identified potential risks, hazards to waste handling and waste non-conformances 2. Underpinning knowledge 2.1 Waste types, streams and characteristics 2.2 Site waste management processes 2.3 Workplace waste management plans 2.4 Waste contaminants 2.5 Waste non-conformance procedures 2.6 Potential risks and hazards to waste sorting and containment 2.7 Sorting and transporting techniques 2.8 Containment Method 2.9 Emergency response procedures 2.10 Workplace requirements 2.11 Occupational health and safety requirements 2.12 Duty of care in provision of waste handling activities 2.13 Relevant industry standards 2.14 Relevant legislation 2.15 Relevant environmental regulations 2.16 Infection control guidelines 3. Underpinning skills 3.1 Communication skills 3.2 Identifying waste streams/types/characteristics 3.3 Reading and interpreting work requirements 3.4 Organizing equipment availability 3.5 Operating Equipment 3.6 Materials handling skills 3.7 Identifying waste types 3.8 Identifying and handling waste non-conformances 3.9 Packaging and containment of waste 3.10 Methodical organization of work 3.11 Safe and efficient work practices 3.12 Using emergency and personal protective equipment 4. Resource implications The following resources MUST be provided: 4.1 Waste collection requirements 4.2 Waste management plans 4.3 Range of wastes for identification and handling 4.4 Workplace policies and procedures 4.5 OHS requirements 4.6 Personal protective equipment 4.7 Equipment for waste handling 5. Method of assessment Competency may be assessed through: 5.1 Demonstration with questioning 5.2 Interview 5.3 Portfolio 6. Context of assessment This unit is most appropriately assessed in the workplace or in simulated workplace environment",
                "metadata": {
                    "source": "datasets\\raw\\Health Care Services NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "HEO (Backhoe Loader) NC II",
        "core_competencies": [
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM PRE - AND POST OPERATION PROCEDURES FOR EARTHMOVING EQUIPMENT UNIT CODE: CON833301 UNIT DESCRIPTOR: This unit describes the outcomes required in performing procedures before and after productive operation of earth moving equipment. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables 1. Perform visual check of equipment 1.1 Earth moving equipment is selected based on job requirements. 1.2 Operator serviceable (OS) parts are checked in accordance with equipment checklist and manufacturer’s procedures. 1.3 Walk-around check is performed with equipment checklist and with engine stopped/not running. 2. Perform “B L O W A F” check 2.1 “BLOWAF” check is performed with checklist form and with engine stopped/not running. 2.2 Deficiencies in fluid levels are identified and if below normal level are refilled/topped up in accordance with equipment maintenance manual. 2.3 Abnormal conditions are noted in checklist and reported to authorized person.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION\n3. Perform operation check\n3.1 Starting/running check is performed with checklist and in accordance with manufacturer’s recommendations.\n3.2 Brake, steering and controls are checked for normal functioning\n3.3 Walk-around check is performed with equipment checklist and with engine running.\n3.4 Safety devices and accessories are checked for proper functions in accordance with safe operating procedures.\n4. Perform post-operation procedures\n4.1 Earth moving equipment is parked and turned off after productive operation in accordance with company rules and regulations.\n4.2 Equipment controls are set into neutral position and parking brakes are engaged according to manufacturer’s operations manual.\n4.3 Safety locks and brakes are all set/engaged in accordance with operator’s manual.\n4.4 Walk-around inspection check is re-conducted while doing engine cool down\n4.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "THE HEAVY EQUIPMENT OPERATION RANGE OF VARIABLES VARIABLE RANGE 1. Earth moving 1.1 Hydraulic Excavator 1.1.1 Crawler type 1.1.2 Wheel type 1.2 Wheel Loader 1.3 Bulldozer 1.4 Motor Grader 1.5 Backhoe Loader 1.6 Road Roller 1.6.1 Static roller 1.6.1.1 Pneumatic roller 1.6.1.2 Drum roller 1.6.1.2.1 Single drum 1.6.1.2.2 Double drum 1.6.2 Vibratory roller 1.6.2.1 Single drum 1.6.2.2 Double drum 2. Operator - serviceable (OS) parts 2.1 Air cleaner 2.2 Battery terminals/Connection 2.3 Belt 2.4 Tire inflation 2.5 Grease/lube points Hydraulic Excavator and Backhoe Loader 2.6 Fuel water separator Bulldozer 2.7 Track tension",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION\n3. Walk-around check\n3.1 Engine off\nHydraulic Excavator, Wheel Loader, and Bulldozer\nBackhoe Loader and Road Roller\n3.1.1 Leaks\n3.1.2 Worn out/damaged parts\n3.1.3 Fluid levels\n3.1.4 Loose parts/connections\n3.1.5 Missing parts\nHydraulic Excavator\n3.1.6 Hook block\n3.1.7 Wire rope cable\n3.1.8 Pulleys\nBackhoe Loader\n3.1.9 Tire condition\n3.2 Engine on\nHydraulic Excavator and Backhoe Loader\n3.2.1 Gauges and controls\n3.2.2 Oil and air leaks\n3.2.3 Safety devices\n3.2.4 Working equipment function e.g. outriggers, boom, hoist\nMotor Grader and Road Roller\n3.2.5 Unusual sounds\nRoad Roller\n3.2.6 Unusual emission of smoke (blue, black and white)\n4. B L O W A F check\n4.1 Battery (starting and charging system)\n4.2 Light (lighting system)\n4.3 Oil (lubricating system)\n4.4 Water (cooling system)\n4.5 Air (intake and exhaust system)\n4.6 Fuel (fuel system)",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION\n5. Fluid levels\n5.1 Battery electrolyte (maintenance type)\n5.2 Engine oil\n5.3 Hydraulic oil\n5.4 Radiator coolant\nHydraulic Excavator, Wheel Loader, Motor Grader, Bulldozer, Backhoe Loader\n5.5 Transmission\nBulldozer, and Motor Grader\n5.6 Fuel\nHydraulic Excavator\n5.7 Gear Oil\n6. Authorized person\n6.1 Equipment supervisor\n6.2 Equipment dispatcher/Foreman\n6.3 Maintenance personnel",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "THE HEAVY EQUIPMENT OPERATION 7. Starting/ Running check May include but not limited to: 7.1 Controls 7.1.1 Travel Wheel Loader, Bulldozer, and Motor Grader Backhoe Loader and Road Roller 7.1.2 Steering/articulation Hydraulic Excavator, and Wheel Loader and Backhoe Loader 7.1.3 Boom Bulldozer, Motor Grader and Road Roller 7.1.4 Blade Bulldozer and Motor Grader 7.1.5 Ripper 7.1.6 Attachment Bulldozer 7.1.6.1 Drawbar 7.1.6.2 Disc plow 7.1.6.3 Bedder Motor Grader 7.1.6.4 Ripper 7.1.6.5 Scarifier Bulldozer 7.1.7 Winch 7.1.8 Tilt/Lift Motor Grader 7.1.9 Lean Wheel Loader and Backhoe Loader 7.1.10 Bucket Hydraulic Excavator and Backhoe Loader 7.1.11 Outrigger 7.1.12 Arm 7.1.13 Swing",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "The Heavy Equipment Operation continuation Hydraulic Excavator 7.1.14 Arm Road Roller 7.1.15 Drum 7.1.16 Vibratory 7.2 Gauges 7.2.1 Battery charging 7.2.2 Pressure 7.2.3 Temperature Motor Grader and Road Roller 7.2.4 Hour meter 7.2.5 RPM 7.3.6 Speedometer 7.3 Leaks in 7.3.1 Lubricating oil 7.3.2 Cooling 7.3.3 Air 7.3.4 Fuel Hydraulic Excavator, Wheel Loader, and Bulldozer and Backhoe Loader 7.35 Hydraulic systems 7.4 Electrical switches/devices 7.4.1 Lights 7.4.2 Horn/alarm Hydraulic Excavator, Wheel Loader, and Bulldozer and Backhoe Loader 7.4.3 Safety devices Motor Grader 7.4.4 Wiper blade 7.5 Steering and brake Backhoe Loader 7.6 Tire condition Road Roller 7.7 Wiper",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "THE HEAVY EQUIPMENT OPERATION\n8. Safety devices and accessories \n8.1 Back up alarm \n8.2 Roll Over Protective Structures \n8.3 Blinkers \n8.4 Safety belt \n8.5 Windshield guard \nBackhoe Loader \n8.6 Back-up alarm \nRoad Roller \n8.7 Safety pin and locks \n8.8 Parking brake \n8.9 Side mirrors \n8.10 Fire extinguisher \n8.11 Battery disconnect switch \n8.12 Steering",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION\n9. Safety locks\n9.1 Control lever lock\n9.2 Door lock\nWheel Loader and Motor Grader\n9.3 Neutralizer lock switch\nWheel Loader, Bulldozer and Road Roller\n9.4 Steering lock\nMotor Grader and Road Roller\n9.5 Implement lock switch\n9.6 Engine gull wing\nHydraulic Excavator and Backhoe Loader\n9.7 Swing lock\nHydraulic Excavator\n9.8 House lock\nBackhoe Loader\n9.9 Outrigger lock\n9.10 Bucket lever lock",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION EVIDENCE GUIDE 1. Critical aspects of evidence to be considered Assessment requires evidence that the candidate: 1.1 Demonstrates ability to select earthmoving equipment based on the job requirements 1.2 Demonstrates ability to check and service operator-serviceable (OS) parts 1.3 Demonstrates ability to perform walk-around and “BLOWAF” inspection following equipment checklist and with engine stopped/not running. 1.4 Demonstrates ability to perform walk-around check while engine is running. 1.5 Demonstrates ability to follow risk-control/safe procedures 1.6 Demonstrates ability to perform post-operation checking procedures 1.7 Demonstrates ability to accomplish daily equipment time record/report (DETR) 2. Underpinning (related) knowledge and attitude 2.1 Types and uses of personal protective equipment (PPE) 2.2 Controls, instruments, indicators and their usage 2.3 Start-up and shutdown procedures 2.4 Familiarity with manufacturer’s operation manual 2.5 Familiarity with job site and work conditions 2.6 Familiarity with pre- and post-operation checklist 2.7 Positive work values (cost, time, quality conscious, etc.) 3. Underpinning skills 3.1 Performing pre- and post-operation procedures of equipment using standard or special attachments 3.2 Using personal protective equipment 3.3 Maintaining equipment records 3.4 Communicating with work site personnel and clients 3.5 Complying with the manufacturer’s operation manual 3.6 Accomplishing pre- and post-operation checklist 4. Resource implications Things necessary for the conduct of assessment include 4.1 Appropriate work area for earthmoving operation 4.2 Access to earthmoving equipment and corresponding manuals.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TRADE HEAVY EQUIPMENT OPERATION\n5. Method of assessment Competency in this unit must be assessed through 5.1 Written/oral questioning 5.2 Observation of practical demonstration 5.3 Work record and documents 6. Context for assessment 6.1 Competency shall be assessed in a normal or a simulated workplace environment and in accordance with safe work procedures. 6.2 Competency shall be assessed while work is being undertaken independently.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION         \nUNIT OF COMPETENCY: PERFORM BASIC PREVENTIVE MAINTENANCE SERVICING FOR EARTH MOVING EQUIPMENT  \nUNIT CODE: CON833302  \nUNIT DESCRIPTOR: This unit describes the outcomes required in the routine preventive maintenance of earth moving equipment.  \nELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables  \n1. Perform adjustments/replacements  \n1.1 Minor defects are identified and remedied in accordance with company/manufacturer’s procedures.  \n1.2 Correct/proper tools are selected based on job requirements.  \n1.3 Major defects are identified with checklist and referred to appropriate personnel.  \n2. Perform basic preventive maintenance servicing (PMS)  \n2.1 OS parts/standards are identified and serviced according to manufacturer’s recommendations.  \n2.2 Fluids and lubricants are used based on manufacturer’s manual.  \n2.3 Appropriate basic hand tools and equipment are identified and used in accordance with site requirements.  \n2.4 Basic preventive maintenance servicing (PMS) is carried out in accordance with manufacturer’s and/or site conditions/requirements.  \n3. Prepare equipment reports  \n3.1 Daily checklist form is properly accomplished in accordance with manufacturer’s/company requirements.  \n3.2 Minor/major equipment defects are reported to concerned personnel.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "THE HEAVY EQUIPMENT OPERATION RANGE OF VARIABLES VARIABLE RANGE 1. Minor defects May include but not limited to: 1.1 Weak battery 1.2 Improper belt tension 1.3 Clogged air filter/cleaner 1.4 Loose clamps Hydraulic Excavator, Wheel Loader and Motor Grader, Road Roller and Backhoe Loader 1.5 Incorrect tire inflation Hydraulic Excavator and Bulldozer 1.6 Incorrect/insufficient track tension Backhoe Loader 1.7 Busted bulbs",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION\n2. Major defects May include but not limited to:\n2.1 Busted hydraulic hose\n2.2 Defective electrical system/electro-mechanical system\n2.2.1 Lighting\n2.2.2 Starting\n2.2.3 Monitoring gauge\nHydraulic Excavator, Wheel Loader and Motor Grader, Road Roller and Backhoe Loader\n2.2.4 Charging\n2.3 Abnormal tire condition\nHydraulic Excavator, Wheel Loader, and Motor Grader, Road Roller and Backhoe Loader\n2.3.1 Worn-out tires\nWheel Loader, Road Roller and Motor Grader\n2.3.2 Flat tires\nHydraulic Excavator, Wheel Loader and Motor Grader, Road Roller and Backhoe Loader\n2.4 Excessive engine oil consumption\n2.5 Leakage in\nHydraulic Excavator, Wheel Loader, Road Roller and Motor Grader and Backhoe Loader\n2.5.1 Air\n2.5.2 Fuel\n2.5.3 Cooling\n2.5.4 Hydraulic system\nWheel Loader, Road Roller and Motor Grader\n2.5.5 Lube\nHydraulic Excavator and Backhoe Loader\n2.6 Hard starting engine\n2.7 Faulty gauges Bulldozer\n2.8 Worn-out undercarriage parts\n2.8.1 Rollers\n2.8.2 Track link\n2.8.3 Bushing\n2.8.4 Pins\n2.8.5 Pads",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION Continuation 2.9 Worn-out ground engaging tool 2.9.1 Cutting edge 2.9.2 End bit 2.9.3 Shank tooth 2.10 Frayed wire rope Backhoe Loader 2.11 Worn-out ground engaging Backhoe Loader and Road Roller 2.12 Abnormal sounds Road Roller 2.13 Worn-out drums (padded and smooth) 2.14 Excessive vibrations of drums 2.15 Worn-out rubber absorber 3. Appropriate personnel May include but not limited to: 3.1 Chief Mechanic 3.2 Equipment Maintenance Supervisor 3.3 Maintenance Personnel 4. Operator-Serviceable (OS) parts 4.1 Air cleaner 4.2 Battery terminals/connections/clamps 4.3 Belt 4.4 All grease/lube points 4.5 All fluid caps 4.5 Filters 4.6.1 Air cleaner Hydraulic Excavator 4.6.2 Water separator Wheel Loader, Road Roller and Motor Grader 4.6 Tire inflation Hydraulic Excavator 4.7 Wire rope grease Backhoe Loader 4.8 Bulbs",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION\n5. Standards\nHydraulic Excavator and Backhoe Loader\n5.1 Oil pressure\n5.2 Air pressure\n5.3 Temperatures\n5.4 Tension\n5.5 Clearance and distances\n6. Fluid and Lubricants\nMay include but not limited to:\n6.1 Engine oil\n6.2 Hydraulic oil\n6.3 Multi-purpose grease\n6.4 Coolant\nHydraulic Excavator, Wheel Loader and Motor Grader and Backhoe Loader\n6.5 Brake fluid/oil\nHydraulic Excavator, Wheel Loader and Bulldozer and Backhoe Loader\n6.6 Battery solutions\nWheel Loader, Bulldozer and Motor Grader\n6.7 Transmission oil\nHydraulic Excavator and Bulldozer\n6.8 Wire rope grease/lubricants\nHydraulic Excavator\n6.9 Cleaning solutions\n6.9.1 Detergent soap\n6.9.2 Degreaser\nBulldozer\n6.10 Fuel\nMotor Grader and Road Roller\n6.11 Battery distilled water\nBackhoe Loader\n6.12 Gear oil",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "THE HEAVY EQUIPMENT OPERATION\n7. Basic hand tools and equipment\n7.1 Hand tools\n7.1.1 Wrenches\n7.1.2 Pliers\n7.1.3 Screwdriver\nHydraulic Excavator, Wheel Loader and Motor Grader\n7.1.3.1 Positive and negative\nBulldozer\n7.1.3.2 Philip and flat tip\nHydraulic Excavator, Wheel Loader, Motor Grader, Bulldozer and Backhoe Loader\n7.1.4 Hammer\n7.1.5 Vice grip\nBulldozer and Backhoe Loader\n7.1.6 Grease gun\nHydraulic Excavator, Wheel Loader and Motor Grader, Road Roller and Backhoe Loader\n7.1.7 Tire gauge (instrument)\nHydraulic Excavator and Backhoe Loader\n7.1.8 Paint brush\n7.1.9 Steel brush\nHydraulic Excavator\n7.1.9 Measuring tape\nBulldozer\n7.1.11 Mud remover\n7.2 Equipment\n7.2.1 High pressure washer\n7.2.2 Air compressor",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION\n8. Basic preventive maintenance servicing (PMS) May include but not limited to:\n8.1 Check battery clamps\n8.2 Check fan belt conditions (cracked or worn-out)\n8.3 Adjust track/belt tensions (if necessary)\n8.4 Clean/Replace filters\n8.4.1 Air cleaner\n8.4.2 Water separator\n8.5 Replace defective fluid caps\n8.6 Grease all fittings on lube points Hydraulic Excavator\n8.7 Grease wire ropes\n9. Site conditions/requirements\n9.1 Instructions\n9.2 Signages\n9.3 Work schedules\n9.4 Work bulletin boards\n9.5 Map (vicinity)\n9.6 Dusty\n9.7 Windy\n9.8 Terrain\n9.8.1 Muddy\n9.8.2 Slippery Wheel Loader, Hydraulic Excavator and Motor Grader and Backhoe Loader\n9.5 Charts\n9.6 Memos",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION EVIDENCE GUIDE 1. Critical aspects of evidence to be considered Assessment requires evidence that the candidate: 1.1 Demonstrates ability to observe safety precautions 1.2 Demonstrates ability to identify minor defects using checklist and in accordance with company rules and regulations. 1.3 Demonstrates ability to identify major defects using checklist and report them to appropriate personnel 1.4 Demonstrates ability to identify OS parts/standards from manufacturer’s reference books/manuals 1.5 Demonstrates knowledge of recommended fluids and lubricants 1.6 Demonstrates ability to use appropriate basic hand tools and equipment 1.7 Demonstrates ability to accomplish and submit daily checklist forms and reports in accordance with company procedures 2. Underpinning (related) knowledge and attitude 2.1 Company rules and regulations 2.2 Basic unit specifications (BUS) 2.3 Safety (PPE, machine and environmental) prevention 2.4 Controls and gauges 2.5 Components, systems and functions 2.6 Comprehension of operation and maintenance manual 3. Underpinning skills 3.1 Using personal protective equipment (PPE) 3.2 Accomplishing daily checklist forms 3.3 Performing basic preventive maintenance 3.4 Using basic hand tools and equipment 3.5 Reporting minor and major defects 4. Resource implications Things necessary for the conduct of assessment 4.1 Access to earth moving equipment specifications and manuals as required 4.2 Appropriate earth moving equipment 4.3 Basic hand tools and equipment 4.4 Fluids and lubricants 4.5 PPE 4.6 Safety signages/barricades 5. Method of assessment Competency in this unit must be assessed through 5.1 Written and/or oral questioning 5.2 Observation of practical demonstration 5.3 Work record and documents",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "THE HEAVY EQUIPMENT OPERATION\n6. Context for assessment\n6.1 Competency shall be assessed in a normal or simulated workplace environment and in accordance with safe work procedures\n6.2 Competency shall be assessed while work is being undertaken independently",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION          \nUNIT OF COMPETENCY: PERFORM PRODUCTIVE OPERATION FOR BACKHOE LOADER  \nUNIT CODE: CON833303  \nUNIT DESCRIPTOR: This unit describes the outcomes required in the productive operation of Backhoe Loader. It covers the skills required to load and unload Backhoe Loader from low-bed trailer. It also deals with the skills required to excavate earth materials on a very limited scale, carrying and loading of materials to dump truck and in performing secondary operations.  \nELEMENT PERFORMANCE CRITERIA  \nBold and Italicized terms are elaborated in the Range of Variables  \n1. Load Backhoe Loader to low-bed trailer  \n1.1 Coordination and communication with authorized signalman is maintained during loading operation.  \n1.2 Backhoe Loader is loaded in correct position using adequate ramp and based on safe operating procedure.  \n1.3 Proper positioning of wheels is observed according to safe working procedure.  \n1.4 All safety locks and controls are properly secured.  \n1.5 Loader bucket is properly rested based on safe work procedure.  \n1.6 Wheels are secured with stopper blocks and binders.  \n1.7 Controls and brakes are checked in line with safety procedure and prior to starting/moving the machine.  \n1.8 Unexpected situations are responded to in line with company rules and regulations and in a manner that minimizes risk to personnel and equipment.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION\n2. Unload equipment from Truck/Trailer (Low)\n2.1 Coordination and communication with authorized signalman is maintained during unloading operation.\n2.2 Binders and stopper blocks are removed prior to unloading operation.\n2.3 All safety locks and controls are set at required position.\n2.4 Loader bucket is properly positioned while Backhoe Loader is being unloaded from low-bed trailer bed.\n2.5 Backhoe Loader is unloaded in correct position using adequate ramp and based on safe operating procedure.\n2.6 Unexpected situations are responded to in line with company rules and regulations in a manner that minimizes risk to personnel and equipment.\n3. Travel Backhoe Loader\n3.1 Work area is surveyed for safe accessibility or potential hazards in accordance with safe operating procedures.\n3.2 Loader bucket height position is maintained following standard traveling procedure.\n3.3 Travel speed is observed following manufacturer’s recommendations.\n3.4 Unexpected situations are responded to in line with company rules and regulations in a manner that minimizes risk to personnel and equipment.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION\n4. Perform excavation work\n4.1 Work site inspection is performed in accordance with safety requirements.\n4.2 Engine RPM is set at desired operating condition.\n4.3 Work equipment is properly positioned according to correct operating procedure.\n4.4 Bucket penetration angle position is observed.\n4.5 Correct operation of arm and boom is observed during scooping of excavated materials.\n4.6 Required excavation dimensions are observed according to work specifications.\n4.7 Unexpected situations are responded to in line with company rules and regulations and in a manner that minimizes risk to personnel and equipment.\n5. Perform loading and carrying of materials\n5.1 Loader bucket clearance is maintained based on recommended height above ground during transport of excavated materials and according to safe operating procedures.\n5.2 Most efficient route selected is within recommended economic hauling distance and in accordance with company rules and regulations / manufacturer’s performance manual.\n5.3 Load is carried within loader bucket capacity according to manufacturer’s performance specifications.\n5.4 Machine travel and engine speed is controlled during travel with load and in accordance with work area condition.\n5.5 Unexpected situations are responded to in line with company rules and regulations.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION\n5. Perform loading of materials to dump truck\n6.1 Loading operation to dump truck is performed according to safe operating procedure\n6.2 Ground is checked and cleared of obstructions as per standard operating procedures\n6.3 Load is carried within bucket capacity and based on manufacturer’s specifications.\n6.4 Travel and engine speed is controlled during loading of materials to dump truck as per manufacturer’s recommendations.\n6.5 Recommended dump height/clearance is followed in loading material to dump truck based on manufacturer’s recommendations.\n6.6 Unexpected situations are responded to in line with company rules and regulations.\n6. Perform secondary operations\n6.1 Work site inspection is performed in accordance with safety requirements.\n7.2 Secondary operations are performed following manufacturer’s recommendations.\n7.3 Unexpected situations are responded to in line with company rules and regulations.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 61
                },
                "type": "Document"
            },
            {
                "page_content": "THE HEAVY EQUIPMENT OPERATION RANGE OF VARIABLES VARIABLE RANGE 1. Safety locks and controls 1.1 Controls 1.2 Travel 1.3 Swing lock 1.4 Bucket 1.4.1 Backhoe 1.4.2 Loader 1.5 Boom 1.6 Arm 1.7 Articulation lock 2. Stopper blocks 2.1 Wood / lumber 2.2 Metal 3. Binders 3.1 Turnbuckles 3.2 Shackle 3.3 Wire rope sling 3.4 Chain sling 4. Unexpected situations May include but are not limited to: 4.1 Collapse of unstable terrain 4.2 Busted hoses (hydraulic) 4.3 Natural calamities e.g., flashfloods 4.4 Situations arising from poor peace and order conditions 5. Potential hazards May include but are not limited to: 5.1 Other equipment 5.2 Building 5.3 Deep excavation 5.4 Fog 5.5 Electric wires / high tension wires 5.6 Protruding nails / steel bars 5.7 Boulders and rocks 5.8 Muddy roads or unstable terrain 5.9 Ravine 5.10 Landslide",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 62
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION\n6. Safety requirements\n6.1 Barricades\n6.2 Caution tape\n6.3 Blinkers\n6.4 Signages\n6.5 Horns\n6.6 Reflector\n6.7 Fire extinguisher\n6.8 Safety belts\n6.9 PPE\n6.10 Decals / labels\n6.11 Beacon lights\n7. Engine RPM\n7.1 Low (700 – 900)\n7.2 Medium (900 – 1300)\n7.3 High (1400 – 2200)\n8. Work equipment\nMay include but not limited to:\n8.1 Boom\n8.2 Arm\n8.3 Bucket\n8.4 Rock breaker (optional)\n9. Correct operating procedure\n9.1 Stabilizer pad / out rigger are properly positioned.\n9.2 Boom is aligned with the digging trench.\n9.3 Wheels are positioned on stable and level ground.\n9.4 Initial arm digging position of 30 degrees before vertical axis and 45 degrees end of digging position after vertical axis.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 63
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION\n10. Excavated materials May include but are not limited to:\n10.1 Soil\n10.2 Sand\n10.3 Debris\n10.4 Landfill\n10.5 Silt\n11. Excavation dimensions\n11.1 Depth\n11.2 Reach\n11.3 Width\n11.4 Height\n15. Economic hauling distance\n12.1 50m to 150m depending on amount of load the Backhoe Loader capacity\n16. Safe operating procedure\n13.1 No dropping of materials from bucket\n13.2 No excessive tire spinning\n13.3 Perpendicular position of loader during thrust / shove / scooping / penetration of bucket\n13.4 No part of dump truck is hit by loader during loading of earth materials\n13.7 Smooth application of accelerator pedal (inching, neutralizer, brake, accelerator)\n13.8 Observed 5 - minute warm - up and cooling down\n13.9 Avoid hard impact of bucket to ground\n13.10 Avoid impact feathering of bucket\n14. Secondary operations May include but not limited to:\n14.1 Lifting\n14.2 Filling and spreading\n14.3 Clearing / road preparation",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 64
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION EVIDENCE GUIDE  1.  Critical aspects of evidence to be considered   Assessment requires evidence that the candidate:  1.1  Demonstrates ability to perform loading of Backhoe Loader to low-bed trailer  1.2  Demonstrates ability to perform unloading Backhoe Loader from low-bed trailer  1.3  Demonstrates ability to travel Backhoe Loader  1.4  Demonstrates ability to perform excavation work  1.5  Demonstrates ability to perform loading and carrying of materials  1.6  Demonstrates ability to perform loading of materials to dump truck  1.7  Demonstrates ability to perform secondary operations  1.8  Demonstrates ability to carry-out safe work practices   2.  Underpinning (related) knowledge and attitude    2.1 Types and uses of PPE  2.2 Use of operation and maintenance manual  2.3 System operation and component functions  2.4 Types and uses of optional attachments  2.4 Controls, gauges and indicators  2.5 Mensuration  2.6 Basic arithmetic  2.7 Backhoe Loader operations safety procedures and practices  2.8 Company rules and regulations  2.9 Positive work values (cost, time, quality conscious, etc.)   3.  Underpinning skills   3.1 Using appropriate PPE  3.2 Interpreting operation and maintenance manual  3.3 Identifying system operation and component functions  3.4 Interpreting controls, gauges and indicators  3.5 Calculations  3.6 Following safety procedures and practices  3.7 Following company rules and regulations   4.  Resource implications   The following resources must be provided:  4.1 Access to Backhoe Loader and jobsite  4.2 Ramp  4.3 Dump truck  4.4 Low-bed trailer and prime mover  4.5 Earth materials  4.6 Barricades and informative signages  4.7 Signalman",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 65
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY EQUIPMENT OPERATION 5. Method of assessment Competency in this unit must be assessed through 5.1 Oral/written questioning 5.2 Observation of practical demonstration 5.3 Work record and documents 6. Context for assessment 6.1 Assessment may be conducted in the work site or in a simulated venue. 6.2 Competency shall be assessed while work is being undertaken.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Backhoe Loader) NC II.pdf",
                    "page": 66
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "HEO (Forklift) NC II",
        "core_competencies": [
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 53 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM PRE AND POST-OPERATION PROCEDURES FOR FORKLIFT UNIT CODE: CON834216 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in performing visual and operation check before and after productive operation of forklift. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Perform visual check 1.1 Capacity of forklift is selected based on job requirements. 1.2 Operator-serviceable (OS) parts are checked in accordance with equipment checklist and manufacturer’s procedures. 1.3 Inspection of equipment is performed with checklist while power is stopped/not running 1.4 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards. 1.5 Required output is completed based on accomplished checklist 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Procedures in conducting visual and walk-around check 1.3 Computation of load versus capacity of forklift 1.4 Functions of parts and components of forklift 1.5 Factors affecting productivity 1.6 Productivity work measurements 1.7 Ways of improving productivity 1.1 Performing visual and walk-around checking procedures 1.2 Calculating load and capacity of forklift 1.3 Identifying parts and components of forklift and its functions 1.4 Accomplishing checklist 1.5 Applying productive methods and techniques 1.6 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 54 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Perform walk-around check 2.1 “BLOWAF” check is performed using checklist while engine is stopped/not running. 2.2 Battery-operated type is checked in accordance with manufacturer’s manual 2.3 Fluid levels are maintained in accordance with equipment manufacturer’s manual. 2.4 Abnormal conditions are noted in checklist and reported to authorized person. 2.5 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 2.6 Required output is completed based on accomplished checklist 2.1 Procedures in performing “BLOWAF” check 2.2 Procedures in checking battery-operated type 2.3 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.4 Waste disposal procedures 2.5 Fluid’s level and contamination 2.6 Factors affecting productivity 2.7 Productivity work measurements 2.8 Ways of improving productivity 2.1 Accomplishing checklist 2.2 Applying waste disposal procedures 2.3 Performing “BLOWAF” checking procedures 2.4 Performing battery-operated type checking procedures 2.5 Determining fluid level and contamination 2.6 Using PPE 2.7 Applying productive methods and techniques 3 Perform visual check for lifting attachments and power train 3.1 Lifting attachments and power train components are checked in accordance with checklist and manufacturer’s procedures 3.2 Abnormal conditions are noted in checklist and reported to authorized person 3.3 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 3.4 Required output is completed based on accomplished checklist 3.1 Procedures in visual check for lifting attachments and power train components 3.2 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.3 Functions of lifting attachments and power train components 3.4 Factors affecting productivity 3.5 Productivity work measurements 3.6 Ways of improving productivity 3.1 Accomplishing checklist 3.2 Performing visual check for lifting attachments and power train components 3.3 Identifying lifting attachments and power train components and its functions 3.4 Using PPE 3.5 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 55 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 4 Perform operation check 4.1 Starting/running check/operation check is performed with checklist and in accordance with manufacturer’s recommendations. 4.2 Electrical motor is checked for normal functioning based on manufacturer's specifications. 4.3 Safety devices are checked for proper functions in accordance with safe operating procedures. 4.4 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 4.5 Required output is completed based on accomplished checklist 4.1 Start-up and warming procedures 4.2 Procedures in Operation check 4.3 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 4.4 Warning signs and symbols 4.5 Functions of all components and safety devices 4.6 Factors affecting productivity 4.7 Productivity work measurements 4.8 Ways of improving productivity 4.1 Performing procedures in operation check 4.2 Accomplishing checklist 4.3 Applying productive methods and techniques 4.4 Using PPE 5 Perform post-operation procedures 5.1 Forklift is parked and turned off after productive operation in accordance to manufacturer’s manual. 5.2 Controls are set into neutral position and parking brakes are engaged in accordance to manufacturer’s manual. 5.3 Safety locks are all engaged in accordance with manufacturer’s manual. 5.4 Walk-around inspection check is re-conducted after operation 5.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 5.6 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standard 5.1 Company rules and regulations 5.2 Parking and shut-down procedures 5.3 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 5.4 Factors affecting productivity 5.5 Productivity work measurements 5.6 Ways of improving productivity 5.1 Following rules and regulations in parking and shutting down Forklift 5.2 Performing post-operation procedures 5.3 Accomplishing DETR 5.4 Applying productive methods and techniques 5.5 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 56 RANGE OF VARIABLES VARIABLE RANGE 1. Capacity of Forklift May include: 1.1 0.5 – 1.0 ton 1.2 2.0 - 10 tons 1.3 11 tons and above 2. Operator serviceable parts (OS) May include: 2.1 Air cleaner 2.2 Battery terminals/ connection/ clamp/ case 2.3 Fan belt 2.4 Grease/lube points 2.5 Fuel water separator/radiator 2.6 Tire inflation 2.7 Fuel tank 2.8 Hydraulic oil filters 2.9 Engine oil fan 2.10 Lights 2.11 Steering/ suspension 3. Inspection of equipment May include: 3.1 Power off 3.1.1 Leaks 3.1.2 Worn out/damaged parts 3.1.3 Fluid levels 3.1.4 Loose parts and accessories (nuts/bolts/belts) 3.1.5 Missing parts and accessories 3.1.6 Mast 3.1.7 Fork 3.1.8 Chain 3.1.9 Fork carrier 3.1.10 Hydraulic Cylinder (Lift and Tilt) 3.1.11 Levers and controls 3.1.12 Counterweight 3.1.13 Rim, tires and stud bolts",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 57 VARIABLE RANGE 3.2 Power on 3.2.1 Gauges 3.2.2 Lever and controls 3.2.3 Safety devices 3.2.3 Oil leaks 3.2.4 Pedals 3.2.5 Brakes 3.2.6 Steering 3.2.7 Electrical system 4. Personal Protective Equipment (PPE) May include: 4.1 Hard hat 4.2 Goggles 4.3 Gloves 4.4 Safety shoes 4.5 Safety vest 5. BLOW AF check May include: 5.1 Battery (starting and charging system) 5.2 Light (lighting system) 5.3 Oil (lubricating system) 5.4 Water (cooling system) 5.5 Air (intake and exhaust system) 5.6 Fuel (diesel, gas, LPG) 6. Fluid May include: 6.1 Engine oil 6.2 Hydraulic oil 6.3 Radiator coolant/radiator 6.4 Battery electrolyte/distilled water 6.5 Brake/clutch fluid 6.6 Transmission/Gear oil 6.7 Steering oil 6.8 Torque converter oil 6.9 Automatic transmission fluid 7. Authorized person May include: 7.1 Equipment Supervisor 7.2 Equipment Dispatcher/Foreman 7.3 Equipment Maintenance personnel VARIABLE RANGE 8. Lifting attachments and power train components May include: 8.1 Lifting attachments 8.1.1 Mast 8.1.2 Fork carrier 8.1.3 Fork 8.1.4 Lift chain 8.1.5 Hydraulic cylinder 8.2 Power train 8.2.1 Clutch and torque converter 8.2.2 Transmission 8.2.3 Differential 8.2.4 Tires/Stud and Bolts",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 61
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 589. Starting/running check/operation check May include: 9.1 Controls 10.1.1 Travel 10.1.2 Steering 10.1.3 Brake 10.1.4 Tilt 10.1.5 Lift 10.1.6 Side shift 9.2 Gauges 10.2.1 Hour meter 10.2.2 Battery charging 10.2.3 Pressure (oil and air) 10.2.4 Temperature (oil and water) 10.2.5 RPM (Tachometer) 10.2.6 Fuel indicator 10.2.7 Speedometer 10.2.8 Hydraulic pressure 9.3 Leaks in 10.3.1 Fuel 10.3.2 Oil 10.3.3 Water 9.4 Electrical/switches 10.4.1 Lights 10.4.2 Horns 10.4.3 Wiper 10.4.4 Beacon 10. Electrical motor May include: 10.1 Travel motor 10.2 Steering motor 10.3 Hydraulic pump motor 11. Safety devices May include: 11.1 Back horn/warning horn 11.2 Signal/stop light 11.3 Blinkers 11.4 Seat belt 11.5 Parking brake 11.6 Overhead guard protector 11.7 Fork lock",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 62
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 59 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Performed visual check 1.2 Performed walk-around check 1.3 Performed visual check for lifting attachments and power train 1.4 Performed operation check 1.5 Performed post-operation procedures 1.6 Observed safety measures applicable to worksite operation 1.7 Communicated effectively with others to ensure effective work operation 2. Resource implications The following resources should be provided: 2.1 Work area for forklift operation 2.2 Access to forklift and manuals 2.3 Basic hand tools and portable powered tools 2.4 PPE 2.5 Safety signage/barricades 3. Method of assessment Competency in this unit may be assessed through: 3.1 Written Examination 3.2 Direct observation/Demonstration with Oral Questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 63
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 60 UNIT OF COMPETENCY: PERFORM BASIC PREVENTIVE MAINTENANCE SERVICING FOR FORKLIFT UNIT CODE: CON 834217 UNIT DESCRIPTOR: This unit involves the knowledge, skills and attitudes required in cleaning/greasing, adjusting and replacing operator-serviceable (OS) parts of Forklift. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Perform adjustment or replacement for noted defects 1.1 Minor defects are identified and repaired/replaced in accordance with manufacturer’s procedures. 1.2 Basic hand tools and portable powered tools are selected based on job requirements. 1.3 Major defects are identified using checklist and referred to authorized personnel for action. 1.4 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Waste disposal procedures 1.3 Volume/Capacity 1.4 Clearance and distances 1.5 Types of fluids and lubricants 1.6 Procedures in performing adjustments or replacements for noted defects. 1.7 Types and uses of basic hand tools and portable powered tools 1.8 Structure and function of Forklift components 1.9 Factors affecting productivity 1.10 Productivity work measurements 1.11 Ways of improving productivity 1.1 Application of different basic hand tools and portable powered tools 1.2 Identifying defects 1.3 Performing adjustments or replacements for minor defects 1.4 Using PPE 1.5 Applying productive methods and techniques 1.6 Handling, segregation and disposal of hazardous waste",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 64
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 61 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2 Perform basic preventive maintenance servicing (PMS) 2.1 Operator’s Serviceable parts are identified and serviced according to manufacturer’s recommendations. 2.2 Standard parameters are checked according to manufacturer’s recommendations. 2.3 Fluids and lubricants are used based on manufacturer’s manual. 2.4 Basic hand tools, portable powered tools and consumable materials are identified and used in accordance with job requirements. 2.5 Basic preventive maintenance servicing (PMS) is carried out in accordance with manufacturer’s and site regulations 2.6 Site conditions are considered during PMS 2.7 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 2.1 Understanding Operator’s Maintenance Manual (OMM) 2.2 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.3 Site and weather conditions 2.4 Waste disposal procedures 2.5 Volume 2.6 Clearance and distances 2.7 Types of fluids and lubricants 2.8 Procedures in basic preventive maintenance servicing 2.9 Types and uses of basic hand tools and portable powered tools 2.10 Factors affecting productivity 2.11 Productivity work measurements 2.12 Ways of improving productivity 2.1 Performing basic preventive maintenance servicing (PMS) 2.2 Application of basic hand tools and portable powered tools 2.3 Application of fluids and lubricants 2.4 Handling, segregation and disposal of hazardous waste 2.5 Using PPE 2.6 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 65
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 62 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3 Prepare equipment reports 3.1 Equipment checklist is accomplished in accordance with manufacturer’s/company requirements 3.2 Equipment defects are reported to appropriate personnel 3.3 Document control procedures are observed based on company requirements 3.4 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 3.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.2 Completion of checklist and defects reports 3.3 Document control procedures 3.1 Accomplishing equipment report/checklist 3.2 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 66
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 63 RANGE OF VARIABLES VARIABLE RANGE 1. Minor defects May include: 1.1 Weak battery 1.2 Tire inflation 1.3 Belt tension 1.4 Clogged air cleaner 1.5 Defective radiator cap 1.6 Loose battery clamps 1.7 Bolts and mountings 1.8 Presence of water in fuel separator 2. Basic hand tools and portable powered tools May include: 2.1 Hand tools 2.1.1 Wrenches 2.1.2 Pliers 2.1.3 Brush (steel, paint) 2.1.4 Grease gun 2.1.5 Hammer (ball-peen, rubber, test) 2.1.6 Vice grip 2.1.7 Meter tape 2.1.8 Screwdriver (Philips and flat tip) 2.1.9 Tire gauge (instrument) 2.2 Portable Powered Tools 2.2.1 High pressure washer 2.3 Air compressor 2.4 Battery charger 3. Major defects May include: 3.1 Busted hydraulic hose 3.2 Hard starting engine 3.3 Excessive engine oil consumption 3.4 Leakage on 3.4.1 Air 3.4.2 Fuel 3.4.3 Cooling 3.4.4 Hydraulic system 3.5 Weak brakes 3.6 Busted/flat tires 3.7 Defective electrical components 3.7.1 Charging 3.7.2 Lighting 3.7.3 Starting 3.7.4 Gauges 4 Authorized personnel May include: 4.1 Equipment supervisor 4.2 Equipment Dispatcher/Foreman 4.3 Equipment Maintenance personnel",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 67
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 64 VARIABLE RANGE 5 Operator serviceable (OS) parts May include: 5.1 Battery clamps, battery distilled water 5.2 Belts 5.3 Filters 5.3.1 Air cleaner 5.3.2 Water fuel separator/drain valve 5.3.3 Hydraulic filter 5.3.4 Fuel filter 5.4 All fluid caps 5.5 All grease points and fittings 5.6 Chain grease 5.7 Tire inflation 6. Standard parameters May include: 6.1 Oil pressure 6.2 Air pressure 6.3 Temperatures 6.4 Tension 6.5 Clearance and distances 7. Fluids and lubricants May include: 7.1 Engine oil 7.2 Hydraulic oil 7.3 Brake fluid 7.4 Grease 7.5 Coolant 7.6 Battery solutions 7.7 Transmission oil 8. Basic preventive maintenance servicing May include: 8.1 Check battery clamps 8.2 Check fan belt conditions (cracked or worn-out) 8.3 Adjust belt tensions (if necessary) 8.4 Clean/replace filters 8.4.1 Air cleaner 8.4.2 Water separator 8.4.3 Hydraulic filter 8.4.4 Fuel filter 8.5 Replace defective fluid caps 8.6 Grease all fittings on lube points 8.7 Grease lift chain 9. Site regulations May include: 9.1 Instructions 9.2 Signages 9.3 Work schedules 9.4 Work bulletin boards 9.5 Charts 9.6 Memos 9.7 Site Map 9.8 Emergency response plan 9.9 Permits",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 68
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 65 VARIABLE RANGE 10. Site conditions May include: 10.1 Dusty 10.2 Windy 10.3 Sunny 10.4 Rainy 10.5 Crowded 10.3 Terrain (muddy and slippery)",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 69
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 66 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Performed adjustment or replacement for noted defects 1.2 Performed basic preventive maintenance servicing (PMS) 1.3 Prepared equipment reports 1.4 Observed safety measures applicable to worksite operation 1.5 Communicated effectively with others to ensure effective work operation 2. Resource implications The following resources should be provided: 2.1 Access to forklift and manuals 2.2 Access to forklift and lifting gears 2.3 Basic hand tools and portable powered tools 2.4 Fluids and lubricants 2.5 PPE 2.6 Safety signages/barricades 3. Method of assessment Competency in this unit may be assessed through: 3.1 Written Examination 3.2 Direct observation/Demonstration with Oral Questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 70
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 67 UNIT OF COMPETENCY: PERFORM PRODUCTIVE OPERATION FOR FORKLIFT UNIT CODE: CON 834218 UNIT DESCRIPTOR: This unit involves the knowledge, skills and attitudes in traveling, loading and unloading to low-bed trailer, interpreting load chart and lifting operation for Forklift. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Travel the forklift 1.1 Road conditions are considered before traveling the forklift. 1.2 Work area is surveyed for potential hazards in accordance with safe operating procedures. 1.3 Travel speed and position of forklift are observed in accordance with manufacturer’s manual and/or company rules and regulations 1.4 Unexpected situations are responded in line with company rules and regulations. 1.5 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Company rules and regulations 1.3 Site and weather conditions 1.4 Road worthiness 1.5 Clearance and distances 1.6 Speed limit 1.7 Procedures in traveling and positioning of forklift 1.8 Factors affecting productivity 1.9 Productivity work measurements 1.10 Ways of improving productivity 1.1 Following company rules and regulations 1.2 Driving skills 1.3 Traveling the forklift 1.4 Using PPE 1.5 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 71
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 68 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Load and unload forklift to low-bed trailer/truck 2.1 Low-bed trailer/truck for transporting the forklift is selected according to job requirements. 2.2 Lifting attachments are positioned and secured based on manufacturer’s manual. 2.3 Verbal instructions and signals are conveyed with authorized spotter during loading and unloading as per standard operating procedures. 2.4 All safety locks and control levers are secured at neutral position before and after loading based on manufacturer's specifications. 2.5 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 2.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.2 Hand signals 2.3 Site and weather conditions 2.4 Clearance and distances 2.5 Speed limit 2.6 Procedures in loading and unloading 2.7 Factors affecting productivity 2.8 Productivity work measurements 2.9 Ways of improving productivity 2.1 Following verbal instructions and signals 2.2 Operating skills in loading and unloading forklift to low-bed trailer/truck 2.3 Using PPE 2.4 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 72
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 69 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Interpret load chart 3.1 Weight of the load is determined according to load information 3.2 Lifting capacity is determined according to manufacturer’s specifications 3.3 Lifting capacity in the load chart is followed according to manufacturer’s specifications 3.4 Loads are calculated based on load center 3.6 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 3.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.2 Conversion of units 3.3 Forklift capacity based on load chart 3.4 Procedures in interpreting load chart. 3.5 Factors affecting productivity 3.6 Productivity work measurements 3.7 Ways of improving productivity 3.1 Interpreting load chart 3.2 Calculating load capacity 3.3 Using PPE 3.4 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 73
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 70 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 4. Perform lifting and handling of load 4.1 Site and weather conditions are considered before lifting and handling of load 4.2 Safe work procedures and practices are observed during handling and lifting operation based on OSH standards and manufacturer’s manual 4.3 Optimum speed during travel, lifting, and tilting operation is controlled based on manufacturer’s manual 4.4 Loads are handled in accordance with cargo contents within required capacity 4.5 Communication with spotter is established and maintained during traveling and lifting of loads based on company rules and regulations 4.6 Unexpected situations are responded in line with company rules and regulations 4.7 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 4.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 4.2 Signs and symbols 4.3 Cargo classification, weight, and segregation 4.4 Company rules and regulations 4.5 Manufacturer’s manual 4.6 Site and weather conditions 4.7 Conversion of units 4.8 Forklift capacity based on load chart 4.9 Clearance and distances 4.10 Safety devices 4.11 Procedures in traveling and handling of load 4.12 Factors affecting productivity 4.13 Productivity work measurements 4.14 Ways of improving productivity 4.1 Performing handling and lifting of load 4.2 Interpreting signs and symbols 4.3 Identifying safe conditions 4.4 Following company rules and regulations 4.5 Identifying cargo weight and segregation 4.6 Interpreting manufacturer’s manual 4.7 Using PPE 4.8 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 74
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 71 RANGE OF VARIABLES VARIABLE RANGE 1. Potential hazards May include: 1.1 Other equipment 1.2 Building 1.3 Deep excavation 1.4 Sloping ground 1.5 Uneven terrain 1.6 Overhead “live” electrical wires 1.7 Underground utilities 1.8 Unstable ground 2. Unexpected situations May include: 2.1 Sudden engine breakdown 2.2 Busted hydraulic hose and oil leakages 2.3 Broken lifting chain 2.4 Sudden loss of brake 2.5 Hitting high tension wire 2.6 Loss control of steering 2.7 Sudden ground failure 2.8 Force majeure e.g., earthquake, tornado, typhoon 2.9 Operator fatigue or sickness/condition 2.10 Accidents/incidents 3. Load information May include: 3.1 Bill of ladings 3.2 Packing and shipping list 3.3 Delivery receipt 3.4 Dimension",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 75
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 72 VARIABLE RANGE 4. Loads May include: 4.1 Bulk cargo 4.2 Palletized cargo 4.3 Containerized 4.4 Specialized cargo 5. Safe work procedures and practices May include: 5.1 Lifting Plan 5.2 Load chart 5.3 Work area 5.4 Storage 5.5 Communication 5.6 Risk management control 6. Cargo content May include: 6.1 Signs and symbols (e.g. fragile, this side up, etc.) 6.2 Stacking level 6.3 Stacking positions/directions 6.4 Poisonous substance 6.5 Flammable/explosives 6.6 Weather classification",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 76
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 73 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Travelled the forklift 1.2 Load and unload forklift to low-bed trailer/truck 1.3 Interpreted load chart 1.4 Performed lifting and handling of load 1.5 Observed safety measures applicable to worksite operation 1.6 Communicated effectively with others to ensure effective work operation 2. Resource implications The following resources should be provided: 2.1 Access to Forklift and job site/terrain 2.2 Available loads 2.3 Barricades and informative signages 2.4 PPE 3. Method of assessment Competency in this unit may be assessed through: 3.1 Written Examination 3.2 Direct observation / Demonstration with Oral Questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 77
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Forklift) NC II Revision 01 Promulgated (11/07/2019) 74 SECTION 3 TRAINING ARRANGEMENTS These standards are set to provide technical and vocational education and training (TVET) providers with information and other important requirements to consider when designing training programs for HEAVY EQUIPMENT OPERATION (FORKLIFT) NC II. They include information on curriculum design; training delivery; trainee entry requirements; tools and equipment; training facilities; and trainer’s qualification. 3.1 CURRICULUM DESIGN TESDA shall provide the training on the development of competency-based curricula to enable training providers develop their own curricula with the components mentioned below. Delivery of knowledge requirements for the basic, common and core units of competency specifically in the areas of mathematics, science/technology, communication/language and other academic subjects shall be contextualized. To this end, TVET providers shall develop a Contextual Learning Matrix (CLM) to accompany their curricula. Course Title: HEAVY EQUIPMENT OPERATION (FORKLIFT) NC II Nominal Training Duration: 37 Hours Basic Competencies 24 Hours Common Competencies 120 Hours Core Competencies 40 Hours - Supervised Industry Learning (SIL) Total - 221 Hours Course Description: This course is designed to provide the learner with knowledge, practical skills and attitude, applicable in performing work activities involve in performing pre and post-operation procedures, performing basic preventive maintenance servicing and performing productive operation for forklift. This includes classroom learning activities and practical work in actual work site or simulation area. Upon completion of the course, the learners are expected to demonstrate the above-mentioned competencies to be employed. To obtain this, all units prescribed for this qualification must be achieved.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Forklift) NC II.pdf",
                    "page": 78
                },
                "type": "Document"
            }
        ]
    }
]