[
    {
        "name": "HEO (Hydraulic Excavator) NC II",
        "core_competencies": [
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 54 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM PRE AND POST-OPERATION PROCEDURES FOR HYDRAULIC EXCAVATOR UNIT CODE: CON 834219 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in performing visual and operation check before and after productive operation of hydraulic excavator. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Perform visual check 1.1 Size and capacity of hydraulic excavator is selected based on job requirements. 1.2 Operator-serviceable (OS) parts are checked in accordance with equipment checklist and manufacturer’s procedures. 1.3 Inspection of equipment is performed with checklist while engine is stopped/not running 1.4 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 Occupational Safety and Health Standards 1.5 Required output is completed based on accomplished checklist 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Procedures in conducting visual and walk-around check 1.3 Sizes versus capacity 1.4 Familiarization of parts and components of hydraulic excavator 1.5 Factors affecting productivity 1.6 Productivity work measurements 1.7 Ways of improving productivity 1.1 Performing visual and walk-around checking procedures 1.2 Calculating the capacity of hydraulic excavator 1.3 Identifying parts and components of hydraulic excavator and its functions 1.4 Accomplishing equipment checklist 1.5 Applying productive methods and techniques 1.6 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 55 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Perform “BLOWAF” check 2.1 “BLOWAF” check is performed using checklist with engine stopped/not running. 2.2 Fluid levels are maintained in accordance with equipment maintenance manual. 2.3 Abnormal conditions noted in checklist and reported to authorized person. 2.4 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 2.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 2.1 Procedures in performing “BLOWAF” check 2.2 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.3 Waste disposal procedures 2.4 Fluid’s level and contamination 2.5 Factors affecting productivity 2.6 Productivity work measurements 2.7 Ways of improving productivity 2.1 Accomplishing equipment checklist (DETR) 2.2 Applying waste disposal procedures 2.3 Following “BLOWAF” checking procedures 2.4 Determining fluid level and contamination 2.5 Applying productive methods and techniques 2.6 Using PPE 3. Perform visual check for upper, lower structure and attachments 3.1 Upper, lower structure and attachments are checked in accordance with checklist and manufacturer’s procedures 3.2 upper, lower structure and attachments are secured for safe operation 3.3 Abnormal conditions are noted in checklist and reported to authorized person 3.4 PPE is used in accordance with 3.1 Procedures in visual check for upper, lower structure and attachments 3.2 Functions of attachments 3.3 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.4 Factors affecting productivity 3.5 Productivity work measurements 3.1 Following visual checking for upper, lower structure and attachments 3.2 Identifying parts and functions 3.3 Applying productive methods and techniques 3.4 Accomplishing equipment checklist (DETR) 3.5 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 56 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS Rule 1080 Occupational Safety and Health Standards 3.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 3.6 Ways of improving productivity",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 57 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 4. Perform operation check 4.1 Starting/running check is performed with checklist and in accordance with manufacturer’s recommendations. 4.2 Controls are checked for normal function while engine is running 4.3 Safety devices are checked for proper functions in accordance with safe operating procedures. 4.4 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 4.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 4.1 Start-up and warming procedures 4.2 Procedures in Operation check 4.3 Signs and symbols 4.4 Functions of all components and safety devices 4.5 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 4.6 Factors affecting productivity 4.7 Productivity work measurements 4.8 Ways of improving productivity 4.1 Following inspection procedures while the engine is running 4.2 Testing of hydraulic excavator 4.3 Applying productive methods and techniques 4.4 Accomplishing equipment checklist (DETR) 4.5 Using PPE 5. Perform post-operation procedures 5.1 Hydraulic excavator is parked and turned off after productive operation in accordance to manufacturer’s manual. 5.2 Controls are set into neutral position and parking brakes are engaged in accordance to manufacturer’s manual. 5.1 Company rules and regulations 5.2 Parking and shut-down procedures 5.3 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 5.4 Factors affecting productivity 5.5 Productivity work measurements 5.6 Ways of improving productivity 5.1 Following rules and regulations in parking and shutting down hydraulic excavator 5.2 Performing post-operation procedures 5.3 Accomplishing DETR and equipment checklist 5.4 Applying productive methods and techniques 5.5 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 61
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 58 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 5.3 Safety locks are all engaged in accordance with manufacturer’s manual. 5.4 Walk-around inspection check is re-conducted after operation 5.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 5.6 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 62
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 59 RANGE OF VARIABLES VARIABLE RANGE 1. Size and capacity of hydraulic excavator May include: 1.1 0.018 – 0.056 cubic meters 1.2 0.30 - 0.72 cubic meters 1.3 0.45 – 1.50 cubic meters 2. Operator serviceable parts (OS) May include: 2.4 Air cleaner 2.5 Battery terminals/connection/clamp/case 2.6 Fan belt 2.7 Grease/lube points 2.8 Fuel water separator/radiator 2.9 Tire inflation 2.10 Fuel tank 2.11 Hydraulic oil filters 2.12 Engine oil fan 2.13 Lights 2.14 Steering/suspension 3. Inspection of equipment May include: 3.1 Power off 3.1.1 Leaks 3.1.2 Worn out/damaged parts 3.1.3 Fluid levels 3.1.4 Loose parts and accessories (nuts/bolts/belts) 3.1.5 Missing parts and accessories 3.1.6 Hydraulic Cylinder 3.1.7 Levers and controls 3.1.8 Counter weight 3.1.9 Rim, tires and stud bolts 3.1.10 Bucket 3.2 Power on 3.2.1 Gauges 3.2.2 Lever and controls 3.2.3 Safety devices 3.2.3 Oil leaks 3.2.4 Pedals 3.2.5 Brakes 3.2.6 Steering 3.2.7 Electrical system 3.3 Early warning device",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 63
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 60 VARIABLE RANGE 4. Personal Protective Equipment (PPE) May include: 4.1 Hard hat 4.2 Goggles 4.3 Gloves 4.4 Safety shoes 4.5 Safety vest 5. BLOWAF check May include: 5.1 Battery (starting and charging system) 5.2 Light (lighting system) 5.3 Oil (lubricating system) 5.4 Water (cooling system) 5.5 Air (intake and exhaust system) 5.6 Fuel 6. Fluid May include: 6.1 Engine oil 6.2 Hydraulic oil 6.3 Radiator coolant/radiator 6.4 Battery solution / Battery electrolyte/distilled water 6.5 Final drive oil 6.6 Transmission/Gear oil 6.7 Steering oil 6.8 Torque converter oil 6.9 Automatic transmission fluid 7. Authorized person May include: 7.1 Equipment Supervisor 7.2 Equipment Dispatcher/Foreman 7.3 Equipment Maintenance personnel",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 64
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 61 VARIABLE RANGE 8. Upper, lower structure and attachments May include: 8.1 Attachments 8.1.1 Bucket 8.1.2 Breaker 8.2 Structure 8.2.1 Transmission 8.2.2 Differential 8.2.3 Tires/ Stud and Bolts 8.2.4 Sprocket 8.2.5 Final drive 8.2.6 Track link 8.2.7 Track pad 8.2.8 Track roller 8.2.9 Track frame 8.2.10 Hydraulic pump 8.2.11 Hydraulic motors 8.2.12 Hydraulic control valve 8.2.13 Hydraulic tank 8.2.14 Outrigger 8.2.15 Arm/Stick 8.2.16 Boom 8.2.17 Hydraulic cylinder 8.2.18 Idler",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 65
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 629. Starting/running check May include: 9.1 Controls/Levers 9.1.1 Travel 9.1.2 Steering 9.1.3 Brake 9.1.4 Bucket in/out 9.1.5 Arm in/out 9.1.6 Boom up/down 9.1.7 Swing left/right 9.1.8 Clutch and torque converter 9.2 Gauges 9.2.1 Hour meter 9.2.2 Battery charging 9.2.3 Pressure (oil and air) 9.2.4 Temperature (oil and water) 9.2.5 RPM (Tachometer) 9.2.6 Fuel indicator 9.2.7 Speedometer 9.2.8 Hydraulic pressure 9.3 Leaks in 9.3.1 Fuel 9.3.2 Oil 9.3.3 Water 9.4 Electrical/switches 9.4.1 Lights 9.4.2 Horns 9.5 Wiper 9.5.1 Beacon 10. Safety devices May include: 10.1 Back horn/warning horn 10.2 Signal/stop light 10.3 Blinkers 10.4 Seat belt 10.5 Parking brake 10.6 Roll over protective structure (ROPS) 10.7 Side mirrors",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 66
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 63 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Performed visual check 1.2 Performed “BLOWAF” check 1.3 Performed visual check for upper, lower structure and attachments 1.4 Performed operation check 1.5 Performed post-operation procedures 1.6 Observed safety measures applicable to worksite operation 1.7 Communicated effectively with others to ensure effective work operation 2. Resource implications The following resources should be provided: 2.1 Work area for hydraulic excavator operation 2.2 Access to hydraulic excavator and manuals 2.3 Basic hand tools and portable powered tools 2.4 PPE 2.5 Safety signage/barricades 3. Method of assessment The following resources should be provided: 3.1 Written Examination 3.2 Direct observation / Demonstration with Oral Questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 67
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 64 UNIT OF COMPETENCY: PERFORM BASIC PREVENTIVE MAINTENANCE SERVICING FOR HYDRAULIC EXCAVATOR UNIT CODE: CON 834220 UNIT DESCRIPTOR: This unit involves the knowledge, skills and attitudes required in cleaning, greasing, adjusting and replacing operator-serviceable (OS) parts of hydraulic excavator. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Perform adjustment or replacement for noted defects 1.1 Minor defects are identified and repaired/replaced in accordance with manufacturer’s procedures. 1.2 Basic hand tools and portable powered tools are selected based on job requirements. 1.3 Major defects are identified using checklist and referred to authorized personnel for action. 1.4 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 1.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Waste disposal procedures 1.3 Volume/Capacity 1.4 Clearance and distances 1.5 Types of fluids and lubricants 1.6 Procedures in performing adjustments or replacements for noted defects. 1.7 Types and uses of basic hand tools and portable powered tools 1.8 Structure and function of hydraulic excavator components 1.9 Factors affecting productivity 1.10 Productivity work measurements 1.11 Ways of improving productivity 1.1 Application of different basic hand tools and portable powered tools 1.2 Identifying defects 1.3 Performing adjustments or replacements for minor defects 1.4 Handling, segregation and disposal of hazardous waste 1.5 Applying productive methods and techniques 1.6 Accomplishing equipment checklist (DETR) 1.7 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 68
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 65 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Perform basic preventive maintenance servicing (PMS) 2.1 Operator’s Serviceable parts are identified and serviced according to manufacturer’s recommendations. 2.2 Standard parameters are checked according to manufacturer’s recommendations. 2.3 Fluids and lubricants are used based on manufacturer’s manual. 2.4 Basic hand tools, portable powered tools and consumable materials are identified and used in accordance with job requirements. 2.5 Basic preventive maintenance servicing (PMS) is carried out in accordance with manufacturer’s and site regulations 2.6 Site conditions are considered during PMS 2.7 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 2.8 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 2.1 Understanding Operator’s Maintenance Manual (OMM) 2.2 Site and weather conditions 2.3 Waste disposal procedures 2.4 Volume/capacity 2.5 Clearance and distances 2.6 Types of fluids and lubricants 2.7 Procedures in basic preventive maintenance servicing 2.8 Types and uses of basic hand tools and portable powered tools 2.9 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.10 Factors affecting productivity 2.11 Productivity work measurements 2.12 Ways of improving productivity 2.1 Performing basic preventive maintenance servicing (PMS) 2.2 Application of basic hand tools and portable powered tools 2.3 Application of fluids and lubricants 2.4 Handling, segregation and disposal of hazardous waste 2.5 Applying productive methods and techniques 2.6 Accomplishing equipment checklist (DETR) 2.7 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 69
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 66 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Prepare equipment reports 3.1 Equipment checklist is accomplished in accordance with manufacturer’s/Company requirements. 3.2 Equipment defects are reported to appropriate personnel. 3.3 Document control procedures is observed based on company requirements 3.4 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 3.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.2 Completion of checklist and defects reports 3.3 Document control procedures 3.1 Accomplishing equipment checklist 3.2 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 70
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 67 RANGE OF VARIABLES VARIABLE RANGE 1. Minor defects May include: 1.1 Weak battery 1.2 Tire inflation 1.3 Belt tension 1.4 Clogged air cleaner 1.5 Defective radiator cap 1.6 Loose battery clamps 1.7 Bolts and mountings 1.8 Presence of water in fuel separator 2. Basic hand tools and portable powered tools May include: 2.1 Hand tools 2.1.1 Wrenches 2.1.2 Pliers 2.1.3 Brush (steel, paint) 2.1.4 Grease gun 2.1.5 Hammer (ball-peen, rubber, test) 2.1.6 Vice grip 2.1.7 Meter tape 2.1.8 Screw driver (Philips and flat tip) 2.1.9 Tire gauge (instrument) 2.2 Portable Powered Tools 2.2.1 High pressure washer 2.3 Air compressor 2.4 Battery charger 3. Major defects May include: 3.1 Busted hydraulic hose 3.2 Hard starting engine 3.3 Excessive engine oil consumption 3.4 Leakage on 3.4.1 Air 3.4.2 Fuel 3.4.3 Cooling 3.4.4 Hydraulic system 3.5 Weak brakes 3.6 Busted/flat tires 3.7 Defective electrical system 3.7.1 Charging 3.7.2 Lighting 3.7.3 Starting 3.7.4 Gauges 4. Authorized personnel May include: 4.1 Equipment supervisor 4.2 Equipment Dispatcher/Foreman 4.3 Equipment Maintenance personnel",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 71
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 68 VARIABLE RANGE 5. Operator serviceable (OS) parts May include: 5.1 Battery clamps, battery distilled water 5.2 Belts 5.3 Filters 5.3.1 Air cleaner 5.3.2 Water fuel separator/drain valve 5.3.3 Hydraulic filter 5.3.4 Fuel filter 5.4 All fluid caps 5.5 All grease points and fittings 5.6 Tire inflation 6. Standard parameters May include: 6.1 Oil pressure 6.2 Air pressure 6.3 Temperatures 6.4 Tension 6.5 Clearance and distances 7. Fluids and lubricants May include: 7.1 Engine oil 7.2 Hydraulic oil 7.3 Brake fluid 7.4 Grease 7.5 Coolant 7.6 Battery solutions 7.7 Transmission oil 7.8 Differential oil 7.9 Power steering oil 8. Basic preventive maintenance servicing May include: 8.1 Check battery clamps 8.2 Check fan belt conditions (cracked or worn-out) 8.3 Adjust belt tensions (if necessary) 8.4 Clean/replace filters 8.4.1 Air cleaner 8.4.2 Water separator 8.4.3 Hydraulic filter 8.4.4 Fuel filter 8.5 Replace defective fluid caps 8.6 Grease all fittings on lube points 8.7 Tire inflation/Tire air pressure",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 72
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 69 VARIABLE RANGE 9. Site regulations May include: 9.1 Instructions 9.2 Signages 9.3 Work schedules 9.4 Work bulletin boards 9.5 Charts 9.6 Memos 9.7 Site Map 9.8 Emergency response plan 9.9 Permits 10. Site conditions May include: 10.1 Dusty 10.2 Windy 10.3 Sunny 10.4 Rainy 10.5 Crowded 10.3 Terrain (muddy and slippery)",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 73
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 70 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Performed adjustment or replacement for noted minor defects 1.2 Performed basic preventive maintenance servicing (PMS) 1.3 Prepared equipment reports 1.4 Observed safety measures applicable to worksite operation 1.5 Communicated effectively with others to ensure effective work operation 2. Resource implications The following resources should be provided: 2.1 Access to hydraulic excavator and manuals 2.2 Access to hydraulic excavator 2.3 Basic hand tools and portable powered tools 2.4 Fluids and lubricants 2.5 PPE 2.6 Safety signage’s/barricades 3. Method of assessment Competency in this unit may be assessed through: 3.1 Written Examination 3.2 Direct observation / Demonstration with Oral Questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 74
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 71 UNIT OF COMPETENCY: PERFORM PRODUCTIVE OPERATION FOR HYDRAULIC EXCAVATOR UNIT CODE: CON 834221 UNIT DESCRIPTOR: This unit involves the knowledge, skills and attitudes in excavation work, loading and lifting operation using hydraulic excavator. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Travel the hydraulic excavator 1.1 Road conditions are considered before travelling the hydraulic excavator. 1.2 Work area is surveyed for potential hazards in accordance with safe operating procedures. 1.3 Travel distance, speed and position of hydraulic excavator are observed in accordance with manufacturer’s manual and/or company rules and regulations 1.4 Unexpected situations are responded in line with company rules and regulations. 1.5 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 Occupational Safety and Health Standards 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Company rules and regulations 1.3 Site and weather conditions 1.4 Road worthiness 1.5 Clearance and distances 1.6 Speed limit 1.7 Procedures in travelling and positioning of hydraulic excavator 1.8 Factors affecting productivity 1.9 Productivity work measurements 1.10 Ways of improving productivity 1.1 Following company rules and regulations 1.2 Travelling the hydraulic excavator 1.3 Using PPE 1.4 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 75
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 72 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Load and unload hydraulic excavator to low-bed trailer/truck 2.1 Low-bed trailer/truck for transporting the hydraulic excavator is selected according to job requirements. 2.2 Attachments are positioned and secured based on manufacturer’s manual. 2.3 Verbal instructions and signals are conveyed with authorized spotter during loading and unloading as per standard operating procedures. 2.4 All safety locks and control levers are secured at neutral position before and after loading based on manufacturer's specifications. 2.5 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 2.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.2 Hand signals 2.3 Site and weather conditions 2.4 Clearance and distances 2.5 Speed limit 2.6 Procedures in loading and unloading 2.7 Factors affecting productivity 2.8 Productivity work measurements 2.9 Ways of improving productivity 2.1 Following verbal instructions and signals 2.2 Operating skills in loading and unloading hydraulic excavator to low-bed trailer/truck 2.3 Using PPE 2.4 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 76
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 73 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Perform excavation work 3.1 Site and weather conditions are considered before excavating 3.2 Engine RPM is set at desired operating condition. 3.3 Safe work procedures and practices are observed during excavation operation based on OSH standards and manufacturer’s manual 3.4 Work equipment is positioned according to operating procedures. 3.5 Bucket penetration angle position is observed. 3.6 Operation of arm and boom is observed during scooping of excavated materials. 3.7 Required excavation dimensions are observed according to work specifications. 3.8 Unexpected situations are responded in line with company rules and regulations 3.9 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 3.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.2 Signs and symbols 3.3 Company rules and regulations 3.4 Manufacturer’s manual 3.5 Site and weather conditions 3.6 Conversion of units 3.7 Clearance and distances 3.8 Safety devices 3.9 Procedures in excavation 3.10 Factors affecting productivity 3.11 Productivity work measurements 3.12 Ways of improving productivity 3.1 Performing excavation work 3.2 Interpreting signals and symbols 3.3 Identifying aspects and hazards 3.4 Following company rules and regulations 3.5 Interpreting manufacturer’s manual 3.6 Using PPE 3.7 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 77
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 74 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 4. Perform loading operation 4.1 Hydraulic Excavator is properly positioned according to ground condition 4.2 Engine RPM is set at desired operating condition 4.3 Swing angle is maintained according to the required distance and position of mobile/stationary equipment. 4.4 Loading sequence is observed based on standard operating procedure 4.5 Unexpected situations are responded to in line with company rules and regulations in a manner that minimizes risk to personnel and equipment 4.6 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 4.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 4.2 Signs and signals 4.3 Company rules and regulations 4.4 Manufacturer’s manual 4.5 Site and weather conditions 4.6 Conversion of units 4.7 Clearance and distances 4.8 Safety devices 4.9 Procedures in loading operation 4.10 Factors affecting productivity 4.11 Productivity work measurements 4.12 Ways of improving productivity 4.1 Performing loading operation 4.2 Interpreting signals and symbols 4.3 Identifying aspects and hazards 4.4 Following company rules and regulations 4.5 Interpreting manufacturer’s manual 4.6 Using PPE 4.7 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 78
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 75 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 5. Perform lifting operation 5.1 Engine RPM is set at desired operating condition 5.2 Weight and classification of the load is determined according to load information 5.3 Interpreting load chart is observed based on manufacturer’s manual 5.4 Rigging of load is observed in accordance with safe lifting procedures 5.5 Tipping radius is checked and confirmed according to lifting capacity of the hydraulic excavator 5.6 Unexpected situations are responded to in line with company rules and regulations in a manner that minimizes risk to personnel and equipment 5.7 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 5.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 5.2 Signs and signals 5.3 Company rules and regulations 5.4 Manufacturer’s manual 5.5 Load chart 5.6 Site and weather conditions 5.7 Conversion of units 5.8 Clearance and distances 5.9 Safety devices 5.10 Procedures in lifting operation 5.11 Factors affecting productivity 5.12 Productivity work measurements 5.13 Ways of improving productivity 5.1 Performing lifting operation 5.2 Interpreting signals and symbols 5.3 Identifying aspects and hazards 5.4 Following company rules and regulations 5.5 Interpreting manufacturer’s manual 5.6 Interpreting load chart 5.7 Using PPE 5.8 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 79
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 76 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 6. Perform operation using various attachments 6.1 Site and weather conditions are considered before operation 6.2 Engine RPM is set at desired operating condition. 6.3 Safe work procedures and practices are observed during operation based on OSH standards and manufacturer’s manual 6.4 Hydraulic excavator is positioned according to operating procedures. 6.5 Various attachments are positioned according to manufacturer’s manual 6.6 Operation of various attachments are observed during operation 6.7 Unexpected situations are responded in line with company rules and regulations 6.8 PPE is used in accordance with Rule 1080 Occupational Safety and Health Standards 6.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 6.2 Signs and symbols 6.3 Company rules and regulations 6.4 Manufacturer’s manual 6.5 Site and weather conditions 6.6 Conversion of units 6.7 Clearance and distances 6.8 Safety devices 6.9 Procedures in using various attachments 6.10 Factors affecting productivity 6.11 Productivity work measurements 6.12 Ways of improving productivity 6.1 Performing operation using various attachments 6.2 Interpreting sign and symbols 6.3 Identifying aspects and hazards 6.4 Following company rules and regulations 6.5 Interpreting manufacturer’s manual 6.6 Using PPE 6.7 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 80
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 77 RANGE OF VARIABLES VARIABLE RANGE 1. Potential hazards May include: 1.1 Other equipment 1.2 Building 1.3 Deep excavation 1.4 Sloping ground 1.5 Uneven terrain 1.6 Overhead “live” electrical wires 1.7 Underground utilities 1.8 Unstable ground 2. Unexpected situations May include: 2.1 Sudden engine breakdown 2.2 Busted hydraulic hose and oil leakages 2.3 Hitting high tension wire 2.6 Sudden ground failure 2.8 Force majeure e.g., earthquake, tornado, typhoon 2.9 Operator fatigue or sickness/condition 2.10 Accidents/incidents 3. Attachments May include: 3.1 Bucket 3.2 Hammer 3.3 Pulverizers 3.4 Augers 3.5 Shears 3.6 Grapples 3.7 Magnets 3.8 Breaker 4. Work equipment May include: 4.1 Boom 4.2 Arm 4.3 Bucket 4.4 Blade (small and medium size unit) 5. Excavated materials May include: 5.1 Boulders 5.2 Soil 5.3 Sand 5.4 Limestone 5.5 Debris 5.6 Coal 5.7 Landfill 5.8 Ore 5.9 Silt",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 81
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 78 VARIABLE RANGE 6. Excavation dimensions May include: 6.1 Depth 6.2 Reach 6.3 Width 6.4 Height 7. Ground condition 7.1 Soft 7.2 Hard 7.3 Muddy 7.4 Rocky 6.5 Loose 8. Mobile/stationary equipment 8.1 Rigid and articulated hauler truck 8.2 Dump truck 8.3 Hopper 8.4 Conveyor 8.5 Bottom dump trailer 9. Classification of the load May include: 9.1 Reinforced concrete pipes 9.2 Rebars 9.3 Steel pipes 9.4 Water pump 10. Load information May include: 10.1 Bill of ladings 10.2 Packing and shipping list 10.3 Delivery receipt 10.4 Dimension",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 82
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Hydraulic Excavator) NC II Revision 01 Promulgated (11/07/2019) 79 EVIDENCE GUIDE 1. Critical aspects of evidence to be considered Assessment requires evidence that the candidate: 1.1 Travelled the hydraulic excavator 1.2 Load and unload hydraulic excavator to low-bed trailer/truck 1.3 Perform excavation work 1.4 Performed loading operation 1.5 Performed lifting operation 1.6 Observed safety measures applicable to worksite operation 1.7 Communicated effectively with others to ensure effective work operation 2. Resource implications The following resources should be provided: 2.1 Access to hydraulic excavator and job site/terrain 2.2 Available loads 2.3 Informative signages 2.4 PPE 3. Method of assessment Competency in this unit may be assessed through: 3.1 Written Examination 3.2 Direct observation / Demonstration with Oral Questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Hydraulic Excavator) NC II.pdf",
                    "page": 83
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "HEO (Rigid On-Highway Dump Truck) NC II",
        "core_competencies": [
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 51 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM PRE AND POST-OPERATION PROCEDURES FOR RIGID ON-HIGHWAY DUMP TRUCK UNIT CODE: CON 834222 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in performing visual and operation check before and after productive operation of rigid on-highway dump truck. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Perform visual check of rigid on-highway dump truck 1.1 Capacity of rigid on-highway dump truck is selected based on job requirements 1.2 Operator-serviceable (OS) parts are checked in accordance with equipment checklist and manufacturer’s procedures 1.3 Inspection is performed with equipment checklist and with engine stopped/not running 1.4 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 Occupational Safety and Health Standards 1.5 Required output is completed based on accomplished checklist 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Procedures in conducting visual check 1.3 Determining dump box capacity of rigid on-highway dump truck 1.4 Functions of parts and components of rigid on-highway dump truck 1.5 Factors affecting productivity 1.6 Productivity work measurements 1.7 Ways of improving productivity 1.1 Following visual and inspection procedures 1.2 Determining dump box capacity 1.3 Identifying parts and functions 1.4 Accomplishing equipment checklist 1.5 Using PPE 1.6 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 52 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Perform “BLOWAF” check 2.1 “BLOWAF” check is performed using checklist with engine stopped/not running. 2.2 Fluid levels are maintained in accordance with equipment maintenance manual. 2.3 Abnormal conditions noted in checklist and reported to authorized person. 2.4 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 2.5 Required output is completed based on accomplished checklist 2.1 Procedures in performing “BLOWAF” check 2.2 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.3 Waste disposal procedures 2.4 Fluid’s level and contamination 2.5 Factors affecting productivity 2.6 Productivity work measurements 2.7 Ways of improving productivity 2.1 Accomplishing equipment checklist 2.2 Applying waste disposal procedures 2.3 Following “BLOWAF” checking procedures 2.4 Determining fluid level and contamination 2.5 Using PPE 2.6 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 53 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Perform operation check 3.1 Starting/running check is performed with checklist and in accordance with manufacturer’s recommendations 3.2 Mechanical components are checked for normal functioning based on manufacturer's specifications 3.3 Safety devices are checked for proper functions in accordance with safe operating procedures 3.4 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 3.5 Required output is completed based on accomplished checklist 3.1 Start-up and warming procedures 3.2 Procedures in inspection while the engine is running 3.3 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.4 Warning signs and symbols 3.5 Functions of all components and safety devices 3.6 Factors affecting productivity 3.7 Productivity work measurements 3.8 Ways of improving productivity 3.1 Accomplishing equipment checklist 3.2 Following inspection procedures while the engine is running 3.3 Testing of rigid on-highway dump truck 3.4 Using PPE 3.5 Applying productive methods and techniques 4. Perform post-operation procedures 4.1 Rigid on-highway dump truck is parked and turned off after productive operation in accordance to manufacturer’s manual 4.2 Controls are set into neutral position and parking brakes are engaged in accordance to manufacturer’s manual 4.3 Safety locks and brakes are all engaged in accordance manufacturer’s manual 4.4 Inspection is re-conducted while doing engine cool down 4.1 Company rules and regulations 4.2 Parking and shut-down procedures 4.3 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 4.4 Factors affecting productivity 4.5 Productivity work measurements 4.6 Ways of improving productivity 4.1 Accomplishing DETR and equipment checklist 4.2 Following rules and regulations in parking and shutting rigid on-highway dump truck Performing post-operation procedures 4.3 Using PPE 4.4 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 54 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 4.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations 4.6 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 4.7 Required output is completed based on accomplished checklist",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 55 RANGE OF VARIABLES VARIABLE RANGE 1. Capacity of rigid on-highway dump truck May include: 1.1 2 to 5 cubic meters 1.2 6 to 10 cubic meters 1.3 11 to 15 cubic meters 1.4 16 to 20 cubic meters 1.5 21 to 25 cubic meters 2. Operator serviceable parts (OS) May include: 2.4 Air cleaner 2.5 Battery terminals/ connection/ clamp/ case 2.6 Fan belt 2.7 Grease/lube points 2.8 Fuel water separator/radiator 2.9 Tire inflation 2.10 Fuel tank 2.11 Hydraulic and brake master cylinder 2.12 Engine oil fan 2.13 Lights 2.14 Steering/suspension 3. Inspection May include: 3.1 Engine off 3.1.1 Leaks 3.1.2 Worn out/damaged parts 3.1.3 Fluid levels 3.1.4 Loose parts and accessories (nuts/bolts/belts) 3.1.5 Missing parts and accessories 3.2 Engine on 3.2.1 Gauges and controls 3.2.2 Safety devices 3.2.3 Oil and air leaks 3.2.4 Levers and controls 3.2.4.1 Steering wheels 3.2.4.2 Pedals 3.2.4.3 Hand brake 3.2.4.4 Power Take-off (PTO) 3.2.5 Electrical lighting system 3.2.6 Horn 3.3 Early warning devices 3.4 Spare tire",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 56 VARIABLE RANGE 4. Personal Protective Equipment (PPE) May include: 4.1 Hard hat 4.2 Goggles 4.3 Gloves 4.4 Safety shoes 4.5 Safety vest 5. BLOWAF check May include: 5.1 Battery (starting and charging system) 5.2 Light (lighting system) 5.3 Oil (lubricating system) 5.4 Water (cooling system) 5.5 Air (intake and exhaust system) 5.6 Fuel (fuel system) 6. Fluid May include: 6.1 Engine oil 6.2 Hydraulic oil 6.3 Radiator coolant/radiator 6.4 Battery electrolyte/distilled water 6.5 Brake/clutch fluid 6.6 Transmission/Gear oil 6.7 Steering oil 6.8 Fuel 6.9 Torque converter oil 6.10 Automatic transmission fluid 7. Authorized person May include: 7.1 Equipment Supervisor 7.2 Equipment Dispatcher/Foreman 7.3 Equipment Maintenance personnel",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 57 VARIABLE RANGE 8. Starting/running check/operation check May include: 8.1 Controls 8.1.1 PTO 8.1.2 Brakes 8.1.3 Travel 8.1.4 Steering 8.2 Gauges 8.2.1 Hour meter 8.2.2 Battery charging 8.2.3 Pressure (oil and air) 8.2.4 Temperature (oil and water) 8.2.5 RPM (Tachometer) 8.2.6 Fuel indicator 8.2.7 Speedometer 8.3 Leaks in 8.3.1 Fuel 8.3.2 Water 8.3.3 Oil 8.3.4 Air 8.4 Electrical/switches 8.4.1 Lights 8.4.2 Horns 8.4.3 Wiper 9. Mechanical components May include: 9.1 Brakes 9.2 Steering 9.3 Power Take-off (PTO) 9.4 Tires 9.5 Dump box 9.6 Dump box cylinder 9.7 Chassis 9.8 Transmission 9.9 Clutch 9.10 Differential 10. Safety devices May include: 10.1 Back horn/warning horn 10.2 Signal/stop light 10.3 Blinkers 10.4 Seat belt 10.5 Parking brake 10.6 Dump body sensor",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 61
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 58 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Performed visual check of on-highway dump truck (rigid) 1.2 Performed “BLOWAF” check 1.3 Performed operation check 1.4 Performed post operation procedures 1.5 Observed safety measures applicable to worksite operation 1.6 Communicated effectively with others to ensure effective work operation 2. Resource implications The following resources should be provided: 2.1 Work area for on-highway dump truck (rigid) operation 2.2 Access to on-highway dump truck (rigid) and manuals 2.3 Basic hand tools and portable powered tools 2.4 PPE 2.5 Safety signage/barricades 3. Method of assessment Competency in this unit may be assessed through: 3.1 Written examination 3.2 Direct observation/Demonstration with oral questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 62
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 59 UNIT OF COMPETENCY: PERFORM BASIC PREVENTIVE MAINTENANCE SERVICING FOR RIGID ON-HIGHWAY DUMP TRUCK UNIT CODE: CON 834223 UNIT DESCRIPTOR: This unit involves the knowledge, skills and attitudes required in cleaning, greasing, adjusting and replacing operator-serviceable (OS) parts of rigid on-highway dump truck. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Perform adjustment or replacement for noted defects 1.1 Minor defects are identified and repaired/replaced in accordance with manufacturer’s procedures. 1.2 Basic hand tools and portable powered tools are selected based on job requirements. 1.3 Major defects are identified using checklist and referred to authorized personnel for action. 1.4 Personal Protective Equipment (PPE) is used in accordance with Rule 1080 of Occupational Safety and Health Standards 1.5 Required output is completed based on accomplished checklist 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Waste disposal procedures 1.3 Volume/capacity 1.4 Clearance and distances 1.5 Types of fluids and lubricants 1.6 Procedures in performing adjustments or replacements for noted defects. 1.7 Types and uses of basic hand tools and portable powered tools 1.8 Structure and function of On-Highway Dump Truck [rigid] components 1.9 Factors affecting productivity 1.10 Productivity work measurements 1.11 Ways of improving productivity 1.1 Application of different basic hand tools and portable powered tools 1.2 Applying waste disposal procedures 1.3 Identifying defects 1.4 Performing adjustments or replacements for minor defects 1.5 Accomplishing DETR and equipment checklist 1.6 Using PPE 1.7 Handling, segregation and disposal of hazardous waste",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 63
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 60 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Perform basic preventive maintenance servicing (PMS) 2.1 Operator’s Serviceable parts are identified and serviced according to manufacturer’s recommendations. 2.2 Standard parameters are checked according to manufacturer’s recommendations. 2.3 Fluids and lubricants are used based on manufacturer’s manual. 2.4 Basic hand tools, portable powered tools and consumable materials are identified and used in accordance with job requirements. 2.5 Basic preventive maintenance servicing (PMS) is carried out in accordance with manufacturer’s and site regulations 2.6 Site conditions are considered during PMS 2.7 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 2.8 Required output is completed based on accomplished checklist 2.1 Understanding Operator’s Maintenance Manual (OMM) 2.2 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.3 Site and weather conditions 2.4 Waste disposal procedures 2.5 Volume / capacity 2.6 Clearance and distances 2.7 Types of fluids and lubricants 2.8 Procedures in basic preventive maintenance servicing 2.9 Types and uses of basic hand tools and portable powered tools 2.10 Factors affecting productivity 2.11 Productivity work measurements 2.12 Ways of improving productivity 2.1 Performing basic preventive maintenance servicing (PMS) 2.2 Application of basic hand tools and portable powered tools 2.3 Application of fluids and lubricants 2.4 Handling, segregation and disposal of hazardous waste 2.5 Using PPE 2.6 Accomplishing DETR and equipment checklist 2.7 Applying productive methods and techniques",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 64
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 61 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Prepare equipment reports 3.1 Equipment checklist is accomplished in accordance with manufacturer’s/ company requirements. 3.2 Equipment defects are reported to authorized personnel. 3.3 Document control procedures is observed based on company requirements 3.4 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 3.1 Completion of checklist and defects reports 3.2 Document control procedures 3.3 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.1 Accomplishing equipment checklist (DETR) 3.2 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 65
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 62 RANGE OF VARIABLES VARIABLE RANGE 1. Minor defects May include: 1.1 Weak battery 1.2 Tire inflation / Tire air pressure 1.3 Belt tension 1.4 Clogged air cleaner 1.5 Defective radiator cap 2. Basic hand tools and portable powered tools May include: 2.1 Hand tools 2.1.1 Wrenches 2.1.2 Pliers 2.1.3 Brush (steel, paint) 2.1.4 Grease gun 2.1.5 Hammer (ball-peen, rubber, test) 2.1.6 Vice grip 2.1.7 Meter tape 2.1.8 Screw driver (Philips and flat tip) 2.1.9 Tire gauge (instrument) 2.2 Portable Powered Tools 2.1.1 High pressure washer 2.3 Air compressor 3. Major defects May include: 3.1 Weak brakes 3.2 Hard starting engine 3.3 Excessive engine oil consumption 3.4 Leakage on 3.4.1 Air 3.4.2 Fuel 3.4.3 Cooling 3.4.4 Fluid 3.5 Damaged/broken pulley 3.6 Engine low power 3.7 Smoke belching 3.8 Defective electrical components 3.8.1 Charging 3.8.2 Lighting 3.8.3 Starting 3.8.4 Monitoring/ gauges 4 Authorized personnel May include: 4.1 Equipment supervisor 4.2 Equipment Dispatcher/Foreman 4.3 Equipment Maintenance personnel",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 66
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 63 VARIABLE RANGE 5 Operator serviceable (OS) parts May include: 5.1 Battery clamps, Battery distilled water 5.2 Belts 5.3 Filters 5.3.1 Air cleaner 5.3.2 Water fuel separator/drain valve 5.3.3 Hydraulic filter 5.3.4 Fuel filter 5.4 All fluid caps 5.5 All grease points and fittings 5.6 Tire inflation 6. Standard parameters May include: 6.1 Oil pressure 6.2 Air pressure 6.3 Water temperatures 6.4 Belt tension 6.5 Tire pressure 7. Fluids and lubricants May include: 7.1 Engine oil 7.2 Hydraulic oil 7.3 Brake fluid 7.4 Grease 7.5 Coolant 7.6 Battery solutions/Battery electrolyte/distilled water 7.7 Transmission/Torque converter oil 7.8 Fuel 7.9 Differential oil 7.10 Power steering oil 8. Basic preventive maintenance servicing May include: 8.1 Check battery clamps 8.2 Check fan belt conditions (cracked or worn-out) 8.3 Cleaning the unit 8.4 Clean/Replace filters 8.4.1 Air cleaner 8.4.2 Water separator 8.4.3 Hydraulic filter 8.4.4 Fuel filter 8.5 Replace defective fluid caps 8.6 Grease all fittings on lube points 8.7 Tire inflation/Tire Air Pressure 9. Site regulations May include: 9.1 Instructions 9.2 Signages 9.3 Work schedules 9.4 Work bulletin boards 9.5 Charts 9.6 Memos 9.7 Site Map 9.8 Emergency response plan 9.9 Permits",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 67
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 64 VARIABLE RANGE 10. Site conditions May include: 10.1 Dusty 10.2 Windy 10.3 Sunny 10.4 Rainy 10.5 Crowded 10.3 Terrain (muddy and slippery)",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 68
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 65 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Performed adjustment or replacement for noted minor defects 1.2 Perform basic preventive maintenance servicing (PMS) 1.3 Prepare equipment reports 1.4 Observed safety measures applicable to worksite operation 1.5 Communicated effectively with others to ensure effective work operation 2. Resource implications The following resources should be provided: 2.1 Access to On-Highway Dump Truck [rigid] and manuals 2.2 Basic hand tools and portable powered tools 2.3 Fluids and lubricants 2.4 PPE 2.5 Safety signage's/barricades 3. Method of assessment Competency in this unit may be assessed through: 3.1 Written examination 3.2 Direct observation/Demonstration with oral questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 69
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 66 UNIT OF COMPETENCY: PERFORM PRODUCTIVE OPERATION FOR RIGID ON-HIGHWAY DUMP TRUCK UNIT CODE: CON 834224 UNIT DESCRIPTOR: This unit deals with the knowledge, skills and attitude required for preparing for loading operation, performing hauling and dumping operation for rigid on-highway dump truck. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Prepare for loading operation 1.1 Safe work practices are observed in accordance with company rules and regulations 1.2 Communication is established with the station during operation. 1.3 Positioning of rigid on-highway dump truck is observed at the loading area 1.4 Required control levers are applied according to operations manual. 1.5 Engine is set at low idle speed while waiting/loading operation 1.6 Unexpected situations are responded in line with company rules and regulations 1.7 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 1.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.2 Traffic rules and regulations 1.3 Site and weather conditions 1.4 Road worthiness 1.5 Clearance and distances 1.6 Speed limit 1.7 Procedures in operating, travelling of rigid on-highway dump truck 1.8 Factors affecting productivity 1.9 Productivity work measurements 1.10 Ways of improving productivity 1.1 Following safe work practices 1.2 Positioning/maneuvering highway dump truck 1.3 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 70
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 67 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Perform hauling operation 2.1 Communication is maintained with the station during operation 2.2 Worksite conditions and safe operating techniques are identified according to safe operating practices 2.3 Traffic rules and regulations are observed 2.4 Retarder/exhaust brake is applied with allowable speed prior to downhill operation 2.5 Engine RPM and required travel speed is observed according to work site condition 2.6 Brake is applied based on the situation 2.7 Power take-off switch is disengaged during operations 2.8 Differential and inter axle lock are engaged and disengaged according to terrain conditions 2.9 PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 2.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.2 Hand signals 2.3 Traffic rules and regulations 2.4 Site and weather conditions 2.5 Clearance and distances 2.6 Hauling operation procedures 2.7 Factors affecting productivity 2.8 Productivity work measurements 2.9 Ways of improving productivity 2.1 Perform hauling operation procedures of rigid on-highway dump truck 2.2 Interpreting and following hand signals, traffic rules and regulation 2.3 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 71
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 68 ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Perform dumping operation 3.1. Communication is maintained with the station during operation. 3.2. Illumination of dumpsite is checked in line with site conditions 3.3. Assistance from spotter is obtained when required 3.4. Dumping operation is performed following established / recommended procedures 3.5. PPE is used in accordance with Rule 1080 of Occupational Safety and Health Standards 3.1 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.2 Hand signals or radio 3.3 Conversion of units 3.4 Procedures in dumping operation 3.5 Factors affecting productivity 3.6 Productivity work measurements 3.7 Ways of improving productivity 3.1 Interpreting hand signal or radio communication 3.2 Perform dumping operation procedures 3.3 Using PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 72
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 69 RANGE OF VARIABLES VARIABLE RANGE 1. Safe work practices May include: 1.1 Observed safety awareness 1.2 Observed firm and flat ground for the loading and dumping area 1.3 Wear PPE 1.4 Checked illumination of work site 1.5 Observed 3-point contact in embarking on and alighting from equipment 1.6 All controls must be in neutral position and parking brake applied before alighting from equipment 1.7 Observed housekeeping 2. Communication May include: 2.1 Hand signal 2.2 Radio / mobile phone and GPS 2.3 Horn / Light signal 3. Control levers May include: 3.1 Parking brake 3.2 Retarder / Exhaust brake 3.3 Transmission gear shift 3.4 Steering 3.5 Differential lock 3.6 Power take-off 4. Unexpected situations May include: 4.1 Sudden engine breakdown 4.2 Busted hydraulic hose and oil leakages 4.3 Sudden loss of brake 4.4 Loss control of steering 4.5 Sudden ground failure 4.6 Force majeure e.g., earthquake, fire, tornado 4.7 Operator fatigue or sickness/condition 4.8 Accidents/incidents 5. Worksite conditions May include: 5.1 Muddy 5.2 Sandy 5.3 Slippery 5.4 Uneven / unstable terrain",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 73
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 70 VARIABLE RANGE 6. Safe operating techniques May include: 6.1 Dump box is maintained in float position during traveling 6.2 Differential lock is engaged/disengaged during full stop 6.3 Running dumping is applied at lower gear operation 6.4 Reverse operation is not allowed during dumping operation 7. Engine RPM May include: 7.1 700 – 1,200 RPM 7.2 1,200 – 2,200 RPM 8. Brake May include: 8.1 Service 8.2 Secondary / Emergency 8.3 Exhaust brake/Engine brake 8.4 Parking brake 9. Established / recommended procedures May include: 9.1 Dump truck is positioned in the dumping area in accordance with site condition. 9.2 Transmission is set at neutral position and parking brake is engaged. 9.3 Horn is sounded prior to dump box raising / lowering position. 9.4 Dump box is raised / lowered in smooth and controlled engine RPM. 9.5 Unexpected situations are responded in line with company rules and regulations.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 74
                },
                "type": "Document"
            },
            {
                "page_content": "HEAVY EQUIPMENT OPERATION (Rigid On-Highway Dump Truck) NC II Revision 01 Promulgated (11/07/2019) 71 EVIDENCE GUIDE 1. Critical aspects of competency to be considered Assessment must confirm evidence that the candidate: 1.1 Prepared for loading operation 1.2 Performed hauling operation 1.3 Performed dumping operation 1.4 Observed safety measures applicable to worksite operation 1.5 Communicated effectively with others to ensure effective work operation 2. Resource implications Things necessary for the conduct of assessment 2.1. Access to dump truck and job site/terrain 2.2. Operation and maintenance manual 2.3. Available loads 2.4. PPE 2.5. Spotter 2.6 Safety signage’s/barricades 3. Method of assessment Competency in this unit may be assessed through: 3.1 Written examination 3.2 Direct observation/Demonstration with oral questioning 4. Context for assessment 4.1 Competency may be assessed in actual workplace or at the designated TESDA Accredited Assessment Center",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rigid On-Highway Dump Truck) NC II.pdf",
                    "page": 75
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "HEO (Rough Terrain Crane) NC II",
        "core_competencies": [
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 38 of 79 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM PRE- AND POST-OPERATION PROCEDURES FOR LIFTING EQUIPMENT UNIT CODE: CON833309 UNIT DESCRIPTOR: This unit involves knowledge, skills and attitudes in performing procedures before and after productive operation of lifting equipment. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Perform visual check of equipment 1.1 Lifting equipment is selected based on job requirements. 1.2 Operator-serviceable (OS) parts are checked in accordance with equipment checklist and manufacturer’s procedures. 1.3 Walk-around check is performed with equipment checklist and with engine stopped/not running. 2. Perform “B L O W A F” check 2.1 “BLOWAF” check is performed with checklist form and with engine stopped/not running. 2.2 Fluid levels are maintained in accordance with equipment maintenance manual. 2.3 Abnormal conditions noted in checklist and reported to authorized person. 3. Perform operation check 3.1 Starting/running check is performed with checklist and in accordance with manufacturer’s recommendations. 3.2 Brake, steering and controls are checked for normal functioning as per manufacturer's specifications. 3.3 Walk-around check is performed with equipment checklist and while engine is running. 3.4 Safety devices are checked for proper functions in accordance with safe operating procedures.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TRADE HEAVY - EQUIPMENT OPERATION (Rough - Terrain Crane) NC II Promulgated July 2007 Page 39 of 79 ELEMENT PERFORMANCE CRITERIA 4. Perform post - operation procedure 4.1 Equipment is parked and turned off after productive operation in accordance with company rules and regulations. 4.2 Equipment controls are set into neutral position and parking brakes are engaged according to manufacturer’s operations manual. 4.3 Safety locks and brakes are all set/engaged in accordance with operator’s manual. 4.4 Walk - around inspection check is re - conducted while doing engine cool down 4.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 40 of 79 RANGE OF VARIABLES VARIABLE RANGE 1. Lifting 1.1 Rough-terrain Crane 1.2 Crawler Crane 1.3 Truck-mounted Crane 1.4 Forklift 1.4.1 Diesel 1.4.2 Gasoline or LPG 1.4.3 Electric 1.5 Tower Crane 1.5.1 Fixed Mounted 1.5.2 Rail Mounted 1.5.3 Self Erecting/Climbing Type 1.5.4 Free Standing Type 1.5.5 Luffing type 2. Lifting capacity 2.1 2.5-3.5 tons 2.2 5-10 tons 2.3 15-25 tons 2.4 35 tons and above 3. Operator serviceable parts (OS) 3.1 Air cleaner 3.2 Battery terminals/Connection/Clamp/Case 3.3 Belt/Lifting Chain 3.4 Grease/lube points 3.5 Fuel water separator/radiator Rough-terrain Crane, Truck-mounted Crane, Forklift 3.6 Tire inflation Forklift 3.7 Fuel tank 3.8 Hydraulic and brake master cylinder 3.9 Engine oil fan 3.10 Lights 3.11 Steering/Suspension Crawler Crane 3.12 Track tension",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 41 of 79 VARIABLE RANGE 4. Walk-around check 4.1 Engine off 4.1.1 Leaks 4.1.2 Worn out/damaged parts 4.1.3 Fluid levels 4.1.4 Loose parts and accessories (nuts/bolts/belts) 4.1.5 Missing parts and accessories 4.1.6 Pulleys (gantry and boom end) Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Tower Crane 4.1.7 Hook block assembly 4.1.7.1 Sheaves 4.1.7.2 Hook and latch 4.1.8 Wire rope cable/clip Forklift 4.1.9 Fork condition 4.1.10 Fork chain/bearing 4.1.11 Levers and controls 4.1.11.1 Hoist 4.1.11.2 Tilt 4.1.11.3 Side shift 4.1.11.3 Steering wheels 4.1.11.4 Pedals 4.1.11.5 Hand brake Forklift and Tower crane 4.1.12 Counter weight Tower crane 4.1.13 Base foundation 4.1.14 Mask pins Crawler Crane 4.1.15 Lattice boom (main and jib)",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TRADE HEAVY - EQUIPMENT OPERATION (Rough - Terrain Crane) NC II Promulgated July 2007 Page 42 of 79 VARIABLE RANGE 4.2 Engine on Rough - terrain Crane, Truck - mounted Crane and Forklift 4.2.1 Gauges and controls 4.2.2 Safety devices Rough - terrain Crane and Truck - mounted Crane 4.2.3 Oil and air leaks 4.2.4 Working equipment function 4.2.4.1 Outriggers 4.2.4.2 Boom 4.2.4.3 Hoist Forklift 4.2.4.4 Tilt 4.2.4.5 Lift 4.2.4.6 Steering 4.2.4.7 Cylinder 5. B L O W A F check Rough - terrain Crane, Crawler Crane, Truck - mounted Crane and Forklift 5.1 Battery (starting and charging system) 5.2 Light (lighting system) 5.3 Oil (lubricating system) 5.4 Water (cooling system) 5.5 Air (intake and exhaust system) 5.6 Fuel (fuel system) 6. Fluid levels Rough - terrain Crane, Crawler Crane, Truck - mounted Crane and Forklift 6.1 Engine oil 6.2 Hydraulic oil 6.3 Radiator coolant/radiator (maintenance type) 6.4 Battery electrolyte/distilled water Rough - terrain Crane, Crawler Crane, and Truck - mounted Crane 6.5 Brake/clutch fluid Rough - terrain Crane and Forklift 6.6 Transmission/Gear oil Rough - terrain Crane and Truck - mounted Crane 6.7 Steering oil Truck - mounted Crane 6.8 Fuel Forklift 6.9 Torque converter oil",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 43 of 79 VARIABLE RANGE 7. Authorized person 7.1 Equipment Supervisor 7.2 Equipment Dispatcher/Foreman 7.3 Maintenance personnel 8. Starting/Running check/operation check 8.1 Controls 8.1.1 Travel Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Tower Crane 8.1.2 Hoist Rough-terrain Crane, Crawler Crane and Truck Mounted Crane 8.1.3 Swing 8.1.4 Outrigger 8.1.5 Boom Forklift 8.1.6. Tilt 8.1.7 Lift 8.1.8 Steering 8.1.9 Side shift 8.1.10 Stabilizer 8.2 Gauges 8.2.1 Hour meter Rough-terrain, Crawler Crane, Truck-mounted Crane and Forklift 8.2.2 Battery charging 8.2.3 Pressure (oil and air) 8.2.4 Temperature (oil and water) 8.2.5 RPM (Tachometer) Rough-terrain, Crawler Crane, Truck-mounted and Tower Crane 8.2.6 Boom angle indicator Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Forklift 8.2.7 Fuel indicator Rough-terrain Crane, Truck-mounted Crane, Forklift and Tower Crane 8.2.8 Speedometer Forklift 8.2.9 Hydraulic pressure 8.3 Leaks in Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Forklift 8.3.1 Fuel",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TRADE HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 44 of 79 VARIABLE RANGE 8.3.2 Hydraulic Rough-Terrain Crane, Crawler Crane, Truck-mounted Crane and Tower Crane 8.3.3 Lubricating Rough-terrain Crane, Crawler Crane and Truck Mounted Crane 8.3.4 Air 8.3.5 Cooling Forklift and Tower Crane 8.3.6 Oil Forklift 8.3.7 Water 8.3.8 Brake fluid 8.4 Electrical/switches 8.4.1 Lights 8.4.2 Horns 8.4.3 Wiper Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Forklift 8.5 Steering and brake 9. Safety devices Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Tower Crane 9.1 Load moment indicator (LMI) 9.2 Anti two block (Limit switch) Rough-terrain Crane, Crawler Crane, and Truck-mounted Crane 9.3 Automatic crane stopper (ACS) Forklift and Tower Crane 9.4 Emergency stop switch Forklift 9.5 Back horn/warning horn 9.6 Signal/stop light 9.7 Blinkers 9.8 Safety belt 9.9 Overhead guard protector 9.10 Fork lock/tow pin lock 9.11 Parking brake",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 45 of 79 VARIABLE RANGE Tower Crane 9.12 Limit switch 9.12.1 Hoisting 9.12.2 Slewing 9.12.3 Travelling 9.12.4 Trolleying 9.12.5 Derricking 9.13 Weather vaning devices 9.14 Beacon lights 9.15 Lightning arrester 10. Safety locks 10.1 Swing lock 10.2 House lock 10.3 Control lever lock 10.4 Door lock Tower Crane 10.5 Slewing lock 10.6 Travelling lock",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TRADE HEAVY - EQUIPMENT OPERATION (Rough - Terrain Crane) NC II Promulgated July 2007 Page 46 of 79 EVIDENCE GUIDE 1. Critical aspects of evidence to be considered Assessment requires evidence that the candidate: 1.1 Demonstrates ability to select equipment based on the job requirements 1.2 Demonstrates ability to check operator - serviceable (OS) parts 1.3 Demonstrates ability to perform walk - around and “BLOWAF” inspection following equipment checklist and with engine stopped/not running 1.4 Demonstrates ability to perform walk - around check while engine is running 1.5 Demonstrates ability to observe risk - control/safe procedures 1.6 Demonstrates ability to perform post - operation checking procedures 1.7 Demonstrates ability to accomplish and submit daily equipment time report (DETR) 2. Underpinning (related) knowledge 2.1 Types and uses of personal protective equipment (PPE) 2.2 Controls, instruments, and indicators and their usage 2.3 Start - up and shutdown procedures 2.4 Familiarity with manufacturer’s operation manual 2.5 Familiarity with job site and work conditions 2.6 Familiarity with pre - and post - operation checklist 3. Underpinning skills 3.1 Performing pre - and post - operation procedures of equipment using standard or special attachments 3.2 Using personal protective equipment 3.3 Maintaining equipment records 3.4 Communicating with work site personnel and clients 3.5 Complying with the manufacturer’s operation and maintenance manual 3.6 Accomplishing pre - and post - operation checklist 4. Resource implications Things necessary for the conduct of assessment 4.1 Appropriate work area for lifting equipment operation 4.2 Access to lifting equipment and manuals. 5. Method of assessment Competency must be assessed through 5.1 Written/oral questioning 5.2 Direct observation/practical demonstration 5.3 Work record and documents 6. Context for assessment 6.1 Assessment may be conducted on - the - job or in a simulated venue.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TRADE HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 47 of 79 UNIT OF COMPETENCY: PERFORM BASIC PREVENTIVE-MAINTENANCE SERVICING FOR LIFTING EQUIPMENT UNIT CODE: CON833310 UNIT DESCRIPTOR: This unit involves the knowledge, skills and attitudes required in performing simple cleaning, greasing, replacement and similar routine basic preventive maintenance for lifting equipment. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables 1. Perform adjustment/s replacements 1.1 Minor defects are identified and remedied in accordance with company/manufacturer’s procedures. 1.2 Tools are selected based on job requirements. 1.3 Major defects are identified using checklist and referred to appropriate personnel for action. 2. Perform basic preventive maintenance servicing (PMS) 2.1 OS parts/standards are identified and serviced according to manufacturer’s recommendations. 2.2 Fluids and lubricants are used based on manufacturer’s manual. 2.3 Basic hand tools and equipment and consumable materials are identified and used in accordance with job requirements. 2.4 Basic preventive maintenance servicing (PMS) is carried out in accordance with manufacturer’s and/or site requirements/conditions. 3. Prepare equipment reports 3.1 Daily checklist form is accomplished in accordance with manufacturer’s/company requirements. 3.2 Minor/major equipment defects are reported to appropriate personnel.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 48 of 79 RANGE OF VARIABLES VARIABLE RANGE 1. Lifting equipment 1.1 Rough-terrain Crane 1.2 Truck-mounted Crane 1.3 Crawler Crane 1.4 Forklift 1.4.1 Diesel 1.4.2 Gasoline/LPG 1.4.3 Electric 2. Minor defects 2.1 Weak battery 2.2 Air lock 2.3 Tire inflation 2.4 Belt tension 2.5 Clogged air cleaner 2.6 Defective radiator cap Forklift 2.7 Loose clamps. Bolts and mountings 2.8 Presence of water in fuel separator 3. Major defects 3.1 Busted hydraulic hose 3.2 Hard starting engine 3.3 Excessive engine oil consumption 3.4 Leakage on 3.4.1 Air 3.4.2 Fuel 3.4.3 Cooling 3.4.4 Hydraulic system 3.5 Faulty gauges 3.6 Damaged/broken pulley 3.7 Incorrect/defective Load Moment Indicator (LMI) 3.8 Defective/frayed wire rope Rough-terrain Crane and Truck-mounted Crane 3.9 Busted/flat tires Rough-terrain Crane and Crawler Crane 3.10 Derailed track links Forklift 3.11 Excessive engine oil consumption on: 3.11.1 Fuel 3.11.2 Water 3.11.3 Fluid 3.12 Poor engine performance 3.13 Weak brakes",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 49 of 79 VARIABLE RANGE 3.14 Defective electrical components 3.14.1 Charging 3.14.2 Lighting 3.14.3 Starting 3.14.4 Monitoring/gauges 4. Appropriate personnel 4.1 Equipment supervisor/Foreman 4.2 Chief mechanic 4.3 Equipment maintenance personnel Forklift 4.4 Dispatcher 4.5 Motor pool supervisor 5. Operator Serviceable (OS) parts 5.1 Battery clamps 5.2 Belts 5.3 Filters 5.3.1 Air cleaner 5.3.2 Water fuel separator/drain valve 5.4 All fluid caps 5.5 All grease points and fittings 5.6 Wire rope grease/lubricants Forklift 5.7 Battery distilled water 5.8 Chain grease 5.9 All caps (e.g., water, oil, fluid, fuel) 6. Standards 6.1 Oil pressure 6.2 Air pressure 6.3 Temperatures 6.4 Tension 6.5 Clearance and distances Forklift 6.6 Hydraulic pressure 6.7 Fuels 6.7.1 LPG 6.7.2 Diesel 6.7.3 Gasoline 6.7.4 Electric 6.8 Charging rate",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 50 of 79 VARIABLE RANGE 7. Fluids and lubricants 7.1 Engine oil 7.2 Hydraulic oil 7.3 Brake fluid 7.4 Multi-purpose grease 7.5 Coolant 7.6 Battery solutions Rough-terrain Crane and Truck-mounted Crane 7.7 Transmission oil Truck-mounted Crane 7.8 Fuel Forklift 7.9 Gear oil 7.10 Cleaning solutions 7.10.1 Detergent soap 7.10.2 Degreaser 8. Basic hand tools and equipment 8.1 Hand tools 8.1.1 Wrenches 8.1.2 Pliers 8.1.3 Paint brush 8.1.4 Grease gun 8.1.5 Hammer 8.1.6 Vice grip 8.1.7 Measuring tape (instrument) 8.1.8 Steel brush Rough-terrain Crane and Crawler Crane 8.1.9 Screwdriver (positive and negative) Truck-mounted Crane and Forklift 8.1.10 Screwdriver (Philips and flat tip) Rough-terrain Crane and Truck-mounted Crane 8.1.11 Tire gauge (instrument) Crawler Crane 8.1.12 Mud removing tools 8.2 Equipment 8.2.1 High-pressure washer 8.2.2 Air compressor",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TRADE HEAVY - EQUIPMENT OPERATION (Rough - Terrain Crane) NC II Promulgated July 2007 Page 51 of 79 VARIABLE RANGE 9. Basic preventive maintenance servicing May include but are not limited to: 9.1 Check battery clamps 9.2 Check fan belt conditions (cracked or worn-out) 9.3 Adjust belt tensions (if necessary) 9.4 Clean/Replace filters 9.4.1 Air cleaner 9.4.2 Water separator 9.5 Replace defective fluid caps 9.6 Grease all fittings on lube points 9.7 Grease wire ropes 10. Site condition/ requirements 10.1 Instructions 10.2 Signages 10.3 Work schedules 10.4 Work bulletin boards 10.5 Charts 10.6 Memos 10.7 Maps 10.8 Dusty 10.9 Windy 9.10 Terrain (muddy and slippery) Forklift 9.11 Poor lighting 9.12 Vertical clearance 9.13 Overhead cable 9.14 Toxic/hazardous fumes",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TRADE HEAVY - EQUIPMENT OPERATION (Rough - Terrain Crane) NC II Promulgated July 2007 Page 52 of 79 EVIDENCE GUIDE 1. Critical aspects of evidence to be considered Assessment requires evidence that the candidate: 1.1 Demonstrates ability to observe safety precautions 1.2 Demonstrates ability to identify minor defects with checklist and service them in accordance with company rules and regulations 1.3 Demonstrates ability to identify major defects with checklist and report them to appropriate personnel 1.4 Demonstrates ability to identify OS parts/standards from manufacturer's reference books/manuals 1.5 Demonstrates understanding of recommended fluid and lubricants 1.6 Demonstrates ability to use basic hand tools and equipment 1.7 Demonstrates ability to accomplish and submit daily checklist forms and reports 2. Underpinning (related) knowledge 2.1 Company rules and regulations 2.2 Basic unit specifications (BUS) 2.3 Safety (PPE, machine and environmental) 2.4 Controls and gauges 2.6 Components, systems and functions 2.7 Comprehension of operation and maintenance manual 2.8 Fluids and lubricants 2.9 Uses of basic hand tools and equipment 3. Underpinning skills 3.1 Using personal protective equipment (PPE) 3.2 Accomplishing daily checklist forms 3.3 Performing basic preventive maintenance 3.4 Using basic hand tools and equipment 3.4 Reporting minor and major defects 4. Resource implications Things necessary for the conduct of assessment 2.1 Access to lifting equipment specifications and manuals 4.2 Access to lifting equipment 4.3 Basic hand tools and equipment 4.4 Fluids and lubricants 4.5 PPE 4.6 Safety signages/barricades 5. Method of assessment Competency must be assessed through 5.1 Written and/or oral questioning 5.2 Direct observation/ practical demonstration 5.3 Work record and documents",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 53 of 79 6. Context for assessment 6.1 Competency shall be assessed in a normal or simulated workplace environment and in accordance with safe work procedures 6.2 Competency shall be assessed while work is being undertaken independently",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 54 of 79 UNIT OF COMPETENCY: PERFORM PRODUCTIVE OPERATION FOR ROUGH-TERRAIN CRANE UNIT CODE: CON833311 UNIT DESCRIPTOR: This unit involves knowledge, skills and attitudes in lifting, transferring and handling loads and materials using Rough-Terrain Cranes. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Load/unload crane to low-bed trailer 1.1 Low-bed trailer for transporting the Crane is selected according to job requirements. 1.2 Boom position is followed during loading/unloading in accordance with standard operating procedures. 1.3 Crane is loaded/unloaded and positioned based on standard operating procedure. 1.4 Verbal messages and non-verbal signals are conveyed with authorized signalman during loading/unloading as per standard operating procedure. 1.5 All safety locks and control levers are secured at neutral position before and after loading based on manufacturer's specifications. 1.6 Wheels are secured with stopper blocks and jacked (outrigger) in accordance with safety procedures. 1.7 Body frame is secured with binders in accordance with safety procedures. 1.8 Main hook and auxiliary blocks are secured based on safety procedures.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 55 of 79 2. Travel the crane 2.1 Work area is surveyed for safe accessibility or potential hazards in accordance with safe operating procedures. 2.2 Outrigger assembly position is followed based on safe operating procedures. 2.3 Boom is secured in place during travel in accordance with safe operating procedures. 2.4 Travel speed is maintained in accordance with safe operating procedures. 2.5 Hook Block on front frame is secured in place in accordance with safe operating procedures. 2.6 Assistance from signalman is sought when necessary in accordance with safe operating procedures. 2.7 Unexpected situations are responded to in line with company rules and regulations. 3. Set-up crane 3.1 Crane is set-up and positioned in accordance with safety procedures and requirements 3.2 Working condition of crane is tested as per standard operating procedures 3.3 Unexpected situations in setting up the crane are responded to in line with company rules and regulations. 4 Read and interpret load chart 4.1 Weight of the load is determined based on load information. 4.2 Lifting capacity is determined according to working radius and boom length. 4.3 Rigging gears and their weight are determined in accordance with manufacturer’s specifications. 4.4 Weight of any attachments such as main and auxiliary hook blocks, fly jib are considered as part of the load. 4.5 Lifting capacity in the load chart is followed according to manufacturer’s specifications and equipment conditions. 4.6 Doubt about the lifting capacity of the crane is reported to immediate supervisor based on standard operating procedures.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 56 of 79 5 Perform lifting and transferring of load 5.1 Optimum engine speed during hoisting or swing operation is controlled based on standard operating procedures. 5.2 Safe work procedures are followed during lifting operation in accordance with safety practices. 5.3 Unexpected situations are responded to in line with company rules and regulations.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TRADE HEAVY - EQUIPMENT OPERATION (Rough - Terrain Crane) NC II Promulgated July 2007 Page 57 of 79 RANGE OF VARIABLES VARIABLE RANGE 1. Signalman 1.1 Spotter 1.2 Helper 2. Potential hazards 2.1 Other equipment 2.2 Building 2.3 Deep excavation 2.4 Sloping ground 2.5 Wind aloft (exceeding wind velocity of 20 mph) 2.6 Fog 2.7 Uneven terrain 2.8 Overhead “live” electrical wires 2.9 Underground utilities 2.10 Unstable ground 3. Safety procedures and requirements 3.1 Lifting Plan is thoroughly checked in accordance with job requirements 3.2 Load chart is read/interpreted in accordance with lifting configuration. 3.3 Work area is barricaded with appropriate informative warning signages installed. 3.4 Crane is positioned on a stable working ground condition in accordance with safe lifting requirements. 3.5 Wheels and outrigger beams are adequately positioned and observed in accordance with safety requirements. 3.6 Cribbing under outrigger floats is used adequately with safety requirements. 3.7 Crane level is observed to ensure safety and stability. 3.8 Usable headroom for proper sling selection is determined to ensure safe operation. 3.9 Appropriate number of parts of line is reeved to ensure safe working load. 3.10 Trial lift without load is performed to ensure safe lifting operation. 3.11 Communicated with rigger to ensure load is secured with appropriate rigging gears 3.12 Risk control procedure is implemented in case of adverse environmental conditions. 4. Load information 4.1 Bill of ladings 4.2 Packing and shipping list 4.3 Load specifications",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 58 of 79 5. Rigging gears 5.1 Hoist hook 5.1.1 Eye shank 5.1.2 Shank shivel 5.1.3 Swivel hook 5.2 Sliding choker 5.3 Sure lock hook 5.3.1 Eye hook 5.3.2 Swivel hook 5.3.3 Clevis hook 5.3.4 Shank hook 5.4 Eye sling hook 5.5 Clevis sling hook 5.6 Grab hook (eye or clevis) 5.7 Weld-on hook 5.8 Sorting hook 5.9 Barrel hook 5.10 Latch 5.10.1 Shank hook 5.10.2 Swivel hook 5.10.3 Clevis sling hook 5.10.4 Eyes sling hook 5.10.5 Eye hook 6. Lifting capacity 6.1 Obsolescence (life span) 6.2 Equipment history 6.3 Machine performance 6.4 Wear and tear 7. Safe work procedures 7.1 All slings, ties and hooks are placed and secured correctly before raising the load. 7.2 Load striking the ground, machine or any other object is prevented. 7.3 The boom is prevented from striking any obstruction. 7.4 Shock loading is avoided. 7.5 Dynamic loading is avoided. 7.6 Load handling is observed. 7.7 Lifting gears are checked in accordance with job requirements 8. Lifting operation 8.1 Safety devices 8.2 Release swing lock 8.3 Boom swing, up and down 8.4 Hoisting up and down 8.5 Release house lock",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "TRADE HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 59 of 79 VARIABLE RANGE 9. Unexpected situations 9.1 Sudden engine breakdown 9.2 Busted hydraulic hose and oil leakages 9.3 Broken wire rope 9.4 Sudden loss of brake 9.5 Hitting high tension wire 9.6 Loss control of steering 9.7 Sudden ground failure 9.8 Equipment malfunctioning 9.9 Force majeure e.g., earthquake, fire, tornado 9.10 Operator fatigue or sickness/condition 9.11 Adverse environmental condition 9.12 Accidents/incidents",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 60 of 79 EVIDENCE GUIDE 1. Critical aspects of evidence to be considered Assessment requires evidence that the candidate: 1.1 Demonstrates ability to load to and unload crane from low-bed trailer 1.2 Demonstrates ability to perform travel operation 1.3 Demonstrates ability to set-up crane 1.4 Demonstrates ability to read and interpret load chart 1.5 Demonstrates ability to perform lifting and transferring of load 1.6 Demonstrates ability to carry-out safe work practices 1.7 Demonstrates ability to communicate with Riggers during lifting operation 2. Underpinning (related) knowledge 2.1 Safe operating procedures and practices 2.2 Statutory safety rules and regulations 2.3 Understanding load chart 2.4 Understanding Lifting/Rigging Plans 2.5 Company/in-house policies and procedures 2.6 Site/terrain layout and obstacles 2.7 Familiarity with type and weight of loads 2.8 Familiarity with rigging gears and its applications 2.9 Familiarity with rigging signals 2.10 Basic calculations 2.11 Defensive driving 2.12 Reading Load Chart, Lifting/Rigging plan 2.13 Crane operating limits and parameters using load chart. 2.14 Knowledge of basic calculations 3. Underpinning skills 3.1 Accomplishing crane checklist and reports 3.2 Reporting crane component failure 3.3 Performing actual operation procedure of crane 3.4 Performing safety procedures and practices 3.5 Determining weight of loads 3.6 Following load charts applications 3.7 Using/Following correct rigging signals 3.8 Calculating skills 3.9 Applying eye and hand coordination 3.10 Operating Rough-terrain Crane 4. Resource implications Things necessary for the conduct of assessment 4.1 Access to Rough-Terrain Crane and job site/terrain 4.2 Available loads 4.3 Barricades and informative signage 4.4 Rigging gears 4.5 Prime mover and low-bed trailer with ramp",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 60
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Rough-Terrain Crane) NC II Promulgated July 2007 Page 61 of 79 5. Method of assessment Competency must be assessed through 5.1 Written/Oral questioning 5.2 Direct observation/practical demonstration 5.3 Work record and documents 6. Context for assessment 6.1 Assessment may be conducted in the work site or in a simulated venue.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Rough Terrain Crane) NC II.pdf",
                    "page": 61
                },
                "type": "Document"
            }
        ]
    },
    {
        "name": "HEO (Truck Mounted Crane) NC II",
        "core_competencies": [
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 37/79 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM PRE- AND POST-OPERATION PROCEDURES FOR LIFTING EQUIPMENT UNIT CODE: CON833309 UNIT DESCRIPTOR: This unit involves knowledge, skills and attitudes in performing procedures before and after productive operation of lifting equipment. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Perform visual check of equipment 1.1 Lifting equipment is selected based on job requirements. 1.2 Operator-serviceable (OS) parts are checked in accordance with equipment checklist and manufacturer’s procedures. 1.3 Walk-around check is performed with equipment checklist and with engine stopped/not running. 2. Perform “B L O W A F” check 2.1 “BLOWAF” check is performed with checklist form and with engine stopped/not running. 2.2 Fluid levels are maintained in accordance with equipment maintenance manual. 2.3 Abnormal conditions noted in checklist and reported to authorized person. 3. Perform operation check 3.1 Starting/running check is performed with checklist and in accordance with manufacturer’s recommendations. 3.2 Brake, steering and controls are checked for normal functioning as per manufacturer's specifications. 3.3 Walk-around check is performed with equipment checklist and while engine is running. 3.4 Safety devices are checked for proper functions in accordance with safe operating procedures.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 37
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 38/79 ELEMENT PERFORMANCE CRITERIA 4. Perform post-operation procedure 4.1 Equipment is parked and turned off after productive operation in accordance with company rules and regulations. 4.2 Equipment controls are set into neutral position and parking brakes are engaged according to manufacturer’s operations manual. 4.3 Safety locks and brakes are all set/engaged in accordance with operator’s manual. 4.4 Walk-around inspection check is re-conducted while doing engine cool down 4.5 Daily equipment time record/report (DETR) is accomplished/submitted according to company rules and regulations",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 38
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 39/79 RANGE OF VARIABLES VARIABLE RANGE 1. Lifting 1.1 Rough-terrain Crane 1.2 Crawler Crane 1.3 Truck-mounted Crane 1.4 Forklift 1.4.1 Diesel 1.4.2 Gasoline or LPG 1.4.3 Electric 1.5 Tower Crane 1.5.1 Fixed Mounted 1.5.2 Rail Mounted 1.5.3 Self Erecting/Climbing Type 1.5.4 Free Standing Type 1.5.5 Luffing type 2. Lifting capacity 2.1 2.5-3.5 tons 2.2 5-10 tons 2.3 15-25 tons 2.4 35 tons and above 3. Operator serviceable parts (OS) 3.1 Air cleaner 3.2 Battery terminals/Connection/Clamp/Case 3.3 Belt/Lifting Chain 3.4 Grease/lube points 3.5 Fuel water separator/radiator Rough-terrain Crane, Truck-mounted Crane, Forklift 3.6 Tire inflation Forklift 3.7 Fuel tank 3.8 Hydraulic and brake master cylinder 3.9 Engine oil fan 3.10 Lights 3.11 Steering/Suspension Crawler Crane 3.12 Track tension",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 39
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 40/79 VARIABLE RANGE 4. Walk-around check 4.1 Engine off 4.1.1 Leaks 4.1.2 Worn out/damaged parts 4.1.3 Fluid levels 4.1.4 Loose parts and accessories (nuts/bolts/belts) 4.1.5 Missing parts and accessories 4.1.6 Pulleys (gantry and boom end) Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Tower Crane 4.1.7 Hook block assembly 4.1.7.1 Sheaves 4.1.7.2 Hook and latch 4.1.8 Wire rope cable/clip Forklift 4.1.9 Fork condition 4.1.10 Fork chain/bearing 4.1.11 Levers and controls 4.1.11.1 Hoist 4.1.11.2 Tilt 4.1.11.3 Side shift 4.1.11.3 Steering wheels 4.1.11.4 Pedals 4.1.11.5 Hand brake Forklift and Tower crane 4.1.12 Counter weight Tower crane 4.1.13 Base foundation 4.1.14 Mask pins Crawler Crane 4.1.15 Lattice boom (main and jib)",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 40
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 41/79 VARIABLE RANGE 4.2 Engine on Rough-terrain Crane, Truck-mounted Crane and Forklift 4.2.1 Gauges and controls 4.2.2 Safety devices Rough-terrain Crane and Truck-mounted Crane 4.2.3 Oil and air leaks 4.2.4 Working equipment function 4.2.4.1 Outriggers 4.2.4.2 Boom 4.2.4.3 Hoist Forklift 4.2.4.4 Tilt 4.2.4.5 Lift 4.2.4.6 Steering 4.2.4.7 Cylinder 5. B L O W A F check Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Forklift 5.1 Battery (starting and charging system) 5.2 Light (lighting system) 5.3 Oil (lubricating system) 5.4 Water (cooling system) 5.5 Air (intake and exhaust system) 5.6 Fuel (fuel system) 6. Fluid levels Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Forklift 6.1 Engine oil 6.2 Hydraulic oil 6.3 Radiator coolant/radiator (maintenance type) 6.4 Battery electrolyte/distilled water Rough-terrain Crane, Crawler Crane, and Truck-mounted Crane 6.5 Brake/clutch fluid Rough-terrain Crane and Forklift 6.6 Transmission/Gear oil Rough-terrain Crane and Truck-mounted Crane 6.7 Steering oil Truck-mounted Crane 6.8 Fuel Forklift 6.9 Torque converter oil",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 41
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY - EQUIPMENT OPERATION (Truck - Mounted Crane) NC II Promulgated December 2004/July 2007 42 / 79 VARIABLE RANGE 7. Authorized person 7.1 Equipment Supervisor 7.2 Equipment Dispatcher/Foreman 7.3 Maintenance personnel 8. Starting/Running check/operation check 8.1 Controls 8.1.1 Travel Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Tower Crane 8.1.2 Hoist Rough-terrain Crane, Crawler Crane and Truck Mounted Crane 8.1.3 Swing 8.1.4 Outrigger 8.1.5 Boom Forklift 8.1.6. Tilt 8.1.7 Lift 8.1.8 Steering 8.1.9 Side shift 8.1.10 Stabilizer 8.2 Gauges 8.2.1 Hour meter Rough-terrain, Crawler Crane, Truck-mounted Crane and Forklift 8.2.2 Battery charging 8.2.3 Pressure (oil and air) 8.2.4 Temperature (oil and water) 8.2.5 RPM (Tachometer) Rough-terrain, Crawler Crane, Truck-mounted and Tower Crane 8.2.6 Boom angle indicator Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Forklift 8.2.7 Fuel indicator Rough-terrain Crane, Truck-mounted Crane, Forklift and Tower Crane 8.2.8 Speedometer Forklift 8.2.9 Hydraulic pressure 8.3 Leaks in Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Forklift 8.3.1 Fuel",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 42
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 43/79 VARIABLE RANGE 8.3.2 Hydraulic Terrain Crane, Crawler Crane, Truck-mounted Crane and Tower Crane 8.3.3 Lubricating Rough Rough-terrain Crane, Crawler Crane and Truck Mounted Crane 8.3.4 Air 8.3.5 Cooling Forklift and Tower Crane 8.3.6 Oil Forklift 8.3.7 Water 8.3.8 Brake fluid 8.4 Electrical/switches 8.4.1 Lights 8.4.2 Horns 8.4.3 Wiper Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Forklift 8.5 Steering and brake 9. Safety devices Rough-terrain Crane, Crawler Crane, Truck-mounted Crane and Tower Crane 9.1 Load moment indicator (LMI) 9.2 Anti two block (Limit switch) Rough-terrain Crane, Crawler Crane, and Truck-mounted Crane 9.3 Automatic crane stopper (ACS) Forklift and Tower Crane 9.4 Emergency stop switch Forklift 9.5 Back horn/warning horn 9.6 Signal/stop light 9.7 Blinkers 9.8 Safety belt 9.9 Overhead guard protector 9.10 Fork lock/tow pin lock 9.11 Parking brake",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 43
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 44/79 Tower Crane 9.12 Limit switch 9.12.1 Hoisting 9.12.2 Slewing 9.12.3 Travelling 9.12.4 Trolleying 9.12.5 Derricking 9.13 Weather vaning devices 9.14 Beacon lights 9.15 Lighting arrester 10. Safety locks 10.1 Swing lock 10.2 House lock 10.3 Control lever lock 10.4 Door lock Tower Crane 10.5 Slewing lock 10.6 Travelling lock",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 44
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY - EQUIPMENT OPERATION (Truck - Mounted Crane) NC II Promulgated December 2004/July 2007 45 / 79 EVIDENCE GUIDE 1. Critical aspects of evidence to be considered Assessment requires evidence that the candidate: 1.1 Demonstrates ability to select equipment based on the job requirements 1.2 Demonstrates ability to check operator - serviceable (OS) parts 1.3 Demonstrates ability to perform walk - around and “BLOWAF” inspection following equipment checklist and with engine stopped/not running 1.4 Demonstrates ability to perform walk - around check while engine is running 1.5 Demonstrates ability to observe risk - control/safe procedures 1.6 Demonstrates ability to perform post - operation checking procedures 1.7 Demonstrates ability to accomplish and submit daily equipment time report (DETR) 2. Underpinning (related) knowledge 2.1 Types and uses of personal protective equipment (PPE) 2.2 Controls, instruments, indicators and their usage 2.3 Start - up and shutdown procedures 2.4 Familiarity with manufacturer’s operation manual 2.5 Familiarity with job site and work conditions 2.6 Familiarity with pre - and post - operation checklist 3. Underpinning skills 3.1 Performing pre - and post - operation procedures of equipment using standard or special attachments 3.2 Using personal protective equipment 3.3 Maintaining equipment records 3.4 Communicating with work site personnel and clients 3.5 Complying with the manufacturer’s operation and maintenance manual 3.6 Accomplishing pre - and post - operation checklist 4. Resource implications Things necessary for the conduct of assessment 4.1 Appropriate work area for lifting equipment operation 4.2 Access to lifting equipment and manuals. 5. Method of assessment Competency must be assessed through 5.1 Written/oral questioning 5.2 Direct observation / practical demonstration 5.3 Work record and documents 6. Context for assessment 6.1 Assessment may be conducted on - the - job or in a simulated venue.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 45
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 46/79 UNIT OF COMPETENCY: PERFORM BASIC PREVENTIVE MAINTENANCE SERVICING FOR LIFTING EQUIPMENT UNIT CODE: CON833310 UNIT DESCRIPTOR: This unit involves the knowledge, skills and attitudes required in repairing minor defects and cleaning/greasing, adjusting and replacing operator-serviceable (OS) parts of truck-mounted crane and similar lifting equipment. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables 1. Perform adjustment/s replacements 1.1 Minor defects are identified and remedied in accordance with company/manufacturer’s procedures. 1.2 Tools are selected based on job requirements. 1.3 Major defects are identified using checklist and referred to appropriate personnel for action. 2. Perform basic preventive maintenance servicing (PMS) 2.1 OS parts/standards are identified and serviced according to manufacturer’s recommendations. 2.2 Fluids and lubricants are used based on manufacturer’s manual. 2.3 Basic hand tools and equipment and consumable materials are identified and used in accordance with job requirements. 2.4 Basic preventive maintenance servicing (PMS) is carried out in accordance with manufacturer’s and/or site requirements/conditions. 3. Prepare equipment reports 3.1 Daily checklist form is accomplished in accordance with manufacturer’s/company requirements. 3.2 Minor/major equipment defects are reported to appropriate personnel.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 46
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 47/79 RANGE OF VARIABLES VARIABLE RANGE 1. Lifting equipment 1.1 Rough-terrain Crane 1.2 Truck-mounted Crane 1.3 Crawler Crane 1.4 Forklift 1.4.1 Diesel 1.4.2 Gasoline/LPG 1.4.3 Electric 2. Minor defects 2.1 Weak battery 2.2 Air lock 2.3 Tire inflation 2.4 Belt tension 2.5 Clogged air cleaner 2.6 Defective radiator cap Forklift 2.7 Loose clamps. Bolts and mountings 2.8 Presence of water in fuel separator 3. Major defects 3.1 Busted hydraulic hose 3.2 Hard starting engine 3.3 Excessive engine oil consumption 3.4 Leakage on 3.4.1 Air 3.4.2 Fuel 3.4.3 Cooling 3.4.4 Hydraulic system 3.5 Faulty gauges 3.6 Damaged/broken pulley 3.7 Incorrect/defective Load Moment Indicator (LMI) 3.8 Defective/frayed wire rope Rough-terrain Crane and Truck-mounted Crane 3.9 Busted/flat tires Rough-terrain Crane and Crawler Crane 3.10 Derailed track links Forklift 3.11 Excessive engine oil consumption on: 3.11.1 Fuel 3.11.2 Water 3.11.3 Fluid 3.12 Poor engine performance 3.13 Weak brakes",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 47
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 48/79 VARIABLE RANGE 3.14 Defective electrical components 3.14.1 Charging 3.14.2 Lighting 3.14.3 Starting 3.14.4 Monitoring/gauges 4. Appropriate personnel 4.1 Equipment supervisor/Foreman 4.2 Chief mechanic 4.3 Equipment maintenance personnel Forklift 4.4 Dispatcher 4.5 Motor pool supervisor 5. Operator Serviceable (OS) parts 5.1 Battery clamps 5.2 Belts 5.3 Filters 5.3.1 Air cleaner 5.3.2 Water fuel separator/drain valve 5.4 All fluid caps 5.5 All grease points and fittings 5.6 Wire rope grease/lubricants Forklift 5.7 Battery distilled water 5.8 Chain grease 5.9 All caps (e.g., water, oil, fluid, fuel) 6. Standards 6.1 Oil pressure 6.2 Air pressure 6.3 Temperatures 6.4 Tension 6.5 Clearance and distances Forklift 6.6 Hydraulic pressure 6.7 Fuels 6.7.1 LPG 6.7.2 Diesel 6.7.3 Gasoline 6.7.4 Electric 6.8 Charging rate",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 48
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 49/79 VARIABLE RANGE 7. Fluids and lubricants 7.1 Engine oil 7.2 Hydraulic oil 7.3 Brake fluid 7.4 Multi-purpose grease 7.5 Coolant 7.6 Battery solutions Rough-terrain Crane and Truck-mounted Crane 7.7 Transmission oil Truck-mounted Crane 7.8 Fuel Forklift 7.9 Gear oil 7.10 Cleaning solutions 7.10.1 Detergent soap 7.10.2 Degreaser 8. Basic hand tools and equipment 8.1 Hand tools 8.1.1 Wrenches 8.1.2 Pliers 8.1.3 Paint brush 8.1.4 Grease gun 8.1.5 Hammer 8.1.6 Vice grip 8.1.7 Measuring tape (instrument) 8.1.8 Steel brush Rough-terrain Crane and Crawler Crane 8.1.9 Screwdriver (positive and negative) Truck-mounted Crane and Forklift 8.1.10 Screwdriver (Philips and flat tip) Rough-terrain Crane and Truck-mounted Crane 8.1.11 Tire gauge (instrument) Crawler Crane 8.1.12 Mud removing tools 8.2 Equipment 8.2.1 High pressure washer 8.2.2 Air compressor",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 49
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 50/79 VARIABLE RANGE 9. Basic preventive maintenance servicing May include but are not limited to: 9.1 Check battery clamps 9.2 Check fan belt conditions (cracked or worn-out) 9.3 Adjust belt tensions (if necessary) 9.4 Clean/Replace filters 9.4.1 Air cleaner 9.4.2 Water separator 9.5 Replace defective fluid caps 9.6 Grease all fittings on lube points 9.7 Grease wire ropes 10. Site condition/requirements 10.1 Instructions 10.2 Signages 10.3 Work schedules 10.4 Work bulletin boards 10.5 Charts 10.6 Memos 10.7 Maps 10.8 Dusty 10.9 Windy 9.10 Terrain (muddy and slippery) Forklift 9.11 Poor lighting 9.12 Vertical clearance 9.13 Overhead cable 9.14 Toxic/hazardous fumes",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 50
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 51/79 EVIDENCE GUIDE 1. Critical aspects of evidence to be considered Assessment requires evidence that the candidate: 1.1 Demonstrates ability to observe safety precautions 1.2 Demonstrates ability to identify minor defects and service them in accordance with company rules and regulations 1.3 Demonstrates ability to identify major defects with checklist and report them to appropriate personnel 1.4 Demonstrates ability to identify OS parts/standards from manufacturer's reference books/manuals 1.5 Demonstrates understanding of recommended fluid and lubricants 1.6 Demonstrates ability to use basic hand tools and equipment 1.7 Demonstrates ability to accomplish and submit daily checklist forms and reports 2. Underpinning (related) knowledge 2.1 Company rules and regulations 2.2 Basic unit specifications (BUS) 2.3 Safety (PPE, machine and environmental) 2.4 Controls and gauges 2.6 Components, systems and functions 2.7 Comprehension of operation and maintenance manual 2.8 Fluids and lubricants 2.9 Uses of basic hand tools and equipment 3. Underpinning skills 3.1 Using personal protective equipment (PPE) 3.2 Accomplishing daily checklist forms 3.3 Performing basic preventive maintenance 3.4 Using basic hand tools and equipment 3.5 Reporting minor and major defects 4. Resource implications Things necessary for the conduct of assessment 4.1 Access to lifting equipment specifications and manuals 4.2 Access to lifting equipment 4.3 Basic hand tools and equipment 4.4 Fluids and lubricants 4.5 PPE 4.6 Safety signages/barricades 5. Method of assessment Competency must be assessed through 5.1 Written and/or oral questioning 5.2 Direct observation/practical demonstration 5.3 Work record and documents",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 51
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 52/79 6. Context for assessment 6.1 Competency shall be assessed in a normal or simulated workplace environment and in accordance with safe work procedures 6.2 Competency shall be assessed while work is being undertaken independently",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 52
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY - EQUIPMENT OPERATION (Truck - Mounted Crane) NC II Promulgated December 2004/July 2007 53 / 79 UNIT OF COMPETENCY: PERFORM PRODUCTIVE OPERATION FOR TRUCK - MOUNTED CRANE UNIT CODE: CON833312 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in performing equipment standard operating procedures for a Truck - mounted Crane. ELEMENT PERFORMANCE CRITERIA Bold and Italicized terms are elaborated in the Range of Variables 1. Travel the crane 1.1 Work area is surveyed for safe accessibility or potential hazards in accordance with safe operating procedures. 1.2 Outrigger assembly position is observed. 1.3 Telescopic boom is secured and in place during travel. 1.4 Travel speed is observed in accordance with traffic rules and regulations. 1.5 Hook block on front frame is secured in place. 1.6 Aid of a signalman is required when necessary. 1.7 Unexpected situations are responded in line with company rules and regulations in a manner that minimizes risk to personnel and equipment. 2. Set - up crane 2.1 Crane is set up and positioned in accordance with safety procedures and requirements. 2.2 Unexpected situations are responded in line with company rules and regulations in a manner that minimizes risk to personnel and equipment.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 53
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 54/79 ELEMENT PERFORMANCE CRITERIA 3. Interpret load chart 3.1 Weight of the load is determined according to proper information. 3.2 Lifting capacity is determined according to working radius and boom length. 3.3 Weight of Rigging gears and attachments such as main/auxiliary hook blocks, fly jib are determined and considered as part of the load. 3.4 Lifting capacity in the load chart is followed according to manufacturer’s specifications or derated capacity of equipment. 3.5 Doubt about the lifting capacity of the crane based on load chart reading is reported to immediate supervisor. 4. Perform lifting and transferring the load 4.1 Safe work procedures and practices are observed during lifting operation. 4.2 Optimum engine speed during hoisting or swing operation is controlled. 4.3 Communication with Rigger is established and maintained during lifting and transferring of loads. 4.4 Unexpected situations are responded in line with company rules and regulations in a manner that minimizes risk to personnel and equipment.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 54
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 55/79 RANGE OF VARIABLES VARIABLE RANGE 1. Potential hazards 1.1 Other equipment 1.2 Building 1.3 Deep excavation 1.4 Sloping ground 1.5 Uneven terrain 1.6 Overhead “live” electrical wires 1.7 Underground utilities 1.8 Unstable ground 2. Unexpected situations May include but are not limited to: 2.1 Sudden engine breakdown 2.2 Busted hydraulic hose and oil leakages 2.3 Broken wire rope 2.4 Sudden loss of brake 2.5 Hitting high tension wire 2.6 Loss control of steering 2.7 Sudden ground failure 2.8 Force majeure e.g., earthquake, fire, tornado 2.9 Operator fatigue or sickness/condition 2.10 Accidents/incidents",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 55
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 56/79 VARIABLE RANGE 3. Safety procedures and requirements 3.1 Lifting Plan is thoroughly checked in accordance with job requirements 3.2 Load chart is read/interpreted in accordance with lifting configuration. 3.3 Work area is barricaded with appropriate informative warning signages. 3.4 Crane is positioned on a level and stable working ground. 3.5 Wheels and outrigger beams are adequately positioned and observed. 3.6 Cribbing under outrigger floats is used adequately (if necessary). 3.7 Usable headroom for proper sling selection is determined. 3.8 Appropriate number of partline is reeved to ensure safe working load. 3.9 Trial lift without load is performed. 3.10 Communicated with rigger to ensure that load is secured with rigging gears. 3.11 Risk control procedure is implemented in case of adverse environmental conditions. 3.1 Lifting plan 3.1.1 Lifting plan/pre-lift worksheet 3.1.2 Rigging plan 3.1.3 Site plan and lay-out 3.2 Cribbing 3.2.1 Steel plates 3.2.2 Hardwoods 3.2.3 Concrete blocks 3.3 Adverse environmental conditions 3.3.1 Poor visibility (e.g. foggy, darkness) 3.3.2 High-tension wires 3.3.3 Restricted areas 3.3.4 Wind aloft (exceeding wind velocity of 20 mph) 3.3.5 Unstable ground condition 3.3.6 Congested areas",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 56
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 57/79 VARIABLE RANGE 4. Proper information 4.1 Bill of ladings 4.2 Packing and shipping list and specifications 5. Rigging gear 5.1 Hoist hook 5.1.1 Eye shank 5.1.2 Shank shivel 5.1.3 Swivel hook 5.2 Sliding choker hook 5.3 Sure lock hook 5.3.1 Eye hook 5.3.2 Swivel hook 5.3.3 Clevis hook 5.3.4 Shank hook 5.4 Eye sling hook 5.5 Clevis sling hook 5.6 Grab hook (eye or clevis) 5.7 Weld-on hook 5.8 Sorting hook 5.9 Barrel hook 5.10 Latch 5.10.1 Shank hook 5.10.2 Swivel hook 5.10.3 Clevis sling hook 5.10.4 Eye sling hook 5.10.5 Eye hook 5.11 Slings",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 57
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 58/79 VARIABLE RANGE 6. Lifting capacity 6.1 Obsolescence (life span) 6.2 Equipment history 6.3 Machine performance 6.4 Wear and tear 7. Safe work procedures 7.1 All slings, ties and hooks are placed and secured correctly before raising the load. 7.2 Load striking the ground, machine or any other object is prevented. 7.3 The boom is prevented from striking any obstruction. 7.4 Shock/Dynamic loading is avoided. 7.5 Load handling is observed. 7.6 Lifting/Rigging gears are checked in accordance with job requirements. 8. Lifting operation 8.1 Safety devices 8.2 Release house lock 8.3 Release swing lock 8.4 Hoisting up and down 8.5 Boom swing 8.6 Boom raise and lower",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 58
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 59/79 EVIDENCE GUIDE 1. Critical aspects of evidence to be considered Assessment requires evidence that the candidate: 1.1 Demonstrates ability to operate Truck-mounted Crane in accordance with established operating procedure defined in the range of variables 1.2 Demonstrates ability to carry-out safe work practices defined in the range of variables 1.3 Demonstrates ability to interpret Load Chart, Lifting/Rigging plan 1.4 Demonstrates ability to communicate with Rigger/s regarding load handling operation 1.5 Demonstrates ability to follow correct procedures in lifting and transporting loads. 1.6 Demonstrates knowledge of basic calculation and mensuration 1.7 Demonstrates ability to carry-out travel operation 2. Underpinning (related) knowledge and attitude 2.1 Safe operating procedures and practices 2.2 Statutory safety rules and regulations 2.3 Comprehension of load charts 2.4 Comprehension of Lifting/Rigging plans/site plan and layout 2.5 Company/in-house policies and procedures 2.6 Familiarity with type and load center of gravity 2.7 Familiarity with lifting/rigging gears and its applications 2.8 Familiarity with rigging signals (ISO standard) 2.9 Basic calculations and mensurations 2.10 Defensive driving principles 3. Underpinning skills 3.1 Accomplishing crane checklist and reports 3.2 Reporting crane component failure 3.3 Performing actual operation procedure of crane 3.4 Performing safety procedures and practices 3.5 Determining weight of loads 3.6 Following load chart applications 3.7 Following correct rigging signals (ISO standard) 3.8 Calculation and mensuration skills 3.9 Defensive driving skills 4. Resource implications Things necessary for the conduct of assessment 4.1 Access to Truck-mounted Crane and job site/terrain 4.2 Available loads 4.3 Barricades and informative signages 4.4 Lifting/Rigging gears 4.5 PPE",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 59
                },
                "type": "Document"
            },
            {
                "page_content": "TR HEAVY-EQUIPMENT OPERATION (Truck-Mounted Crane) NC II Promulgated December 2004/July 2007 60/79 5. Method of assessment Competency in this unit must be assessed through 5.1 Written/Oral questioning 5.2 Direct observation/demonstration 5.3 Work record and documents 6. Context for assessment 6.1 Assessment may be conducted in the work site or in a simulated venue.",
                "metadata": {
                    "source": "datasets\\raw\\HEO (Truck Mounted Crane) NC II.pdf",
                    "page": 60
                },
                "type": "Document"
            }
        ]
    }
]