{
    "name": "Organic Agriculture Production NC II",
    "core_competencies": [
        {
            "page_content": "TR – Organic Agriculture Production NC II 30 CORE COMPETENCIES This section gives the details of the contents of the core units of competency required in Organic Agriculture Production NCII. UNIT OF COMPETENCY: RAISE ORGANIC CHICKEN UNIT CODE: AGR 612301 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to raise organic chicken efficiently and effectively. It includes selecting healthy stocks, determine suitable chicken house requirements, install cage equipment, feed chicken, manage health and growth of chicken and harvesting activities. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Select healthy stocks and suitable housing 1.1. Breed/strains breeds are identified as per PNS - Organic Agriculture - Livestock and GAHP Guidelines 1.2. Healthy chicks are selected based on industry acceptable indicator for healthy chicks. 1.3. Suitable site for chicken house are determined based on PNS recommendations. 1.4. Chicken house design is prepared based PNS recommendations. 1.5. House equipment installation design is prepared in line with PNS recommendation and actual scenario. 2. Set-up cage equipment 2.1. House equipment are installed in line with housing equipment installation design 2.2. Bedding materials are secured based on availability in the locality 2.3. Bedding is prepared in accordance with housing equipment housing design 2.4. Brooding facility is set-up in accordance with the housing equipment installation design. 3. Feed chicken 3.1. Suitable feed materials are selected based on availability in the locality and nutrient requirements of chicken 3.2. Feed materials are prepared following enterprise prescribed formulation 3.3. Animals are fed based on feeding management program 3.4. Feeding is monitored following enterprise procedure 4. Grow and harvest chicken 4.1. Growth rate is monitored based on enterprise procedures 4.2. Health care program are implemented based on enterprise procedures 4.3. Sanitation and cleanliness program are implemented based on enterprise procedure 4.4. Organic waste for fertilizer formulation are collected. 4.5. Suitable chicken for harvest are selected based on market specifications. 4.6. Production record is accomplished according to enterprise procedure.",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 31
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 31 RANGE OF VARIABLES VARIABLE SCOPE 1. Industry acceptable indicator for healthy chicks 1.1. Bright eyes 1.2. Clean, downy feathers 1.3. Uniformity (90% - 95%) 1.4. Alert 1.5. 21 day old chicks from organic farm from PNS/BAFPS 07:2003 ICS 65.020 (Organic Agriculture - Specification) 2. House equipment 2.1. Feeding troughs 2.2. Waterers 2.3. Containers of concoction 3. Bedding materials 3.1. Rice hull 3.2. Saw dust 3.3. Coco coir 3.4. Rice straw 4. Brooding facility 4.1 Bulb 4.2 Charcoal 4.3 Rice hull 5. Feed materials 5.1 Protein Sources (e.g. madre de agua; ipil - ipil) other leguminous plants 5.2 Carbohydrate sources – rootcrops 5.3 Mineral sources – e.g. Calcium - eggshells, sea shells; potassium – tubers (banana) 6. Feeding management program 6.1. Restricted 6.2. Adlibitum 6.3. Combination 7. Health care program 7.1. Deworming 7.2. Vitamins/mineral supplementation using concoctions 8. Sanitation and cleanliness program 8.1. Cleaning 8.2. Application of beneficial micro-organism 8.3. Collection of manure 9. Organic waste 9.1. Animal manure 9.2. Waste/Rotten vegetables and fruits",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 32
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 32 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1 Selected healthy stocks 1.2 Determined suitable chicken house requirements 1.3 Set-up cage equipment 1.4 Fed chicken 1.5 Managed health and growth of chicken 1.6 Harvested chicken 2. Required Knowledge and Attitudes 2.1. Knowledge, Theory, Practices and Systems Operations 2.1.1. Different breeds of chickens 2.1.2. Criteria/indicators of healthy chicks 2.1.3. Characteristics of a suitable site 2.1.4. Housing designs and housing equipment 2.1.5. Housing equipment for chicken 2.1.6. Simple carpentry 2.1.7. Housing equipment for chicken 2.1.8. Types of bedding materials 2.1.9. Bedding preparation 2.1.10. Procedures in setting-up of brooding facilities 2.1.11. Characteristics of feed materials 2.1.12. Preparation of feeds 2.1.13. Advantages and disadvantages of different feeding management 2.1.14. Knowledge on record-keeping 2.1.15. Organic-based health care products/materials 2.1.16. Practice 3Rs and 5S 2.1.17. Parts and functions of specific tools and farm implements use in raising organic chicken 2.1.18. Program of work activities are implemented as scheduled 2.2. Communication 2.2.1. Prepare and submit required reports 2.2.2. Documentation on chicken production/raising 2.2.3. Record keeping and filing 2.3. Mathematics and Mensuration 2.3.1. Basic mathematical operations 2.3.2. Computation for production of chicken 2.3.3. Unit conversion 2.3.4. Simple/basic calculation 2.4. Safety Practices 2.4.1. Proper application use of tools, farm implements and equipment. 2.4.2. Proper use of carpentry and electrical tools 2.4.3. Wear appropriate PPE 2.4.4. Proper waste disposal 2.5. Codes and Regulations 2.5.1. Comply with Organic Law 2.5.2. Good Animal Husbandry Practices (GAHP) 2.5.3. DENR, zoning ordinances 2.5.4. PNS/BAFPS 07:2003 ICS 65. 020 (Organic",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 33
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 33 Agriculture - Specification) 2.5.5. Animal Welfare Act – Minimum Standards on the Welfare of Poultry 2.5.6. PNS – Livestock 2.6. Materials, Tools & Equipment: Uses, Specifications and Maintenance 2.6.1. Tools and Equipment 2.6.1.1. Can understand and follow instructional manuals 2.6.1.2. Safe keeping of equipments every after use 2.6.2. Materials 2.6.2.1. Where to source good quality supplies, materials and equipment needed in the operation of the farm 2.6.3. Maintenance 2.6.3.1. Regular upkeep of equipments and facilities 2.6.3.2. Preventive maintenance skills 2.7. Values 2.7.1. Safety consciousness 2.7.2. Time consciousness and management 2.7.3. Resourcefulness 2.7.4. Cost consciousness 2.7.5. Diligence 2.7.6. Determined 2.7.7. Observes hygiene 3. Required Skills 3.1. Work safety 3.2. Skills in using tools and equipment 3.3. Skills in identifying breeds 3.4. Skills in ocular inspection 3.5. Measuring and drawing skills 3.6. Carpentry 3.7. Basic electricity 3.8. Monitoring skills 3.9. Practicing occupational, health and safety procedures 3.10. Record keeping 3.11. Calculations 3.12. Basic mathematical skills 3.13. Skills in preparation of reports 3.14. Oral and written communication 4. Method of Assessment Competency in this unit must be assessed through: 1. Demonstration with oral questioning 2. Written examination 5. Resource Implications 5.1 All supplies, materials and farm implements needed during farm operations should be readily available at the farm site: 5.1.1 Chicken farm are a (free range) 5.1.2 Chicken house 5.1.3 Brooding facility 5.1.4 Practice animal 5.1.5 Knapsack sprayer",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 34
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 34 5.1.6 Tools, supplies and materials  Pencil  Papers  Record books  Plant materials  Bedding materials  Brooding materials - 1 gal. capacity tin can; charcoal  Protective gloves  Masks  Rubber boots  Weighing scale  Carpentry tools  Push - Pull Ruled Tape  Calculators  Pail  Feeding trough  Water containers  Bite/push nipples  Shovel  Wheelbarrow  Chopping board  Electrical tools and supplies 5.2 Organic chicken raising manual 5.3 Protective clothing equipment and materials 5.4 All workers involved in different activities must be fully oriented and cautioned on the different specific work activities of the farm 5.5 Technical supervisors should have skills and ability in the successful implementation of work program activities 6. Context of Assessment 6.1. Assessment may occur in an appropriately simulated environment through TESDA accredited assessment centers",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 35
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 35 UNIT OF COMPETENCY: PRODUCE ORGANIC VEGETABLES UNIT CODE: AGR 611306 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude required to establish nursery, plant seedlings, perform plant care and perform harvest and post-harvest. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Establish nursery 1.1. Seeds are selected in accordance with the PNS, and NSQCS/BPI. 1.2. Seedbeds are prepared in accordance with planting requirements based on Vegetable Production manual (VPM). 1.3. Care and maintenance of seedlings are done in accordance with enterprise practice. 1.4. Potting media are prepared in accordance with enterprise procedure. 2. Plant seedlings 2.1 Land preparation is carried out in accordance with enterprise practice 2.2 Beneficial micro-organisms are introduced prior to planting in accordance with enterprise procedure 2.3 Seedlings are transplanted/planted based on VPM recommendations 2.4 Seedlings are watered based on VPM recommendations 3. Perform plant care and management 3.1 Water management is implemented according to plan. 3.2 Effective control measures are determined on specific pest and diseases as described under the “pest, disease and weed management” of the PNS 3.3 All missing hills are replanted to maintain the desired plant population of the area 3.4 Plant rejuvenation/rationing are maintained according to PNS. 3.5 Organic fertilizers are applied in accordance with fertilization policy of the PNS 4. Perform harvest and post-harvest activities 4.1. Products are checked using maturity indices according to PNS, PNS-organic agriculture and enterprise practice. 4.2. Marketable products are harvested according to PNS, PNS-organic agriculture and enterprise practice. 4.3. Harvested vegetables are classified according to PNS, PNS-organic agriculture and enterprise practice. 4.4. Appropriate harvesting tools and materials are used according to PNS. 4.5. Post harvest practices are applied according to PNS and GAP recommendations 4.6. Production record is accomplished according to enterprise procedures.",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 36
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 36 RANGE OF VARIABLES VARIABLE SCOPE 1. Care and maintenance of seedlings 1.1. Handling 1.2. Watering 1.3. Organic foliar fertilizing 1.4. Pest management 2. Land preparation 2.1. Clearing 2.2. Plowing 2.3. Harrowing 2.4. Farrowing 3. Control measures 3.1. Crop rotation 3.2. Application of beneficial microorganisms 3.3. Inter-cropping 3.4. Planting botanical repellants 3.5. Displaying organic attractants and repellants 3.6. Preserve existing predators 3.7. Mulching 4. Organic fertilizers 4.1. Basal 4.2. Foliar 5. Post-harvest practices 5.1 Postharvest operations 5.2 Using of charts and manuals 5.3 Trimming, sorting, sizing and washing 5.4 Packaging labeling and storing",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 37
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 37 EVIDENCE GUIDE 1. Critical Aspects of Competency: Assessment requires evidence that the candidate: 1.1 Established nursery 1.2 Planted seedlings 1.3 Performed plant care activities 1.4 Performed harvest and post-harvest activities 2. Required Knowledge and Attitude 2.1 Knowledge, Theory, Practices and Systems Operations 2.1.1. Germination testing 2.1.2. Seedbed preparation procedure 2.1.3. Proper handling of seedlings and plants 2.1.4. Proper water management and procedures 2.1.5. Organic method of pest and disease management 2.1.6. Organic method of nutrient management 2.1.7. Potting media preparation and procedure 2.1.8. Land preparation activities 2.1.9. Procedure in applying beneficial micro-organisms 2.1.10. Principles of bio-dynamics 2.1.11. Transplanting and planting procedures 2.1.12. Types of pest and diseases 2.1.13. Organic method of preventing and controlling pest and diseases 2.1.14. Maturity indices 2.1.15. Proper handling of harvesting tools and materials 2.1.16. Practices in post-harvest of vegetables 2.1.17. Principles and guides in post-harvest handling of perishables 2.1.18. Practice 3Rs and 5S 2.1.19. Parts and functions of specific tools and farm implements use in producing organic vegetables 2.1.20. Program of work activities are implemented as scheduled 2.2 Communication 2.2.4. Prepare and submit required reports 2.2.5. Documentation on vegetable production 2.2.6. Proper bookkeeping 2.3 Mathematics and Mensuration 2.3.5. Basic mathematical operations 2.3.6. Computation for production of chicken 2.3.7. Unit conversion 2.3.8. Simple/basic calculation 2.4 Safety Practices 2.4.5. Proper application use of tools, farm implements and equipment. 2.4.6. Proper use of carpentry and electrical tools 2.4.7. Wear appropriate PPE 2.4.8. Proper waste disposal 2.5 Codes and Regulations",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 38
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 38 \n2.5.7. Comply with Organic Law  \n2.5.8. DENR, zoning ordinances  \n2.5.9. PNS/BAFPS 07:2003 ICS 65.020 (Organic Agriculture - Specification)  \n2.5.10. Vegetable Production Manual  \n2.6 Materials, Tools & Equipment: Uses, Specifications and Maintenance  \n2.6.4. Tools and Equipment  \n2.6.1.3. Can understand and follow instructional manuals  \n2.6.1.4. Safe keeping of equipment every after use  \n2.6.5. Materials  \n2.6.2.2. Where to source good quality supplies, materials and equipment needed in the operation of the farm  \n2.6.6. Maintenance  \n2.6.3.3. Regular upkeep of equipment and facilities  \n2.6.3.4. Preventive maintenance skills  \n2.7 Values  \n2.7.8. Safety consciousness  \n2.7.9. Time consciousness and management  \n2.7.10. Resourcefulness  \n2.7.11. Cost consciousness  \n2.7.12. Confidence  \n2.7.13. Diligence  \n2.7.14. Honesty  \n2.7.15. Determined and perseverance  \n2.7.16. Observes hygiene  \n2.7.17. Ability to work with others harmoniously  \n3. Required Skills  \n3.1. Skills in land preparation  \n3.2. Planting skills  \n3.3. Application of fertilizer  \n3.4. Watering  \n3.5. Care and maintenance  \n3.6. Skills in harvesting and post-harvesting  \n3.7. Work safety  \n3.8. Skills in using tools and equipment  \n3.9. Bookkeeping and record handling  \n3.10. Calculations  \n3.11. Effective Communication  \n4. Method of Assessment Competency in this unit must be assessed through:  \n4.1. Practical demonstration with oral questioning  \n4.2. Interview  \n5. Resource Implications  \n5.1. All supplies, materials and farm implements needed during farm operations should be readily available at the farm site.  \n5.1.1 Equipment and facilities such as:  \n Booth/temporary shed  \n Cart (Kariton & paragus)",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 39
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 39\n Comb-tooth harrow\n Computer\n Crates\n Farm/field\n Greenhouse/nursery\n Harvesting equipment\n Irrigation system (sprinkler, mist/drip irrigation)\n Mower (grass cutter)\n Overhead projector (OHP)\n Portable chainsaw\n Post-Harvest treatment equipment\n Power sprayer\n Rotavator\n Service vehicle\n Sorting equipment\n Spike tooth harrow\n Storage room\n Surface irrigation system\n5.1.2 Tools and instruments such as:\n Bolos\n Broomstick\n Calculator\n Container\n Cutting tools\n Digging tools\n Drying meter\n Fruit crate\n Harvesting tools\n Hat\n Knapsack sprayer\n Knife\n Light hoe\n Moisture meter\n Petri-dish\n pH meter\n Pick mattock\n Picking knife\n Plow\n Plumbing tools\n Post-Harvest treatment tools\n Protective gadgets\n Pruning shears\n5.1.3 Supplies and Materials such as:\n Agri bags, plastic\n Bamboo stick\n Basket\n Bond paper\n Catching nets\n Clips\n Coconut dust",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 40
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 40\n Compost\n Fertilizers\n First aid supplies/medicine\n Flower inducer\n Fungicides\n Gloves\n Growing media (garden soil, sand, compost, soil, manure, and sawdust/rice)\n Killing bottles\n Marking pens\n Masks\n Mulching material\n Hair nets\n Packaging materials, assorted\n Pail\n5.2. All workers involved in different activities must be fully oriented and cautioned on the different specific work activities of the farm\n5.3. Technical supervisors should have skills and ability in the successful implementation of work program activities\n6. Context of Assessment\n6.1. Assessment may occur in an appropriately simulated environment through TESDA accredited assessment centers",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 41
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 41 \nUNIT OF COMPETENCY: PRODUCE ORGANIC FERTILIZER \nUNIT CODE: AGR 611301 \nUNIT DESCRIPTOR: This unit covers the knowledge, skills, and attitude required to produce organic fertilizers which include tasks such as preparing composting area and raw materials and carrying out composting activities and finally, harvesting of fertilizer. \nELEMENTS PERFORMANCE CRITERIA Italicized terms are elaborated in the Range Statement \n1. Prepare composting area and raw materials \n1.1 Site is selected based on compost fertilizer production requirements \n1.2 Site lay-out is prepared based on location. \n1.3 Bed is prepared in accordance with production requirements \n1.4 Materials are gathered based on production requirements and PNS for organic fertilizer \n1.5 Prepare raw materials following enterprise procedure and PNS for organic fertilizer \n2. Compost and harvest fertilizer \n2.1 Appropriate composting methods are applied based on production requirements \n2.2 Compost is monitored based PNS indicators of fully decomposed fertilizer \n2.3 Quality of harvest is checked based on PNS indicators of fully decomposed fertilizer \n2.4 Processing of compost fertilizer are carried-out based on production requirement. \n2.5 Record keeping is performed according to enterprise procedure.",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 42
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 42 RANGE OF VARIABLES VARIABLE SCOPE 1. Prepare raw materials 1.1 Shred/cut materials 1.2 Weighing 2. Composting methods 2.1. Rapid composting methods 2.2. Double dug composting 2.3. Six month composting 2.4. Substrate composting 3. Process compost fertilizer 3.1 Collection 3.2 Air drying 3.3 Sieving 3.4 Bagging 3.5 Labeling 3.6 Storing",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 43
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 43 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1 Prepared composting area 1.2 Carried out preparation of raw materials 1.3 Carried out composting process 1.4 Harvested organic fertilizer 2. Required Knowledge and Attitudes 2.1. Knowledge, Theory, Practices and Systems Operations 2.1.1. Characteristics of composting site 2.1.2. Good drainage systems 2.1.3. Availability and accessibility of site 2.1.4. Area with minimum contamination 2.1.5. Types of soil 2.1.6. Area with minimal sunlight 2.1.7. Leveling of the site 2.1.8. Determine volume of production 2.1.9. Design layout based on composting method 2.1.10. Types of raw materials 2.1.11. Preparing bed 2.1.12. Composting methods 2.1.13. Harvesting and storing of organic fertilizer 2.1.14. Record keeping 2.1.15. Practice 3Rs and 5S 2.1.16. Parts and functions of specific tools and farm implements use in manufacturing organic fertilizer 2.1.17. Program of work activities are implemented as scheduled 2.2. Communication 2.2.1. Prepare and submit required reports 2.2.2. Record keeping and documentation of all operations 2.3. Mathematics and Mensuration 2.3.1. Basic mathematical operations 2.3.2. Computation for production of organic fertilizer 2.3.3. Unit conversion 2.4. Safety Practices 2.4.1. Proper application use of tools, farm implements and equipment. 2.4.2. Wear appropriate PPE 2.4.3. Proper waste disposal 2.5. Codes and Regulations 2.5.1. Comply with Organic Law 2.5.2. PNS guidelines on organic fertilizer 2.6. Materials, Tools & Equipment: Uses, Specifications and Maintenance 2.6.1. Tools and Equipment 2.6.1.2. Can understand and follow instructional manuals 2.6.1.3. Safe keeping of equipments every after use 2.6.2. Materials",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 44
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 44 \n2.6.2.2. Where to source good quality supplies, materials and equipment needed in the operation of the farm \n2.6.3. Maintenance \n2.6.3.2. Regular upkeep of equipment and facilities \n2.6.3.3. Preventive maintenance skills \n2.7. Values \n2.7.1. Safety consciousness \n2.7.2. Time consciousness and management \n2.7.3. Resourcefulness \n2.7.4. Cost consciousness \n2.7.5. Diligence \n2.7.6. Determined \n2.7.7. Observes hygiene \n3. Required Skills \n3.1 Work safety \n3.2 Skills in using tools and equipment \n3.3 Calculations \n3.4 Basic mathematical skills \n3.5 Skills in preparation of reports \n3.6 Oral and written communication \n4. Method of Assessment Competency in this unit must be assessed through: \n4.1 Demonstration with questioning \n4.2 Written exam \n4.3 Oral interview \n5. Resource Implications \n5.1 All supplies, materials and farm implements needed during farm operations should be readily available at the farm site: \n5.1.1 Production area for compost making \n5.1.2 Office supplies, tools and farm equipment \n5.1.3 Supplies and materials in producing organic fertilizer \n5.2 Protective clothing equipment and materials All workers involved in different activities must be fully oriented and cautioned on the different specific work activities of the farm \n5.3 Technical supervisors should have skills and ability in the successful implementation of work program activities \n6. Context of Assessment \n6.1. Assessment may occur in an appropriately simulated environment through TESDA accredited assessment centers",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 45
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 45 \nUNIT OF COMPETENCY: PRODUCE ORGANIC CONCOCTIONS AND EXTRACTS \nUNIT CODE: AGR 611301 \nUNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude required to produce organic concoctions and extracts for owned farm consumptions and not for commercial purposes or selling. \nELEMENTS PERFORMANCE CRITERIA Italicized terms are elaborated in the Range Statement \n1. Prepare for the production of various concoctions \n1.1. Work and storage areas are cleaned, sanitized and secured. \n1.2. Raw materials used are cleaned and freed from synthetic chemicals \n1.3. Tools, materials and equipment used are cleaned, freed from contaminations and must be of “food grade” quality \n1.4. Personal hygiene are observed according to OHS procedures. \n2. Process concoctions \n2.1. Raw materials are prepared in accordance with enterprise practice. \n2.2. Fermentation period is set based on enterprise practice. \n2.3. Various concoctions are fermented following to organic practices. \n2.4. Concoctions are harvested based on fermentation period of the concoction. \n3. Package concoctions \n3.1. Concoctions are contained in sanitized bottles and containers. \n3.2. Packaged concoctions are labeled and tagged in accordance with enterprise practice. \n3.3. Packaged concoctions are stored in appropriate place and temperature following organic practices. \n3.4. Production of concoctions are recorded using enterprise procedures.",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 46
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 46 RANGE OF VARIABLES VARIABLE SCOPE 1. Raw materials 1.1. Natural Growth Enhancer - Fermented Plant Juice (FPJ) 1.1.1 At least three kinds of plants but not limited to kangkong, camote tops, alugbati, malunggay, banana trunks, bamboo shoots and other fast growing green plants 1.1.2 Molasse/mascuvado/brown sugar 1.2. Natural Taste Enhancer - Fermented Fruit Juice (FFJ) 1.2.1 Ripe and sweet fruits but not limited to banana, papaya, watermelon, ampalaya, tomato. 1.2.2 Molasses/mascuvado/brown sugar 1.3. Kuhol/Fish Amino Acid (KAA/FAA) 1.3.1 Trash Fish and gills, scales, offal of big fishes, golden kuhol meat 1.3.2 Molasses/mascuvado/brown sugar 1.4. Natural Immune Booster – Oriental Herbal Nutrient (OHN) 1.4.1 Garlic, ginger, 1.4.2 Pure coconut vinegar 1.4.3 Mascuvado 1.5. Natural Calcium Phosphate Micro Nutrients (CALPHOS) 1.4.1 animal bones, egg shell, sea shell, kuhol shell 1.4.2 Natural vinegar 1.6. Beneficial Microorganism 1.5.2 1 kl. cooked, cool rice 1.5.3 Molasses/mascuvado/crude sugar 1.7. Natural Enzymes – Lactic Acid Bacteria Serum (LABS) 1.6.1 900 ml. fresh milk 1.6.2 100 ml clear liquid from fermented rice 1.6.3 1 liter molasses/brown sugar/mascuvado 2. Tools and equipment 2.1 Natural Growth Enhancer - Fermented Plant Juice (FPJ) 2.1.1 Plastic pail 2.1.2 Wooden ladle 2.1.3 Manila paper or cheese cloth 2.1.4 String or rubber bands 2.1.5 Weighing scale 2.1.6 Chopping board 2.1.7 Knife 2.1.8 Marker 2.1.9 Strainer or nylon screen 2.1.10 tone (weight) 2.2 Natural Taste Enhancer - Fermented Fruit Juice (FFJ) 2.2.1 Plastic pail 2.2.2 Wooden ladle 2.2.3 Manila paper or cheese cloth 2.2.4 String or rubber bands 2.2.5 Weighing scale 2.2.6 Chopping board 2.2.7 Knife 2.2.8 Marker 2.2.9 Strainer or nylon screen 2.2.10 tone 2.3 Fish Amino Acid (FAA) 2.3.1 Plastic pail 2.3.2 Wooden ladle 2.3.3 Manila paper or cheese cloth",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 47
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 47 2.3.4 String or rubber bands 2.3.5 Weighing scale 2.3.6 Chopping board 2.3.7 Knife 2.3.8 Marker 2.3.9 Strainer or nylon screen 2.3.10 Stone 2.4 Natural Immune Booster – Oriental Herbal Nutrient (OHN) 2.4.1 Plastic pail 2.4.2 Wooden ladle 2.4.3 Manila paper or cheese cloth 2.4.4 String or rubber bands 2.4.5 Weighing scale 2.4.6 Chopping board 2.4.7 Knife 2.4.8 Marker 2.4.9 Strainer or nylon screen 2.5 Natural Calcium Phosphate Micro Nutrients (CALPHOS) 2.5.1 Plastic pail 2.5.2 Manila paper or cheese cloth 2.5.3 String or rubber bands 2.5.4 Weighing scale 2.5.5 Chopping board 2.5.6 Knife 2.5.7 Marker 2.5.8 Strainer or nylon screen 2.6 Beneficial Microorganism 2.6.1 Wooden ladle 2.6.2 Manila paper or cheese cloth 2.6.3 String or rubber bands 2.6.4 Weighing scale 2.6.5 Marker 2.6.6 wooden box or bamboo split - open or plastic tray 2.7 Natural Enzymes – Lactic Acid Bacteria Serum (LABS) 2.7.1 Plastic container 2.7.2 Manila paper or cheese cloth 2.7.3 String or rubber bands 2.7.4 Weighing scale 2.7.5 Strainer or nylon screen 3 Various concoctions 6.1. Fermented Fruit Juice - FFJ) 6.2. Fish Amino Acid (FAA) 6.3. Oriental Herbal Nutrient - OHN) 6.4. Natural Calcium Phosphate Micro - nutrients (CALPHOS) 6.5. Beneficial Microorganism 6.6. Natural Enzymes (Lactic Acid Bacteria Serum - LABS)",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 48
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 48 EVIDENCE GUIDE 1. Critical Aspects of Competency Assessment requires evidence that the candidate: 1.1. Prepared for the production of various concoctions 1.2. Processed concoctions 1.3. Packaged concoctions 2. Required Knowledge and Attitudes 2.1. Knowledge, Theory, Practices and Systems Operations 2.1.1. Types and uses/benefits of concoctions 2.1.2. Sanitization procedure 2.1.3. Sterilization procedure 2.1.4. Tools and materials needed in producing concoctions 2.1.5. Importance of cleanliness, sanitization and hygiene in producing concoction 2.1.6. Good Manufacturing Practices 2.1.7. Preparation methods of different types of concoctions 2.1.8. Raw material collection 2.1.9. Extraction procedure 2.1.10. Concoction formulation 2.1.11. Fermentation procedure 2.1.12. Putrification process 2.1.13. Harvesting procedures 2.1.14. Importance of proper labeling 2.1.15. Importance of proper storage 2.1.16. Record keeping 2.1.17. Practice 3Rs and 5S 2.1.18. Parts and functions of specific tools and farm implements use in manufacturing organic fertilizer 2.1.19. Program of work activities are implemented as scheduled 2.2. Communication 2.2.1. Record keeping 2.2.2. Prepare and submit required reports 2.2.3. Documentation of harvesting operations 2.3. Mathematics and Mensuration 2.3.1. Basic mathematical operations 2.3.2. Computation for production of organic fertilizer 2.3.3. Unit conversion 2.4. Safety Practices 2.4.1. Proper application use of tools, farm implements and equipment. 2.4.2. Safety precautions relevant to harvesting concoctions 2.4.3. Wear appropriate PPE 2.4.4. Proper waste disposal 2.5. Codes and Regulations 2.5.1. Comply with Organic Law 2.5.2. Within the codes and regulations set by Bureau of Plant Industry 2.6. Materials, Tools & Equipment: Uses, Specifications and Maintenance 2.6.1. Tools and Equipment 2.6.1.1. Can understand and follow instructional manuals 2.6.1.2. Safe keeping of equipments every after use",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 49
            },
            "type": "Document"
        },
        {
            "page_content": "TR – Organic Agriculture Production NC II 49 \n2.6.2. Materials \n2.6.2.1. Where to source good quality supplies, materials and equipment needed in the operation of the farm \n2.6.3. Maintenance \n2.6.3.1. Regular upkeep of equipment and facilities \n2.6.3.2. Preventive maintenance skills \n2.7. Values \n2.7.1. Safety consciousness \n2.7.2. Time consciousness and management \n2.7.3. Resourcefulness \n2.7.4. Cost consciousness \n2.7.5. Diligence \n2.7.6. Determined \n2.7.7. Observes hygiene \n3. Required Skills \n3.1. Using appropriate tools \n3.2. Mensurations and calculations \n3.3. Calibration of measuring instruments \n3.4. Work safety \n3.5. Skills in preparation of reports and record keeping \n3.6. Oral and written communication \n4. Method of Assessment Competency in this unit must be assessed through: \n4.1 Observation \n4.2 Interview \n4.3 Demonstration with questioning \n5. Resource Implications \n5.1 All supplies, materials and farm implements needed during farm operations should be readily available at the farm site: \n5.1.1 Concoction area \n5.1.2 Tools, supplies and materials \n- Weighing scale (1000 kg. cap.) – for monitoring ingredients weight \n- Plastic Pail – for storing purposes \n- Knife – for cutting purposes \n- Wooden Ladle – for mixing purposes \n- Manila Paper or Cheesecloth – for covering or wrapping purposes \n- Rubber Band or String – for sealing purposes \n- Strainer or nylon screen \n- Wooden box or bamboo split open or plastic tray \n- Marker – for marking purposes \n- Concoction manual \n5.2 Protective clothing equipment and materials. All workers involved in different activities must be fully oriented and cautioned on the different specific work activities of the farm \n5.3 Technical supervisors should have skills and ability in the successful implementation of work program activities \n6. Context of Assessment \n6.1. Assessment may occur in an appropriately simulated environment through TESDA accredited assessment centers",
            "metadata": {
                "source": "datasets\\raw\\Organic Agriculture Production NC II.pdf",
                "page": 50
            },
            "type": "Document"
        }
    ]
}