{
    "name": "Plumbing NC II",
    "core_competencies": [
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 38 CORE COMPETENCIES UNIT OF COMPETENCY: PREPARE ESTIMATION OF MATERIALS FOR MULTIPLE PLUMBING UNITS UNIT CODE: CON71 2348 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in estimating required materials for multiple plumbing units. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Study approved plumbing plan 1.1 All measurements in the plans are determined in accordance with job requirements and details. 1.2 Plumbing Legends, Symbols and abbreviations are identified and interpreted in accordance with job requirements. 1.3 Specification of materials are identified in the plan according to the job requirements. 1.4 Plumbing layout is determined/ visualized based on isometric drawing, schematic diagram and details. 1.5 When necessary, cost of materials are estimated based on the current market price. 1.1 ARITHMETIC 1.1.1 Linear measurement 1.1.2 Dimension 1.1.3 Unit conversion 1.2 BLUE-PRINT READING 1.2.1 Electrical, mechanical plan, symbols and abbreviations 1.3 TRADE THEORY 1.3.1 Basic technical plan 1.3.2 Various types of drawings 1.3.3 Notes and specifications 1.4 5S 1.5 Environmental-conservation procedures, e.g. 3R (reduce, reuse, recycle) 1.6 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.1 Interpreting technical plan 1.2 Communication (written and verbal) 1.3 Applying Calculation techniques",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 39
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 39 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2 Estimate and finalize materials take-off 2.1 Materials are estimated in accordance with the job requirements. 2.2 Materials and consumables are quantified and listed in accordance with the job requirements. 2.3 All results are gathered and summarized for submission in accordance with job requirements 2.4 Bill of materials and cost estimate is presented to client / supervisor for approval 2.1 ARITHMETIC 2.1.1 Linear measurement 2.1.2 Dimension 2.1.3 Unit conversion 2.2 BLUEPRINT READING 2.2.1 Electrical, mechanical plan, symbols and abbreviations 2.3 TRADE THEORY 2.3.1 Basic technical plan 2.3.2 Various types of drawings 2.3.3 Notes and specifications 2.4 5S 2.5 Environmental-conservation procedures, e.g. 3R (reduce, reuse, recycle) 2.6 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.1 Interpreting technical plan 2.2 Communication (Written and verbal) 2.3 Applying estimation techniques 2.4 Applying calculation and computation",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 40
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 40 RANGE OF VARIABLES VARIABLE RANGE 1. Plans May include: 1.1 Plumbing Plan 1.2 Structural Plan 1.3 Architectural plan 1.4 Site development plan 1.5 Mechanical Plan 1.6 Electrical Plan 2. Plumbing Legends, Symbols and abbreviation Symbols Legends Abbreviations SOIL PIPE/ WASTE PIPE SP / WP VENT PIPE / VENT ABOVE CEILING VP / VPAC COLD WATER LINE CWL DRAIN PIPE DP GATE VALVE GV COUPLING/ CONCENTRIC REDUCER CR SOIL STACK SS VENT STACK THRU ROOF VSTR COLD WATER RISER CWR FLOOR DRAIN (FLAT TYPE) FD WATER CLOSET WC LAVATORY LAV HOSE BIBB HB KITCHEN SINK KSK AREA DRAIN / CATCH BASIN AD / CB FLOAT VALVE FV CHECK VALVE CV 3. Drawing May include: 3.1 Floor Plan 3.2 Schematic Diagram of Drain, Waste, and Vent (DWV) water line 3.3 Front View 3.4 Top View 3.5 Right Side / Left Side View 3.6 Section and Details 3.7 Drawing symbols",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 41
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 41 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires that the candidate: 1.1 Studied approved blue-print plumbing plan 1.2 Ensured quality and economy in the selection of materials, tools and equipment 1.3 Finalized materials take-off 1.4 Included use of PPE in accordance with OSH standards in the estimation. 2. Resource Implications The following resources should be provided: 2.1 Technical Plans and specifications 2.2 Tools and equipment for material estimation 3. Methods of Assessment Competency may be assessed through: 3.1 Direct Observation 3.2 Questions/Interview 3.3 Demonstration with oral questioning 3.4 Written examination 4. Context of Assessment 4.1 Competency assessment may occur in the workplace or in any appropriate simulated environment 4.2 Assessment shall be observed while tasks are being undertaken individually.",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 42
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 42 UNIT OF COMPETENCY: PERFORM MULTIPLE PLUMBING UNITS INSTALLATION AND ASSEMBLIES UNIT CODE: CON71 2349 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in installing/assembling multiple units of plumbing in all types of building occupancy. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Prepare materials for drainage, sanitary, vent and waterline layout work 1.1 Work instructions/plans are read and interpreted in accordance with the job requirements 1.2 Materials, tools and equipment are selected and prepared according to job requirements 1.3 Appropriate PPE are selected according to job requirements 1.1 Blueprint reading 1.2 Materials specification 1.3 5S 1.4 Use of plumbing materials, tools and equipment 1.5 Environmental-conservation procedures, e.g. 3R (reduce, reuse, recycle) 1.1 Interpreting plan and details 1.2 Selecting and preparing appropriate materials, tools and equipment 2. Install pipes and fittings for drainage, sanitary, vent and waterline layout 2.1 Pipes and fittings are installed as indicated in the approved working plan 2.2 Pipe supports and braces are installed in accordance with the approved working plan 2.3 Correct use of materials, tools and equipment is observed in accordance with manufacturer's instruction manual. 2.4 Appropriate PPE is used in accordance with the job requirements 2.1 Mensuration 2.2 Blueprint reading 2.3 Materials specification 2.4 5S 2.5 Use of plumbing materials, tools and equipment 2.6 Environmental-conservation procedures, e.g. 3R (reduce, reuse, recycle) 2.7 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.1 Interpreting plans and details 2.2 Handling of materials, tools and equipment 2.3 Communication (written and verbal) 2.4 Applying methods and techniques in various type of pipe connections 2.5 Cutting and threading pipes 2.6 Applying markings 2.7 Applying measurement and mathematical computation",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 43
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 43 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 3. Install cold water system and multi-point water heater for hot-water supply lines 3.1 Specifications of materials for hot and cold water piping used according to job requirements 3.2 Hot and cold water supply is installed according to the approved plan. 3.3 Water supply pipe assembled and installed is leak-free. 3.4 Proper use of tools and equipment is observed in accordance with manufacturer's instruction manual. 3.1 Mensuration 3.2 Blueprint reading 3.3 Materials specification 3.4 5S 3.5 Use of plumbing materials, tools and equipment 3.6 Environmental-conservation procedures, e.g. 3R (reduce, reuse, recycle) 3.7 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 3.1 Interpreting plans and details 3.2 Handling of materials, tools and equipment 3.3 Communication (written and Verbal) 3.4 Applying methods and techniques in various type of pipe connections 3.5 Cutting and threading pipes 3.6 Applying markings 3.7 Applying measurement and mathematical computation 4. Install building drains, sewer and ventilation 4.1 Building drains/sewer and ventilation are installed in accordance to the approved plan. 4.2 Materials, tools and equipment are selected and prepared according to job requirements 4.3 Appropriate PPE are selected and used according to job requirements 4.1 Mensuration 4.2 Blueprint reading 4.3 5S 4.4 Use of plumbing materials, tools and equipment 4.5 Environmental-conservation procedures, e.g. 3R (reduce, reuse, recycle) 4.6 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 4.1 Interpreting plans and details 4.2 Handling of materials, tools and equipment 4.3 Communication (written and verbal) 4.4 Applying methods and techniques in various type of pipe connections 4.5 Applying markings",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 44
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 44 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 5. Mount and lay out plumbing fixtures and accessories 5.1 Specifications of plumbing fixtures are used in accordance with the job requirements. 5.2 Plumbing fixtures and accessories are installed according to specified roughing-in measurements and/or manufacturer's instruction manual. 5.3 Plumbing fixtures and accessories are rigidly secured with strict adherence to perpendicularity and levelness 5.4 Usage of tools and equipment is observed in accordance with manufacturer's specifications 5.5 Appropriate PPE are used in accordance with the job requirements 5.6 Work site is cleaned and kept in safe state and in accordance with Occupational Safety and Health Standards (OSHS) 5.1 Mensuration 5.2 Blueprint reading 5.3 Materials specification 5.4 5S 5.5 Use of plumbing materials, tools and equipment 5.6 Environmental-conservation procedures, e.g. 3R (reduce, reuse, recycle) 5.7 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 4.3 Interpreting plans and details 4.4 Handling of materials, tools and equipment 4.5 Communication (written and verbal) 4.6 Applying methods and techniques in various types of plumbing fixtures",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 45
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 45 RANGE OF VARIABLES VARIABLE RANGE 1. Tools and equipment May include: 1.1 Steel Tape 1.2 Ball-peen Hammer 1.3 Hack saw with Blade 1.4 Blow Torch 1.5 Pointed Steel Chisel 1.6 Caulked Steel Chisel 1.7 Kettle 1.8 Manual Pipe Threader (1/4” - 2”) 1.9 Pipe Wrench (10”, 12” & 14”, 18”, 24”) 1.10 Pipe Vise (Chain or Yoke) 1.11 Bar or Hose level 1.12 Plumb bob 1.13 Pipe Cutter 1.14 Pipe Reamer 1.15 Threading Machine 1.16 Welding Machine 1.17 Test Pump (Manual or Power Driven) 1.18 Electric Drill 1.19 Cutting outfit set with oxygen/acetylene tank 1.20 Electric Grinder 1.21 Fusion Machine 1.22 Grooving machine 1.23 Pliers 1.24 Wrenches (open, box, combination, adjustable, socket, allen) 2. Personal Protective Equipment (PPE) May include: 2.1 Safety Shoes 2.2 Hard Hat 2.3 Gloves 2.4 Goggles 2.5 Ear Muffs 2.6 Welding Mask / Face Shield 2.7 Uniform and I.D. 2.8 Apron/ Welding Gloves 2.9 Emergency medical kit 2.10 Full body harness / safety belt 2.11 Dust mask",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 46
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 46 VARIABLE RANGE 3. Pipes and Fittings May include: 3.1 PVC Pipes and Fittings (DWV) 3.2 PPR Pipes and fittings 3.3 G.I. Pipes and Fittings 3.4 C. I Pipes and Fittings 3.5 PVC Blue Pressure Pipes and Fittings 3.6 Copper Pipes and fittings 3.7 HDPE Pipes and fittings 4. Plumbing Fixtures and Accessories May include: 4.1 Water closet (flush tank/valve) Angle valve and Supply pipe 4.2 Lavatory with faucet, P-Trap, Angle Valve and supply pipe 4.3 Bath Tub including waste and overflow assembly 4.4 Shower head and valve assembly 4.5 Flushometer Valve 4.6 Electric Flushing devices (sensor) 4.7 Grease Trap 4.8 Instantaneous water heater 4.9 Bidet 4.10 Kitchen sink with faucet, P-Trap, Angle valve and supply pipe 4.11 Slop sink 4.12 Grab bar 4.13 Urinal 4.14 Toilet paper holder 4.15 Soap holder 4.16 Towel rack 4.17 Floor drain strainer 4.18 Faucet 4.19 Cleanout cover",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 47
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 47 EVIDENCE GUIDE 1. Critical aspects of competency Competency assessment requires evidence that the candidate: 1.1 Read and interpreted work instructions/plans in accordance with job requirements 1.2 Materials, tools and equipment selected and prepared according to job requirements 1.3 Installed pipes and fittings in accordance with the approved working plan and materials specifications 1.4 Installed hot - and cold - water supply according to the approved working plan and materials specifications 1.5 Installed building drains/sewer in accordance with approved working plan and materials specifications and followed standard slope requirements 1.6 Installed plumbing fixtures according to specified rough - in measurements and/or manufacturer's specifications and required standard in the RNPCP 1.7 Demonstrated compliance with safety regulations applicable to work site operations 1.8 Identified faults and problems that occur and made necessary action to rectify 1.9 Communicated interactively with others where applicable to ensure safe and effective work operations 1.10 Completed performing complex/multi - storey plumbing installation/assemblies within specifications 2. Resource Implications The following resources should be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate to construction processes 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3 Methods of Assessment Competency should be assessed through: 3.1 Direct observation of application to tasks 3.2 Questions related to required knowledge 4 Context for Assessment 3.1 Competency may be assessed in the workplace or in a simulated workplace setting",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 48
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 48 UNIT OF COMPETENCY: CONDUCT PIPE LEAK TESTING UNIT CODE: CON71 2350 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in conducting pipe leak testing. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Prepare for conducting pipe leak testing 1.1 Work instructions are read and interpreted in accordance with the job requirements 1.2 Materials, tools and equipment are selected and prepared in accordance with job requirements 1.3 All openings in the pipe system are tightly closed except the highest opening 1.4 Appropriate PPE are selected in accordance with job requirements 1.1 Mensuration 1.2 Blue print reading 1.3 Materials specification 1.4 5S 1.5 Use of plumbing materials, tools and equipment 1.6 Environmental-conservation procedures, e.g. 3R (reduce, reuse, recycle) 1.7 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 1.1 Interpreting plan and details 1.2 Handling of materials, tools and equipment 1.3 Communication (written and verbal) 1.4 Applying methods and techniques in pipe leak testing",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 49
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 49 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Perform pipe leak testing 2.1 All openings in the pipe system are tightly closed except the highest opening prior to leak testing 2.2 Leak testing is applied after completion of roughing - ins and complete installation of pipe supports. 2.3 Testing apparatus is set to specified pressure rating according to testing standards. 2.4 Gravity or flood testing are applied to sanitary, waste, vent and storm drainage piping. 2.5 Pressure testing are applied to hot and cold water piping. 2.6 Correct usage of tools and equipment is observed in accordance with manufacturer's specifications 2.7 Appropriate PPE are used in accordance with job requirements 2.8 Work site is cleaned and kept in safe state and in accordance with OSHS 2.1 Blueprint reading 2.2 5S 2.3 Use of plumbing materials, tools and equipment 2.4 Environmental-conservation procedures, e.g. 3R (reduce, reuse, recycle) 2.5 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry 2.1 Interpreting plan and details 2.2 Handling of materials, tools and equipment 2.3 Communication (written and verbal) 2.4 Applying methods and techniques in pipe leak testing",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 50
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 50 RANGE OF VARIABLES VARIABLE RANGE 1. Materials May Include: 1.1 Drum / Pail 1.2 Water 1.3 Plugs 1.4 Pipe system drawing 1.5 Rags 1.6 Water Hose 1.7 Teflon tape 2. Tools and equipment May include: 2.1 Pipe wrench 2.2 Pipe threader 2.3 Pipe cutter 2.4 Manual / Electric test pump 2.5 Blow torch 2.6 Steel tape 2.7 Adjustable Wrench 2.8 Ballpeen hammer 2.9 Cold chisel 2.10 Hacksaw with blade 2.11 Set of Allen wrench 2.12 Screw Driver (Philips and Flat) 2.13 Mechanical Plier 2.14 Vise Grip 2.15 Ladder / scaffolding 2.16 Flashlight / trouble light 2.17 Pressure Gauge 3. Personal protective equipment (PPE) Must Include: 3.1 Gloves 3.2 Hard hat 3.3 Safety Shoes 3.4 Safety harness/ belt 4. Leak testing May Include: 4.1 Water test 4.2 Testing by section 4.3 Air/smoke test 4.4 Gravity / flow test",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 51
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 51 EVIDENCE GUIDE 1. Critical aspects of competency Competency assessment requires evidence that the candidate: 1.1 Read and interpreted work instructions in accordance with the job requirements 1.2 Selected and prepared materials, tools and equipment in accordance with job requirements 1.3 Performed pipe leak testing procedures/method in accordance with the job requirements 1.4 Applied organizational quality procedures and process within the context of conducting pipe leak testing procedures 1.5 Demonstrated compliance with safety regulations applicable to work site operations 1.6 Identified faults and problems that occur and take necessary action to rectify 1.7 Communicated interactively with others where applicable to ensure safe and effective work operations 2. Resource Implications The following resources should be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate to construction processes 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3. Methods of Assessment Competency should be assessed through: 3.1 Direct observation on application of tasks 3.2 Questions related to underpinning knowledge 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in a simulated workplace setting",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 52
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 52 UNIT OF COMPETENCY: PERFORM PLUMBING REPAIR AND MAINTENANCE WORK UNIT CODE: CON71 2351 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in repairing and maintaining plumbing works. ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 1. Repair defective pipes, fittings and plumbing fixtures 1.1 Defective pipes, fittings and plumbing fixtures are identified, disconnected and replaced with the same model and in line with its original working condition 1.2 Replacements are checked and re-tested to ensure they are free from defects and in accordance with standard specification or as required 1.3 Joints are tightly secured and leak free in accordance with the job requirements 1.4 Damaged areas are restored or repaired in line with its original working condition 1.5 Correct usage of tools, equipment and consumables are observed in accordance with job requirements 1.6 Appropriate PPE are used in accordance with job requirements 1.1 Mensuration 1.2 Blueprint reading 1.3 Materials specification 1.4 5S 1.5 Use of materials, consumables, tools and equipment 1.6 Plumbing fixtures 1.7 Environmental-conservation procedures e.g. 3R (reduce, reuse, recycle) 1.8 DOLE Department Order No. 13 s. 1998 Guidelines Governing Occupational Safety and Health in the Construction Industry. 1.1 Interpreting plans and details 1.2 Replacing broken/defective pipes 1.3 Clearing clogged pipes and drainage 1.4 Handling of materials, tools and equipment 1.5 Communication (written and verbal) 1.6 Applying methods and techniques in repairing defective pipes, fittings and plumbing fixtures",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 53
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 53 ELEMENT PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables REQUIRED KNOWLEDGE REQUIRED SKILLS 2. Clear clogged pipes and drains 2.1 Clogged pipes and drains are precisely identified in reference with the as-built plan. 2.2 Clogged pipes and drains are cleared using appropriate tools, equipment and methodology 2.3 Pipes and drain are cleared and provided with screen in line with original working condition 2.4 Appropriate PPE are used in accordance with the job requirements 2.1 Mensuration 2.2 Blueprint reading 2.3 5S 2.4 Use of tools and equipment 2.5 Environmental-conservation procedures e.g. 3R (reduce, reuse, recycle) 2.6 DOLE Department Order No. 13 s. 1998 (Guidelines Governing Occupational Safety and Health in the Construction Industry) 2.1 Interpreting plan and details 2.2 Handling of tools and equipment 2.3 Clearing clogged pipes and drains",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 54
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 54 RANGE OF VARIABLES VARIABLE RANGE 1. Pipes and fittings May include: 1.1 PVC/PE Pipe and fittings 1.2 PP R pipes and fittings 1.3 G.I. pipes and fittings 1.4 C.I. pipes and fittings 1.5 B.I. pipes and fittings 1.6 Tank fittings for water closet 1.7 Flush tank fittings for water closet 1.8 Sewer and drainage line 1.9 Water supply and distribution line 1.10 Riser and downfeed 1.11 Copper pipes and fittings 2. Plumbing fixtures May include: 2.1 Lavatory with faucet, p-trap, angle valve and supply pipe 2.2 Bathtub with waste and overflow assembly 2.3 Shower valve 2.4 Flushometer valve 2.5 Shower heads 2.6 Electronic flushing devices (urinal, closet, faucet) 2.7 Water closet (flush tank/valve), angle valve and supply pipe 2.8 Kitchen Sink 2.9 Bidet 2.10 Urinal 2.11 Grease Trap 2.12 Floor Drain Strainer 2.13 Clean-out cover 2.14 Water hammer arrester",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 55
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 55 VARIABLE RANGE 3. Tools, equipment, and consumables May include: 3.1 Pipe wrench 3.2 Pipe threader 3.3 Pipe cutter 3.4 Manual / Electric test pump 3.5 Hand drain cleaner 3.6 Blow torch 3.7 Steel tape 3.8 Adjustable Wrench 3.9 Ballpeen hammer 3.10 Cold chisel 3.11 Hacksaw with blade 3.12 Basin wrench 3.13 Strap wrench 3.14 Set of Allen wrench 3.15 Screw Driver (Philips and Flat) 3.16 Mechanical Plier 3.17 Vise Grip 3.18 Teflon Tapes 3.19 Rags 3.20 Solvent Cement 4. Personal protective equipment (PPE) May include: 4.1 Gloves 4.2 Hard hat 4.3 Safety Shoes 4.4 Ear muff 4.5 Goggles 4.6 Face Shield 4.7 Safety Harness / belt 4.8 Dust mask",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 56
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR PLUMBING NC II (Amended) Promulgated October 2014 Page 56 EVIDENCE GUIDE 1. Critical aspects of competency Competency assessment requires evidence that the candidate: 1.1 Selected and prepared materials, tools, equipment and consumables in accordance with job requirements 1.2 Identified, disconnected and repaired defective pipes, fittings and plumbing fixtures in accordance with standard specification or as required 1.3 Cleared clogged pipes and drains in line with SOPs 1.4 Demonstrated compliance with safety and environment regulations are applicable to work site operations 1.5 Identified faults and problems that occur and made necessary action to rectify 1.6 Communicated interactively with others where applicable to ensure safe and effective work operations 2. Resource Implications The following resources should be provided: 2.1 Workplace location 2.2 Tools and equipment appropriate to plumbing repair and maintenance work 2.3 Materials relevant to the proposed activity 2.4 Drawings and specifications relevant to the task 3. Methods of Assessment Competency should be assessed through: 3.1 Direct observation on application of tasks 3.2 Questions related to underpinning knowledge 4. Context for Assessment 4.1 Competency may be assessed in the workplace or in a simulated workplace setting",
            "metadata": {
                "source": "datasets\\raw\\Plumbing NC II.pdf",
                "page": 57
            },
            "type": "Document"
        }
    ]
}