{
    "name": "RAC Servicing (DomRAC) NC II",
    "core_competencies": [
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 50 CORE COMPETENCIES UNIT OF COMPETENCY: INSTALL DOMESTIC REFRIGERATION AND AIR-CONDITIONING (DomRAC) UNITS UNIT CODE: HVC7233 37 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes required to safely install and test domestic refrigeration and air-conditioning (DomRAC) units. It includes conducting survey for installation, installing DomRAC unit and its electrical circuit as well as conducting performance testing. ELEMENT PERFORMANCE CRITERIA Bold & Italicized fonts are elaborated in the Range of Variables 1. Conduct survey 1.1. Site conditions and installation requirements are assessed according to manufacturer’s specification and prevailing codes and ordinances. 1.2. Tools, equipment and materials needed for installation are determined according to site conditions and site installation requirements. 1.3. Survey result is reported in accordance with enterprise policies and procedures 2. Install DomRAC electrical circuit 2.1. Roughing-in activities are performed in accordance with the applicable Philippine Electrical Code (PEC) provisions 2.2. Electrical cabling and wiring devices of correct load carrying capacity are selected and safely installed in line with manufacturer's instructions 2.3. Power wiring is installed in accordance with applicable PEC provisions 2.4. Electrical circuit is tested in accordance with applicable PEC provisions 3. Install DomRAC unit 3.1. Unit and equipment/components are prepared based on work procedures 3.2. Bracket, hangers and frames are installed in accordance with manufacturer’s recommendation and/or RAC Code of Practice 3.3. Unit is positioned and leveled in line with manufacturer's instructions and/or RAC Code of Practice 3.4. Sealing materials are installed to ensure an airtight seal around the unit in line with manufacturer's instructions and/or RAC Code of Practice 3.5. Condensate drain is installed in accordance with manufacturer’s recommendation and/or RAC Code of Practice 3.6. Safe manual handling techniques are employed in line with enterprise OH&S procedures 3.7. 5’s is exercised in line with enterprise policy",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 51
            },
            "type": "Document"
        },
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 51 ELEMENT PERFORMANCE CRITERIA Bold & Italicized fonts are elaborated in the Range of Variables 4. Conduct performance test 4.1. Voltage and current are measured according to unit power requirements. 4.2. Air temperature and velocity are measured based on unit specifications. 4.3. Sounds and vibration are checked based on unit specifications 4.4. Service report is accomplished in line with enterprise policies and procedures.",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 52
            },
            "type": "Document"
        },
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 52 RANGE OF VARIABLES VARIABLE RANGE 1. site conditions Site conditions may include: 1.1. assessment of structural and architectural installation provisions 1.2. assessment of availability of power source and unit’s electrical provisions 1.3. assessment of wall finishing provisions 1.4. assessment of drainage provisions 1.5. assessment of air circulation/ventilation provision 2. installation requirements Installation requirements may include: 2.1. installation location requirements 2.2. wall finishing requirements 2.3. Electrical requirements  A/C plug and outlet  Wire size  Protection devices  Grounding 3. Tools and equipment Tools and equipment may include: 3.1. Measuring tools 3.2. Spirit level 3.3. Plumb bob 3.4. Clear/Transparent water hose 3.5. Screw driver, flat and philip 3.6. Chisel 3.7. Hammer (claw and ballpeen) 3.8. Hacksaw 3.9. Electric drill 3.10. Drill bits 3.11. Cross cut/Rip saw 3.12. Welding equipment 3.13. Masonry tools (e.g. trowel, spade, level, etc.) 4. Materials Materials includes: 4.1. Expansion bolt 4.2. Welding electrode (rod) 4.3. Sealant 4.4. Electrical cable/conduction 4.5. Convenience outlet 4.6. Electrical railways 4.7. Circuit breaker/switch 4.8. Masonry materials (e.g. cement, sand, etc.)",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 53
            },
            "type": "Document"
        },
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 53 5. Wiring devices May include: 5.1. Service grounding 5.2. Service outlet 5.3. Service plug 6. Unit Unit includes: 6.1. Window type air-conditioner 6.2. Domestic Refrigeration unit (e.g. refrigerator, water cooler, household freezer, etc.) 7. Sealing materials May include: 7.1. Rubber gasket 7.2. Foam 7.3. Plastic 7.4. Silicone 8. Condensate drain May include: 8.1. PVC pipe/clamp 8.2. Plastic tubing/clamp 8.3. G.I. or metal tubing/clamp 9. OH&S procedures May include:  Wearing of PPE  Lifting procedures  Ladder safety  Housekeeping 10. Service report May include:  Installation report  Testing report  Commissioning report",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 54
            },
            "type": "Document"
        },
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 54 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1. Assessed site conditions for DomRAC installation 1.2. Installed electrical circuit 1.3. Installed unit 1.4. Tested unit 1.5. Performed housekeeping 2. Required Knowledge and Attitude 2.1 SAFETY PRACTICES  Protective personal equipment/safety gears  Handling of tools, equipment and accessories  Safety signs and symbols  Good housekeeping 2.2 TRADE MATHEMATICS/ MENSURATION  Linear measurements  Ratio and proportion  Unit conversion 2.3 BLUEPRINT READING AND PLAN SPECIFICATION  Electrical plans, symbols and abbreviations 2.4 MATERIALS, TOOLS: USES AND SPECIFICATIONS  Types of sealant  Types of insulation  Types of wires, conduits and fittings  Types of wiring device 2.5 TRADE THEORY  Basic refrigeration cycle  Basic electricity  Basic masonry  Basic carpentry  Basic plumbing  Basic arc welding 2.6 MAINTENANCE  Preventive Maintenance 2.7 LEGISLATION  RAC Code of Practice  Philippine Electrical Code 3. Required Skills 3.1 Interpreting plans and details 3.2 Preparing materials 3.3 Proper handling of tools and equipment 3.4 Working safely 3.5 Installing window-type air-conditioning and domestic refrigeration unit 3.6 Testing power supply 3.7 Connecting power circuit 3.8 Operating window-type air-conditioning unit and domestic refrigeration unit 3.9 Communicating effectively 4. Resource Implications The following resources must be provided: 4.1 Access to work place location/installation area 4.2 Tools and equipment appropriate to installation 4.3 Materials relevant to the proposed activity/task 4.4 Drawings and specifications relevant to the task 5. Methods of Assessment Competency must be assessed through: 5.1 Demonstration/Direct observation with oral questioning 5.2 Portfolio 5.3 Third party report 6. Context for Assessment 6.1 Competency may be assessed in the workplace or in a simulated workplace setting",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 55
            },
            "type": "Document"
        },
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 55 UNIT OF COMPETENCY: SERVICE AND MAINTAIN DOMESTIC REFRIGERATION AND AIR-CONDITIONING (DomRAC) UNITS UNIT CODE: HVC7233 38 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes in servicing and maintaining domestic refrigeration and air-conditioning units. Specifically it includes cleaning and replacing air filters, servicing evaporator/condenser, maintaining fan motor assembly, servicing electrical power and control circuits as well as accomplishing service and maintenance report. ELEMENT PERFORMANCE CRITERIA Bold & Italicized fonts are elaborated in the Range of Variables 1. Clean and replace air filter 1.1 Air filter is identified and removed following standard procedures 1.2 Filter is checked for damage and replaced if required in line with SOPs 1.3 Air filter is cleaned using the correct tools and cleaning procedures 1.4 Filter is replaced in accordance with filter specifications 2. Service evaporator/condenser 2.1 Tools are selected in dismantling the evaporator/condensing unit as per standard operating procedures (SOPs) 2.2 High pressure washer is used in cleaning evaporator/condensing coil based on established procedures 2.3 Evaporator/condenser coil fins are straightened in accordance with service procedure 2.4 Cleaning agent or non-corrosive chemical is used in cleaning and maintaining evaporator/condensing coil, fins and other body accessories as per standard operating procedures (SOPs) 3. Maintain fan motor assembly 3.1 Fan motor is maintained in line with manufacturer’s instructions. 3.2 Fan blades and blower are serviced and maintained in line with manufacturer’s instructions. 3.3 Fan motor terminals are checked and serviced in line with manufacturer’s instructions. 3.4 Fan motor mounting is checked and serviced in line with manufacturer’s instructions.",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 56
            },
            "type": "Document"
        },
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 56 ELEMENT PERFORMANCE CRITERIA Bold & Italicized fonts are elaborated in the Range of Variables 4. Service electrical power and control circuits 4.1 Proper instrument is used in checking power supply and diagnosing electrical control 4.2 Loose connections/wirings are repaired and reported in line with SOP 4.3 Plugs and outlets are checked in line with SOP 4.4 Grounding is checked in line with SOP 5. Accomplish service and maintenance report 5.1 All defects and problems encountered are reported in line with enterprise policies and procedures. 5.2 Observation and recommendation are properly reported in line with enterprise policies and procedures.",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 57
            },
            "type": "Document"
        },
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 57 RANGE OF VARIABLES VARIABLE RANGE 1. Air filter 1.1. Disposable 1.2. Reusable 2. Cleaning agent 2.1. Soap powder 2.2. Liquid soap 3. Other body accessories 3.1. base pan 3.2. drip tray 3.3. shroud 3.4. face cover 3.5. housing 3.6. propeller blade 3.7. centrifugal fan (blower) 4. proper instrument May include:  clamp meter  VOM multi-tester",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 58
            },
            "type": "Document"
        },
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 58 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1. Cleaned and/or replaced air filter parts/components 1.2. Cleaned evaporator/condensing coil 1.3. Maintained fan motor assembly 1.4. Serviced electrical power and control circuits 1.5. Accomplished service report. 2. Required Knowledge 2.1 SAFETY PRACTICES  Protective personal equipment/safety gears  Handling of tools, equipment and accessories  Safety signs and symbols  Good housekeeping 2.2 MATERIALS AND TOOLS: USES AND SPECIFICATIONS  Types of lubricants  Parts of refrigerant circuit  Cleaning agents 2.3 EQUIPMENT  Pressure washer  Clamp meter  VOM multi-tester 2.4 TRADE THEORY  Electrical/electric controls  Basic electricity/electronics  Fundamentals of refrigeration cycle  Fan motors  Motor compressor  Refrigeration system 2.5 PROCESSES  Cleaning procedures  Servicing and maintenance procedures 2.6 LEGISLATION  RAC Code of Practice  PEC 3. Required Skills 3.1 Interpreting diagrams 3.2 Preparing materials 3.3 Proper handling of tools and equipment 3.4 Testing electrical system 3.5 assembling and disassembling 3.6 inter-personal skills 4. Resource Implications The following resources must be provided: 4.1 Access to workplace location 4.2 Tools and equipment 4.3 Materials relevant to the proposed activity 4.4 service manual 5. Methods of Assessment Competency must be assessed through: 5.1 Direct observation/demonstration with oral questioning 5.2 Portfolio 5.3 Third party results 6. Context for Assessment 6.1 Competency may be assessed in the workplace or in a simulated workplace setting",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 59
            },
            "type": "Document"
        },
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 59 UNIT OF COMPETENCY: TROUBLESHOOT AND REPAIR DOMESTIC REFRIGERATION AND AIR-CONDITIONING (DomRAC) SYSTEMS UNIT CODE: HVC7233 39 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitudes to identify and analyze faults and troubles found in DomRAC systems. It also covers identifying and repairing faults/troubles, performing refrigerant recovery/recycling and retrofitting on domestic refrigeration and air-conditioning unit as well as performing test-run on repaired DomRAC units. ELEMENT PERFORMANCE CRITERIA Bold & Italicized fonts are elaborated in the Range of Variables 1. Plan and prepare for troubleshooting and repair 1.1 Appropriate wiring diagrams, charts and manuals are interpreted in line with the job requirements 1.2 Appropriate materials, tools and equipment are selected based on job requirements 1.3 Power supply is checked to ensure compliance with nameplate rating and/or manufacturer’s specifications 2. Identify and repair faults/troubles 2.1. Appropriate PPE are selected and used in line with job requirements 2.2. Components are tested following manufacturer’s manual, RAC Code of Practice and/or enterprise troubleshooting policy 2.3. Faults/problems with components are diagnosed in line with manufacturer’s manual, RAC Code of Practice and/or enterprise troubleshooting policy 2.4. Remedial action is taken to overcome faults/problems in line manufacturer’s manual, RAC Code of Practice and/or enterprise troubleshooting policy 2.5. Work is completed safely in line with workplace safety guidelines 2.6. Report on testing procedure, including faults and minor repair, is completed in line with manufacturer’s manual, RAC Code of Practice and/or enterprise troubleshooting policy",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 60
            },
            "type": "Document"
        },
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 60 ELEMENT PERFORMANCE CRITERIA Bold & Italicized fonts are elaborated in the Range of Variables 3. Perform refrigerant recovery/recycling and retrofitting/conversion on domestic refrigeration and air-conditioning unit 3.1 Safe working practices are observed throughout the task as per enterprise procedure 3.2 Suitable tools and equipment are selected and used based on job requirement 3.3 Optimum recovery of refrigerant is performed in line with RAC Code of Practice 3.4 Refrigerants recovery/recycling is performed according to manufacturer's recommendations and RAC Code of Practice 3.5 Retrofitting is performed based on RAC Code of Practice 3.6 Conversion is performed based on UN Conversion Manual. 4. Test-run repaired unit 2.7. Unit is tested in line with troubleshooting procedures 2.8. Report on repair and testing of unit is prepared in line with enterprise procedures",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 61
            },
            "type": "Document"
        },
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 61 RANGE OF VARIABLES VARIABLE RANGE 1. Components May include but not limited to: 1.1. Electrical controls - Thermostat - Defrost timer - Relay - Thermo disc/Defrost thermostat - Switches - Overload protector 1.2. Compressor motor 1.3. Fan motors 1.4. Refrigerator defrost heater 1.5. Capacitor 2. PPE Includes but not limited to: 2.1. Mask 2.2. Safety shoes 2.3. Safety goggles 2.4. Apron 2.5. Gloves 3. Test May include: 3.1. Insulation 3.2. Resistance 3.3. Mechanical 3.4. Continuity 3.5. Timing Sequence 3.6. Leak",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 62
            },
            "type": "Document"
        },
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 62 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 1.1 Diagnosed DomRAC faults/problems 1.2 Recover/Recycle refrigerants 1.3 Repaired and Retrofitted DomRAC 1.4 Tested Unit 1.5 Accomplished Service Report 2. Required Knowledge 2.1 SAFETY PRACTICES  Protective personal equipment/safety gears  Handling of tools, equipment and accessories  Safety signs and symbols  Good housekeeping 2.2 BLUEPRINT READING AND PLAN SPECIFICATION  Schematic diagrams 2.3 MATERIALS AND TOOLS: USES AND SPECIFICATIONS  Piercing valve  Refrigerants  Refrigeration oil  Refrigeration accessories Equipment  Recovery machine  Gauge manifold  Vacuum pump  Refractometer  Weighing Scale  Vacuumeter  Refrigerant identifier  Thermometer  Leak detector  Clamp meter 2.4 TRADE THEORY  Basic Electricity  Basic electronics  Refrigeration principles  Instrumentation 2.5 PROCESSES/ PROCEDURES  Recovery/Recycling  Retrofitting  Conversion  Motor insulation testing procedure  Wiring resistance testing procedure  Mechanical testing procedure  Compressor construction  Electrical system analysis  Mechanical system analysis 2.6 LEGISLATION  Environmental Protection Agency (EPA) Section 608  DENR - EMB DAO No. 2004 - 08  19th MOP decision XIX/6 of the Montreal Protocol on Substances that Depletes the Ozone Layer  Kyoto Protocol  RAC Code of Practice  UN Climate Change Framework  Republic Act 9729 sec 3.k,3.l,3.m,3.n,3.0  UN Conversion Manual",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 63
            },
            "type": "Document"
        },
        {
            "page_content": "TR RAC SERVICING (DomRAC) NC II Revised October 2011 633. Required Skills 3.1 Interpreting schematic diagram 3.2 Preparing materials 3.3 Proper handling of electrical tools/equipment 3.4 Testing electrical system 3.5 Testing mechanical system 3.6 Tube processing 3.7 Proper handling of refrigerant and refrigeration oil 3.8 Recovery/recycling refrigerants 3.9 Retrofitting 3.10 System reprocess 4. Resource Implications The following resources must be provided: 4.1 access to work place location and mockup unit 4.2 Tools and equipment appropriate to troubleshooting and repair 4.3 Materials relevant to the proposed activity 4.4 Drawings and specifications relevant to the task 5. Methods of Assessment Competency must be assessed through: 5.1 Demonstration/Direct observation with oral questioning 5.2 Portfolio 5.3 Third party report 6. Context for Assessment 6.1 Competency may be assessed in the work place or in a simulated work place setting",
            "metadata": {
                "source": "datasets\\raw\\RAC Servicing (DomRAC) NC II.pdf",
                "page": 64
            },
            "type": "Document"
        }
    ]
}