{
    "name": "Ship_s Catering Services  NC I",
    "core_competencies": [
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR - SHIP’S CATERING SERVICES NC I Promulgated May 2013 27 CORE COMPETENCIES UNIT OF COMPETENCY: PERFORM MESS HALL SERVICE UNIT CODE: MTM512313 UNIT DESCRIPTOR: This unit deals with the knowledge, skills and attitudes in performing mess hall services. It includes setting up tables, serving food, clearing the table, washing used tableware, disposing garbage and preparing the pantry area. ELEMENTS PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Set up table 1.1 Tableware is set-up according to ship’s table setting standards. 1.2 Tables and chairs are cleaned and checked for damages and functionality 1.3 Condiments are set up in according to ship’s table setting standards 2 Serve food 2.1 Officers and/or visitors are greeted and assisted in sitting 2.2 Prepared food are checked for completeness and correctness before serving 2.3 Prepared food are served according to ship’s service standard 2.4 Officers/visitors needs are checked from time to time until they moved out 2.5 Hot holding food equipment are monitored during service time 3 Clear table 3.1 Unused/Soiled plates/flatwares are bussed out 3.2 Condiments/shakers are removed from the tables and returned to designated storage 3.3 Tables and chairs are cleaned according ship’s standard 4 Wash used tableware and dispose waste 4.1 Tableware are scraped, sorted and stocked 4.2 Tableware are cleaned and dried according to ship’s sanitation standards 4.3 Cleaned tableware are secured in designated storage area 4.4 Waste are disposed according to relevant regulations MARPOL requirements 5 Prepare pantry area for service 5.1 Pantry area is cleaned all the time as per ship’s sanitation standards 5.2 Availability of beverages, condiments and table ware in the pantry area is monitored daily 5.3 Pantry equipment are used properly in accordance with manufacturer’s instruction or manual.",
            "metadata": {
                "source": "datasets\\raw\\Ship_s Catering Services  NC I.pdf",
                "page": 28
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08  TR - SHIP’S CATERING SERVICES NC I   Promulgated   May  2013   28  RANGE OF VARIABLES   VARIABLES  RANGE  1.  Table ware  May include:  1.1  Plates  1.1.1  Dinner Plate           -  10 in. diameter  1.1.2  Fish/Luncheon Plate     -  8 in. diameter  1.1.3  Dessert/Salad Plate     -  7 in. diameter  1.1.4  Cereal plate/ bowl   -   5 in. diameter  1.1.5  Side plate or bread plate –  6 in. diameter  1.1.6  Soup plate  1.1.7  Oval plate  1.2  Cup & Saucer  1.2.1  Soup/bouillon cup / sauce –  8 – 10 oz.  1.2.2  Teacup/ coffee cup & saucer -  6 2/3 oz  1.2.3  Tea pot -  ½ pt ; 1 pt.  1 ½  pt ; 2 pt  1.2.4  Fork & spoon  1.2.4.1    Dinner fork & spoon  1.2.4.2    Service fork & spoon  1.2.4.3    Teaspoon  1.2.4.4    Soup spoon  1.2.4.5    Dessert/Salad fork  1.2.4.6    Sauce ladle  1.2.4.7    Soup ladle  1.2.5  Knife  1.2.5.1    Bread and butter knife  1.2.5.2    Dinner knife  1.2.5.3    Steak knife  1.2.6  Glass and pitcher  1.2.6.1  Water goblet  1.2.6.2  High ball  1.2.6.3  Red/white wine glass  1.2.6.4  Water Pitcher  1.3  Japanese table ware  1.3.1  Tray  1.3.2  Rice bowl  1.3.3  Soup bowl  1.3.4  Pickle dish  1.3.5  Soy dish  1.3.6  Teacup  1.3.7  “Shoki” (chopstick rest)  1.3.8  Chopsticks  1.3.9  Ramen bowl  1.3.10  “Donburi” bowl  1.3.11   Main dish",
            "metadata": {
                "source": "datasets\\raw\\Ship_s Catering Services  NC I.pdf",
                "page": 29
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08  TR - SHIP’S CATERING SERVICES NC I   Promulgated   May  2013   29   VARIABLES  RANGE  2.  Condiment  May include:  2.1  Ketchup  2.2  Hot sauce  2.3  Worcestershire  2.4  Salad dressing  2.5  Spreads  2.6  Mustard  2.7  Olive oil and vinegar  2.8  Salt and pepper  2.9  Japanese condiment  2.9.1 Soy sauce  2.9.2 Tonkatsu sauce  2.9.3 Japanese pepper  2.9.3 Japanese mayonnaise  2.9.4 Wasabi   3.  Hot holding food equipment  May include:  3.1  Rice cooker  3.2  Soup warmer  3.3  Food warmer",
            "metadata": {
                "source": "datasets\\raw\\Ship_s Catering Services  NC I.pdf",
                "page": 30
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR - SHIP’S CATERING SERVICES NC I Promulgated May 2013 30 EVIDENCE GUIDE 1. Critical aspects of competency Assessment requires evidence that the candidate: 3.1 demonstrated proper handling and care of tools and equipment. 3.2 complied with occupational and safety practices. 3.3 set-up and cleared the tables. 3.4 served food. 3.5 identified faults and problems and the necessary corrective action. 3.6 prepared pantry area for service. 2. Required Knowledge 2.1 Types and uses of table ware 2.2 Types and uses of condiments 2.3 Handling of garbage/waste 2.4 Handling of hot holding food equipment 2.5 Types of food service 2.6 MARPOL and relevant regulations 2.7 Safety practices 2.7.1 Practice hygienic preparation and teamwork to colleagues 2.7.2 Food safety hazard 2.7.3 Providing safe food 2.8 Familiarity with food and beverage combination 3. Required Skills 3.1 Effective communication skills 3.2 Application of food service 3.3 Application of cleaning skills 3.4 Operating hot holding food equipment 3.5 Care in handling breakable items 4. Resource Implications The following resources should be provided: 4.1 access to relevant workplace or appropriately simulated environment where assessment can take place 4.2 tools, equipment and materials/supplies relevant to the activity or task 5. Methods of Assessment Competency in this unit must be assessed through: 5.1 demonstration and questioning of related underpinning knowledge 5.2 written Examination 5.3 portfolio 6 Context of Assessment 6.1 Competency may be assessed in workplace or in simulated workplace setting (accredited assessment centers) 6.2 Assessment shall be observed while tasks are being undertaken either individually or as a team under limited supervision",
            "metadata": {
                "source": "datasets\\raw\\Ship_s Catering Services  NC I.pdf",
                "page": 31
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08 TR - SHIP’S CATERING SERVICES NC I Promulgated May 2013 31 UNIT OF COMPETENCY : PERFORM HOUSEKEEPING SERVICES UNIT CODE : MTM512314 UNIT DESCRIPTOR : This unit deals with the knowledge, skills and attitudes in performing housekeeping service. It includes performing cabin service, cleaning assigned areas, handling and disposal of garbage, laundering linen/special laundry items and storing of cleaning materials and equipment. ELEMENTS PERFORMANCE CRITERIA Italicized terms are elaborated in the Range of Variables 1. Perform cabin services 1.1 Linens and towels are changed as per ship’s standard 1.2 Headboard, furniture, appliances and port holes are dusted as per ship’s standard practice 1.3 Glasses, coffee cups, ash trays and utensils are cleaned, dried and stored 1.4 Cabin and toilets are cleaned as per ship’s standard procedures 1.5 Vacuum cleaning is performed on all carpeted areas in the cabin 1.6 Bed setting is performed as per ship’s standard 1.7 Cabin and toilet amenities are replenished as per ship’s standard 1.8 Garbage are collected and disposed as per garbage disposal regulations 1.9 Soiled linens and towels are collected and sorted accordingly and readied for laundry 1.10 Furniture, appliances, light, and air vents are checked for defects and reported to concerned personnel 2. Clean assigned areas 2.1 Appropriate cleaning materials and equipment are prepared as per ship’s cleaning procedures 2.2 Assigned areas and its contents are cleaned using appropriate cleaning equipment 2.3 Stripping and waxing of deck is applied according to ship’s schedule 2.4 Air ducts, lights, walls and ceilings are cleaned as per cleaning schedule 2.5 Cleaning equipment are cleaned after use as per manufacturers’ instruction 2.6 Toilet amenities are replenished as per ship’s standard 2.7 Safety signages are placed in the areas to be cleaned 2.8 Garbage are collected and disposed as per garbage disposal regulations",
            "metadata": {
                "source": "datasets\\raw\\Ship_s Catering Services  NC I.pdf",
                "page": 32
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08  TR - SHIP’S CATERING SERVICES NC I   Promulgated   May  2013   32   ELEMENTS  PERFORMANCE CRITERIA  Italicized terms are elaborated in the  Range of Variables  3.   Handle and dispose garbage  3.1  Garbage collected are secured and transported to designated garbage collection area  3.2  Garbage is segregated and stored according to type  3.3  Garbage disposal procedures is applied according to type  3.4  Garbage containers are checked for damages and cleaned and sanitized in designated garbage cleaning area   4.  Launder soiled linen/special laundry items  4.1  Soiled linen/ special laundry items are collected and sorted according to ship’s laundry schedule.  4.2  Laundry equipment  is checked  before operation and used in accordance with manufacturer’s instructions  4.3  Sorted soiled linen/special laundry items is washed using designated washing machine  4.4  Washed linen/special laundry items  are checked for stains and damages and appropriate action is applied to remove stains  4.5  Linen/special laundry items are pressed/ironed, folded and stored according to type or delivered to owner  4.6  Any damage arising from the laundering process is recorded/reported to concerned personnel/supervisor   5.   Store cleaning materials and equipment  5.1   Cleaning  materials and equipment  are stored in  the designated areas as per ship’s standard  5.2   Cleaning materials are kept labeled with its original container  5.3  Usage of cleaning materials is monitored and recorded/reported to the supervisor",
            "metadata": {
                "source": "datasets\\raw\\Ship_s Catering Services  NC I.pdf",
                "page": 33
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08  TR - SHIP’S CATERING SERVICES NC I   Promulgated   May  2013   33    RANGE OF VARIABLES   VARIABLES  RANGE  1.  Linens and towels  May include:  1.1   Bed covers  1.2   Bed sheets  1.3   Blankets  1.4   Comforters  1.5   Pillow cases  1.6   Bath towels  1.7   Face towels  1.8   Hand towel  1.9   Foot Mat  1.10  Curtains    2.  Furniture  May include:  2.1   Side and center tables  2.2   Drawer  2.3   Sofas  2.4   Cabinets  2.5   Bar counters   3.   Appliances  May include:  3.1   TV  3.2   Radio  3.3   Telephone  3.4   Refrigerator  3.5   Video Player  3.6   Computer and printer    4. Cabin and toilet amenities  May include:  4.1   Hand soap  4.2   Toilet paper   5. Cleaning materials and equipment  May include:  5.1   Wet or dry vacuum cleaner  5.2   Mops  5.3   Mop head squeezer  5.4   buckets  5.5   Squeegee  5.6   Floor polisher  5.7   Dust pan  5.8   Push brush",
            "metadata": {
                "source": "datasets\\raw\\Ship_s Catering Services  NC I.pdf",
                "page": 34
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08  TR - SHIP’S CATERING SERVICES NC I   Promulgated   May  2013   34   VARIABLES  RANGE   5.9.  Garbage bin/container  5.10. Bottle sprayer  5.11  Sponge  5.12  Clean rags  5.13  Glass cleaner  5.14  Air freshener  5.15  Furniture polisher  5.16  Toilet bowl cleaner  5.17  Laundry cleaning agents (soap, bleach, fabric conditioner)   6.  Assigned areas  May include:  6.1  Recreation room  6.2  Saloon  6.3  Mess hall  6.4  Sanitary areas  6.5  Hallways  6.6  Laundry room  6.7  Day room   7.  Special  laundry items  May include:  7.1   Officers’ uniform  7.2   Personal clothing  7.3   Apron   8.  Laundry  equipment :  May include:  8.1   Washing Machine  8.2   Dryers  8.3   Steam Presses  8.4   Irons  8.5   Hangers",
            "metadata": {
                "source": "datasets\\raw\\Ship_s Catering Services  NC I.pdf",
                "page": 35
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08  TR - SHIP’S CATERING SERVICES NC I   Promulgated   May  2013   35  EVIDENCE GUIDE   1.  Critical aspects of  competency   Assessment requires evidence that the candidate :  1.1   performed cabin service .  1.2   maintained cleanliness in the assigned areas .  1.3   handled and disposed waste .  1.4  laundered linen/special laundry items .  1.5   stored cleaning materials .    2.   Required Knowledge    2.1   Cabin cleaning procedure  2.2   Handling and disposing garbage according to  regulations  2.3  Types and uses of laundry equipment  2.4   Types, uses and storing cleaning agents and materials  2.5   Relevant  regulations pertaining  to cleaning of work areas and garbage management   3.  Required Skills  3.1   Communication skills  3.2   Operating cleaning equipment  3.3  Operating laundry equipment  3.4  Segregating and disposing waste  3.5  Housekeeping skills   4.  Resource Implications   The  following resources should be provided :  4.1  access to relevant workplace or appropriately simulated environment where assessment can take place  4.2  tools, equipment and materials/supplies relevant to the activity or task    5.   Methods of  Assessment   Competency in this unit must be assessed through :  5.1   demonstration and questioning of related underpinning  knowledge  5.2   written Examination  5.3   portfolio   6.   Context of Assessment   6.1  Competency may be assessed in workplace or in simulated work place setting (accredited assessment centers)  6.2  Assessment shall be observed while tasks are being undertaken either individually or as a team under limited supervision",
            "metadata": {
                "source": "datasets\\raw\\Ship_s Catering Services  NC I.pdf",
                "page": 36
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08  TR - SHIP’S CATERING SERVICES NC I   Promulgated   May  2013   36  UNIT OF COMPETENCY  :  PROVIDE ASSISTANCE IN RECEIVING AND STORING PROVISION AND SUPPLIES   UNIT CODE  :  MTM512315   UNIT DESCRIPTOR  :  This unit deals with the knowledge, skills and attitudes in providing assistance in receiving and storing provision and supplies   ELEMENTS  PERFORMANCE CRITERIA  Italicized terms are elaborated in the  Range of  Variables  1.  Provide assistance in receiving provision and supplies       1.1.  Trolley is prepared to transport provision and supplies  as per standard operating procedures  1.2   Weighing scale is prepared and used in accordance with manufacturer’s instructions  1.3   Inspected provisions and supplies are received in accordance with ship’s standard  2.  Provide assistance in storing provision and supplies  2.1  Storeroom are kept clean and freed from obstruction         2.2  Provisions and supplies are transported and arranged in First In First Out (FIFO) order  2.3    Stocks Control System  is identified and applied  in accordance with industry practice  2.4  Task is performed using prescribed PPEs",
            "metadata": {
                "source": "datasets\\raw\\Ship_s Catering Services  NC I.pdf",
                "page": 37
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08  TR - SHIP’S CATERING SERVICES NC I   Promulgated   May  2013   37  RANGE OF VARIABLES   VARIABLES  RANGE  1.  Provision  May include:  1.1  Meat  1.2  Poultry  1.3  Seafood   1.4  Fruits and Vegetables  1.5  Dairy products  1.6  Starches  1.7  Dry goods  1.8  Beverages   2.  Supplies  May include:  2.1  Bonded items  2.2  Cleaning materials  2.3  Linen   3.  Storeroom  May include:  3.1  Dry storeroom  3.2  Refrigerator  3.3  Freezer  3.4  Bonded store   4.  Stock  Control System  May include:  4.1  Manual  4.2  Computerized",
            "metadata": {
                "source": "datasets\\raw\\Ship_s Catering Services  NC I.pdf",
                "page": 38
            },
            "type": "Document"
        },
        {
            "page_content": "TESDA - SOP - QSO - 01 - F08  TR - SHIP’S CATERING SERVICES NC I   Promulgated   May  2013   38  EVIDENCE GUIDE   1.  Critical aspects of competency   Assessment requires evidence that the candidate:   1.1  provided assistance in receiving the provision.  1.2  provided assistance in storing the provision.   2.  Required Knowledge   2.1  Different temperatures of storerooms  2.2  Kinds of provisions  2.3  Units of measurements  2.4   Different storing methods  2.5   Storing of provision   3.  Required  Skills  3.1 Oral and written communication skills   4.  Resource Implications   The following resources should be provided:  4.1   access to relevant workplace or appropriately simulated environment where assessment can take place  4.2   tools, equipment and materials/supplies relevant to the activity or task    5.  Methods of Assessment   Competency in this unit must be assessed through:  5.1  demonstration and questioning of related underpinning knowledge  5.2  written Examination  5.3  portfolio   6.  Context of Assessment   6.1   Competency may be assessed in workplace or in simulated workplace setting (accredited assessment centers)  6.2   Assessment shall be observed while tasks are being undertaken under limited supervision",
            "metadata": {
                "source": "datasets\\raw\\Ship_s Catering Services  NC I.pdf",
                "page": 39
            },
            "type": "Document"
        }
    ]
}