{
    "name": "Tile Setting NC II",
    "core_competencies": [
        {
            "page_content": "TITLE SETTING NC II\n38 CORE COMPETENCIES UNIT OF COMPETENCY: LAY AND REPAIR WALL AND FLOOR TILES\nUNIT CODE: CON713332\nUNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude required to lay and repair wall and floor tiles.\nELEMENT PERFORMANCE CRITERIA Italicized and bold terms are elaborated in the Range of Variables\n1. Plan and prepare for work\n1.1 Work instruction is secured and interpreted in line with job requirements\n1.2 Safety and quality requirements are identified in line with Occupational Safety and Health Standards (OSHS) and company standard operating procedures\n1.3 Material tiles, tools and equipment are identified in accordance with job requirements\n2. Lay out tiling job\n2.1 Area(s) to be tiled is checked in line with job requirements\n2.2 Tiles are laid out in line with specifications\n3. Install wall tiles\n3.1 Cement or cement-based adhesive is prepared according to manufacturer’s instructions or recommendation then applied to tile / wall surface\n3.2 Tiles are prepared and installed with guide / batterboard set to level alignment\n3.3 Horizontal joint is checked for straightness and tile edges and surface alignment are checked\n3.4 Tiles are fixed to alignment retaining designed pattern to specifications\n3.5 Even margins are shown around openings, frames and fittings, where applicable\n3.6 Special cut tile is installed to create a square corner in accordance with drawings and specifications, where applicable\n3.7 Vertical tiles are finished according to plumbness and square corner requirements\n3.8 All joints are maintained straight and uniform in width considering allowance for tolerance of tile\n3.9 Expansion gaps are maintained following specifications\n3.10 Tiled surface is polished and cleaned to specifications and manufacturer’s recommendations.",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 38
            },
            "type": "Document"
        },
        {
            "page_content": "Title: Tile Setting NC II\n\n39 4. Cut tiles  \n4.1 Tiles are cut according to required specifications  \n4.2 Recess hole or curve cut by hand or machine is in required tolerance  \n4.3 Miter joints are prepared, retaining glazing on miter with no chips and uniform in size  \n4.4 Special cut tile is prepared in accordance with drawings and specifications, where applicable  \n4.5 Tile is jolly-edged to form a miter to prevent the tile body from being exposed at the joint  \n4.6 Safety precautions are applied in line with Occupational Safety and Health Standards  \n\n5. Grout space between tiles  \n5.1 Joints are cleaned and prepared for grouting following manufacturer's specifications  \n5.2 Grout is mixed and applied according to manufacturer's specifications  \n5.3 Tiles are cleaned and polished to specifications, removing all dust from surface and joints  \n\n6. Install vertical mosaic sheets  \n6.1 Paper-faced or mesh-backed mosaics are fixed to background with tile adhesive  \n6.2 Adjustments are made to ensure spacing is uniform and pattern and alignment are maintained  \n6.3 Area is finished with mosaics level to line, if applicable, surface straight and flat and grout are finished to specifications  \n\n7. Lay floor tiles  \n7.1 Adhesive is selected based on specifications, tile type and climatic condition  \n7.2 Surface is cleaned from residue and protrusions  \n7.3 Adhesive is mixed following manufacturer's specifications  \n7.4 Tiles are laid to manufacturer's specifications and expansion gaps maintained between walls and tiles  \n7.5 Grout is mixed and applied to clean joints and surface according to manufacturer's specifications  \n7.6 Finished tile work is polished and cleaned to specifications and manufacturer recommendations",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 39
            },
            "type": "Document"
        },
        {
            "page_content": "Title: TILE SETTING NC II\n40 8. Tile treads, risers, steps and thresholds\n8.1 Risers and steps are calculated and determined from concrete steps / stairs\n8.2 Steps are laid out for uniform rise and take even cut on both sides\n8.3 Step riser packing or render support is placed, where necessary, and riser tiles are installed according to alignment\n8.4 Treads are installed in line with the top edge of risers within the required tolerance\n8.5 Grout is applied to wet joints and finished flush with tiles to a smooth finish.\n8.6 Finished tilework is cleaned and polished and free of pitted, chipped, cracked or scratched tile resulting from laying operation\n8.9 Tiled surface is polished and cleaned to specifications and manufacturer’s recommendations.\n9. Repair damaged tile work\n9.1 Damaged tiles removal procedure is performed following established / recommended practices\n9.2 Old bedding is cleaned and cleared for placement of replacement tile\n9.3 Replacement tiles are selected and cut, if necessary, following existing pattern and face\n9.4 Tiles are fitted and installed to maintain alignment with joints for uniform spacing\n9.5 Grouting is performed and tile face is cleaned from dirt and other residues\n9.6 Tiled surface is polished and cleaned to specifications and manufacturer’s recommendations.\n10. Clean up\n10.1 Work area is cleaned as per OSHS requirements\n10.2 Waste and unwanted materials are disposed of following company standard operating procedure and OSH and environmental requirements\n10.3 Unused materials are stored / stacked according to enterprise procedures\n10.4 Tools and equipment are cleaned and maintained following manufacturer's specifications",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 40
            },
            "type": "Document"
        },
        {
            "page_content": "Title: TILE SETTING NC II\n41 RANGE OF VARIABLES\nVARIABLE RANGE\n1. Job requirements\n1.1 Drawings\n1.2 Specifications\n2. Quality requirements\n2.1 Condition of tile\n2.2 Quality of prepared surface\n2.3 Quality of materials\n2.4 Setting out procedures\n2.5 Application procedures\n2.6 Specified finish\n2.7 Attention given to specification of work\n2.8 Workplace operations and procedures\n3. Occupational Safety and Health Standards\n3.1 Protective clothing and equipment\n3.2 Use of tools and equipment\n3.3 Handling of materials\n3.4 Hazardous materials\n3.5 Working platforms\n4. Tools and equipment\nMay include but not limited to:\n4.1 Tile cutters and scribers\n4.2 Masonry drill/bits\n4.3 Measuring tape / ruler\n4.4 Trowels\n4.5 Straight edge\n4.6 Level and plumb bob\n4.7 Wet saw\n4.8 Scrapers\n4.9 Hole saw\n4.10 Rubber mallet\n4.11 Rubber float or squeegee\n5. Materials\n5.1 Ceramic tiles\n5.2 Porcelain tiles\n5.3 Mosaics\n5.4 Tile adhesive\n5.5 Tile grout\n5.6 Tile trims\n5.7 Stair nosing\n5.8 End caps/bull nose",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 41
            },
            "type": "Document"
        },
        {
            "page_content": "Title: TILE SETTING NC II\n42 6. Required specifications May include but not limited to: 6.1 Without jagged 6.2 Without flayed edges 6.3 Without broken/chipped corners",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 42
            },
            "type": "Document"
        },
        {
            "page_content": "Title Setting NC II 43 Evidence Guide 1. Critical aspects of Competency Assessment requires evidence that the candidate: 1.1 Demonstrates ability to comply with OHS requirements 1.2 Demonstrates ability to identify and use tools, materials, and equipment 1.3 Demonstrates ability to perform installation and laying of tiles 2. Underpinning Knowledge and attitudes 2.1 Shop mathematics 2.2 Technical drawing and specifications 2.3 Materials identifications and classifications 2.4 Manufacturer’s product specifications and instructions 2.5 Compliance with quality requirements, company rules and regulations 2.6 Work ethics 2.7 Waste management 3. Underpinning Skills 3.1 Communication skills 3.2 Installing and laying of tiles 3.3 Applying cutting techniques and procedures 3.4 Estimating materials and tools 3.5 Maintaining tools and equipment 3.6 Observing safe use of tools and equipment 3.7 Proper handling and storing of materials 4. Resource Implications The following resources MUST be provided: 4.1 PPE 4.2 Relevant tools, equipment and materials 4.3 Work instructions and specifications 4.4 Workplace location 5. Methods of Assessment Competency may be assessed through: 5.1 Observation/demonstration 5.2 Oral questioning 5.3 Portfolio assessment 5.4 Third party report 6. Context for Assessment 6.1 Competency will be assessed in the workplace or simulated workplace environment",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 43
            },
            "type": "Document"
        },
        {
            "page_content": "Title: TILE SETTING NC II\n44 UNIT OF COMPETENCY: TILE CORNERS UNIT CODE: CON713333 UNIT DESCRIPTOR: This unit covers the knowledge, skills and attitude required to tile corners. ELEMENT PERFORMANCE CRITERIA Italicized and bold terms are elaborated in the Range of Variables 1. Plan and prepare for work 1.1 Work instruction is secured and interpreted in line with job requirements. 1.2 Safety and quality requirements are identified in line with Occupational Safety and Health Standards (OSHS) and company standard operating procedures 1.3 Material tiles, tools and equipment are identified in accordance with job requirements 2. Tile external corners 2.1 Set out tiles is checked for specified tolerance of +/- 2 mm based on plumbness and levelness. 2.2 External corners are checked for flatness of surfaces and straightness of intersections. 2.3 Tile trim is installed to maintain external returns and tile trim is fitted to both corners. 2.4 Tiles are installed without voids in tile bed and fully bedded to maintain alignment to specifications 2.5 Corners are maintained square and finished to specifications. 2.6 Tiled surface is polished and cleaned to specifications and manufacturer’s recommendations.",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 44
            },
            "type": "Document"
        },
        {
            "page_content": "Title: TILE SETTING NC II\n45 3. Tile internal corners\n3.1 Internal corners are checked for flatness of surfaces and straightness of intersections.\n3.2 Tiles are fitted and cut, where required, and installed to one wall maintaining alignment to set out and specifications.\n3.3 Tiles are fitted and cut, where required, and installed abutting adjacent wall tiles to line, set out, and specifications.\n3.4 Joints for abutting tiles are made in accordance with designed margin for grouting or for expansion joint, where applicable, to specifications.\n3.5 Tiles are installed to cove tiles or trim and finished to alignment and specifications.\n3.6 Tiled surface is polished and cleaned to specifications and manufacturer’s recommendations.\n4. Clean up\n4.1 Work area is cleaned as per OSHS requirements\n4.2 Waste and unwanted materials are disposed of following company standard operating procedure and OSHS requirements\n4.3 Unused materials are stored / stacked according to enterprise procedures\n4.4 Tools and equipment are cleaned and maintained following manufacturer's specifications",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 45
            },
            "type": "Document"
        },
        {
            "page_content": "Title: Tile Setting NC II\n46 Range of Variables\nVariable Range\n1. Job requirements\n1.1 Drawings\n1.2 Specifications\n2. Quality requirements\n2.1 Workplace operations and procedures\n2.2 Quality of materials\n2.3 Control of handling procedures\n2.4 Use and maintenance of equipment\n2.5 Attention to specification of work\n2.6 Quality of prepared surface\n3. Occupational Safety and Health Standards\n3.1 Workplace environment and safety\n3.2 Protective clothing and equipment\n3.3 Use of tools and equipment\n3.4 Handling of materials\n3.5 Working platforms\n3.6 Hazardous materials\n4. Material tiles\nMay include but not limited to:\n4.1 Ceramic tiles\n4.2 Porcelain tiles\n4.3 Mosaic\n4.4 Tile adhesive\n4.5 Tile grout\n4.6 Tile trims\n4.7 Stair nosing\n4.8 End caps / bull nose\n5. Tools and equipment\nMay include but not limited to:\n5.1 Tile cutter and scribers\n5.2 Masonry drill bits\n5.3 Measuring tape rule\n5.4 Trowels\n5.5 Straight edge\n5.6 Level and plumb bob\n5.7 Wet saw\n5.8 Knee pads\n6. External corners\nMay include but not limited to:\n6.1 Curved plastic bead / rim\n6.2 Curved external corner tiles",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 46
            },
            "type": "Document"
        },
        {
            "page_content": "Title: TILE SETTING NC II\n47 7. Internal corners May include but not limited to: 7.1 Plastic bead / trim 7.2 Butt joints",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 47
            },
            "type": "Document"
        },
        {
            "page_content": "Title: TILE SETTING NC II\n48 EVIDENCE GUIDE\n1. Critical aspects of Competency Assessment requires evidence that the candidate:\n1.1 Demonstrates ability to interpret job requirements\n1.2 Demonstrates ability to comply OSHS requirements in tile setting\n1.3 Demonstrates ability to perform tiling of external and internal corners\n1.4 Demonstrates ability to follow company standard operating procedures\n2. Underpinning knowledge\n2.1 Mensuration and trade Mathematics\n2.2 Technical drawings and plans specifications\n2.3 Procedures for tiling internal and external corners\n2.4 Occupational Health and Safety Standards\n2.5 Company rules and regulations\n2.6 Quality of material tile\n2.7 Manufacturer’s recommendations and specifications\n3. Underpinning Skills\n3.1 Applying mensuration and trade Mathematics\n3.2 Interpreting technical drawings and plans specifications\n3.3 Performing procedures for tiling internal and external corners\n3.4 Complying OSHS requirements\n3.5 Complying company rules and regulations\n3.6 Following manufacturer’s specifications and recommendations\n4. Resource Implications\nThe following resources MUST be provided:\n4.1 Workplace\n4.2 Plans and specifications\n4.3 Materials, tools and equipment relevant to work activity\n5. Methods of Assessment\nCompetency may be assessed through:\n5.1 Observation thru practical demonstration of skills\n5.2 Oral questioning\n5.3 Portfolio\n5.4 Third party report\n6. Context for Assessment\n6.1 Competency may be assessed in the workplace",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 48
            },
            "type": "Document"
        },
        {
            "page_content": "Title: TILE SETTING NC II\n49 UNIT OF COMPETENCY: TILE CURVED SURFACES\nUNIT CODE: CON713334\nUNIT DESCRIPTOR: This unit specifies the knowledge, skills and attitude required to tile curved surfaces\nELEMENT PERFORMANCE CRITERIA\nItalicized and bold terms are elaborated in the Range of Variables\n1. Plan and prepare for work\n1.1 Work instruction is secured and interpreted in line with job requirements.\n1.2 Safety and quality requirements are identified in line with Occupational Safety and Health Standards (OSHS) and company standard operating procedures\n1.3 Material tiles, tools and equipment are identified in accordance with job requirements.\n2. Tile curved wall and floor surfaces\n2.1 Level line is set out around the wall by intermediate marking using leveling equipment.\n2.2 Location of tiles is set out to determine balanced design and cutting requirements, if necessary.\n2.3 Template is made to form accurate curve line to tiled surface around the wall.\n2.4 Method for installing tiles is determined with identification of location of the first tile.\n2.5 Cement-based adhesive is prepared following manufacturer's specifications.\n2.6 Guide board is installed to level set out and template curve to specifications.\n2.7 Minimum voids are maintained in mortar tile beds and tiles are fixed, plumb (wall), and flush.\n2.8 Floor tiles are laid to set out grid with perimeter tiles marked and cut to fit curve wall.\n2.9 Tile grout is mixed with water and applied to joints according to specifications, to provide flush and smooth finish.\n2.10 Tiled surface is polished and cleaned to specifications and manufacturer’s recommendations.",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 49
            },
            "type": "Document"
        },
        {
            "page_content": "Title: TILE SETTING NC II\n\n50 3. Tile circular volume, wall and arches  \n3.1 Template is set out, cut, positioned and checked to maintain conformity to tile surface for curve.  \n3.2 Guide board is positioned and installed to line to maintain uniform spacing.  \n3.3 Tiles are marked and cut, where applicable, installed into place to specifications.  \n3.4 Tiles are installed on walls and plumb, maintaining levels and curvature of wall to specifications.  \n3.5 Tiles are installed to archways, maintaining line and curvature to specifications.  \n3.6 Tile grout is mixed with water and applied to joints of tiled surfaces and tiled surface is finished to specifications.  \n3.7 Tiled surface is polished and cleaned to specifications and manufacturer’s recommendations.  \n\n4. Install mosaic tiles on a circular column  \n4.1 Surface is checked from protrusions and from plastering imperfections.  \n4.2 Template is prepared for column tiling diameter to specifications.  \n4.3 Mortar is applied evenly to the required tiling diameter thickness and finished to curve based on prepared template specifications.  \n4.4 Guide board is positioned and installed to maintain level line.  \n4.5 Mosaic tiles are installed to column maintaining even spacing and level finish to specifications.  \n4.6 Tile grout is mixed with water and applied to tiled surface and tile surface is finished to specifications.  \n4.7 Tiled surface is polished and cleaned to specifications and manufacturer’s recommendations  \n\n5. Clean up  \n5.1 Work area is cleaned as per OSHS requirements  \n5.2 Waste and unwanted materials are disposed of following company standard operating procedure and OSHS requirements  \n5.3 Unused materials are stored / stacked according to enterprise procedures  \n5.4 Tools and equipment are cleaned and maintained following manufacturer's specifications",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 50
            },
            "type": "Document"
        },
        {
            "page_content": "Title: Tile Setting NC II\n51 Range of Variables\nVariable Range\n1. Job requirements\n1.1 Drawings\n1.2 Specifications\n2. Quality requirements\n2.1 Workplace operations and procedures\n2.2 Quality of materials\n2.3 Control of handling procedures\n2.4 Use and maintenance of equipment\n2.5 Attention to specifications of work\n3. OSHS requirements\n3.1 Workplace environment and safety\n3.2 Protective clothing and equipment\n3.3 Use of tools and equipment\n3.4 Handling of materials\n3.5 Working platforms and scaffoldings\n3.6 Hazardous materials\n4. Material tiles\nMay include but not limited to:\n4.1 Ceramic tiles\n4.2 Porcelain tiles\n4.3 Mosaic\n4.4 Tile adhesive\n4.5 Tile grout\n4.6 Tile trims\n4.7 End caps / bull nose\n5. Tools and equipment\nMay include but not limited to:\n5.1 Tile cutters and scribers\n5.2 Masonry drill bits\n5.3 Measuring tape / rule\n5.4 Trowels\n5.5 Straight edge\n5.6 Spirit level\n5.7 Light hand roller\n5.9 Scrapers\n5.10 Sand paper\n5.11 Pencil\n5.12 Scaffolding\n5.13 Steel square\n5.14 String or chalk line",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 51
            },
            "type": "Document"
        },
        {
            "page_content": "TILE SETTING NC II 52 6. Leveling equipment 6.1 Spirit level 6.2 Water level 6.3 Plumb bob 7. Surface May include but not limited to: 7.1 Plasterboard 7.2 Fiber cement sheet 7.3 Brickwork 7.4 Block work 7.5 Concrete 7.6 Plastered face 7.7 Marine plywood 7.8 Gypsum board 7.9 Styropor board",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 52
            },
            "type": "Document"
        },
        {
            "page_content": "Title Setting NC II 53 Evidence Guide 1. Critical aspects of Competency Assessment requires evidence that the candidate: 1.1 Demonstrates ability to interpret job requirements 1.2 Demonstrates ability to comply OSHS requirements 1.3 Demonstrates ability to perform procedures for tiling curved wall and floor surfaces 1.4 Demonstrates ability to perform procedures for tiling circular volume, wall and arches 1.5 Demonstrates ability to perform procedures to install mosaic tiles for a circular column 1.6 Demonstrates ability to follow company standard operating procedures 2. Underpinning knowledge 2.1 Mensuration and trade Mathematics 2.2 Occupational Health and Safety Standards requirements 2.3 Procedures for tiling curved and floor surfaces 2.4 Procedures for tiling circular volume, wall and arches 2.5 Procedures for installing mosaic tiles on a circular column 2.6 Company standard operating procedures 2.7 Manufacturer’s recommendations / specifications 3. Underpinning Skills 3.1 Applying mensuration and trade Mathematics 3.2 Interpreting plans specifications and drawings 3.2 Complying OSHS requirements 3.3 Performing procedures for tiling curved and floor surface 3.4 Performing procedures for tiling circular volume, wall and arches 3.5 Performing procedures for installing mosaic tiles 3.6 Following company rules and regulations 3.7 Following manufacturer’s specifications and recommendations 4. Resource Implications The following resources MUST be provided: 4.1 Plans and specifications 4.2 Work area 4.3 Material, tools and equipment relevant to the activity 5. Methods of Assessment Competency may be assessed through: 5.1 Observation of practical skills 5.2 Oral questioning 6. Context for Assessment 6.1 Competency may be assessed in the workplace",
            "metadata": {
                "source": "datasets\\raw\\Tile Setting NC II.pdf",
                "page": 53
            },
            "type": "Document"
        }
    ]
}